[
  [
    "[Ariadne] Hi. I'm glad I'm not the only one here.",
    "[Organizm(-:] Hi there, darling.",
    "[Romeo-y-Cohiba] Where there are boys, there have to be girls. Some funny rainbow-coloured patches of light just appeared on my walls.",
    "[Monstradamus] That's odd, I had them too. Or maybe I imagined it."
  ],
  [
    "[Nutscracker] Ariadne? Did you start this thread?",
    "[Ariadne] Yes. But no one answered, and I fell asleep.",
    "[Monstradamus] So why did you write that phrase about the labyrinth?",
    "[Ariadne] I was trying to remember where it came from, but I couldn't. I had the feeling it was very important.",
    "[Monstradamus] Who are you and how did you get here?",
    "[Ariadne] I'm in exactly the same situation as you.",
    "[Organizm(-:] In that case, we know all about you already. Your real name's xxx, you're xxx years old and you come from xxx.",
    "[Ariadne] I know what's going on here.",
    "[Nutscracker] How?",
    "[Ariadne] I saw it all in a dream.",
    "[Romeo-y-Cohiba] I don't think I'd exactly regard that as bona fide information.",
    "[Monstradamus] I wouldn't mind hearing about it, though. Tell us about it.",
    "[Ariadne] I saw this old city. I mean, really ancient. The kind they must have built thousands and thousands of years ago. It was really beautiful there. Roads paved with big, flat stones, stone walls covered with living curtains of some climbing plant with pale-pink flowers. The doors and windows of all the houses were locked, but all the time I had the feeling I was being watched by someone. I wandered round the streets for ages, but I didn't meet anyone. And then on the crossroads up ahead of me I kept catching sight of a dwarf dressed in grey rags and a strange hat with a wide brim and a round crown. Every time I spotted him, he instantly darted round a corner, as though he could feel my gaze on his back. It happened lots of times, over and over again. Soon I realised he wasn't hiding from me, it was just that the rhythm of his movement was linked with the rhythm of mine so I couldn't see him for more than those few seconds. Only don't ask me how I realised it, in a dream everything has its own logic. I began trying to adjust to the rhythm, trying to get a better look at the dwarf. By choosing broad, straight streets, I could keep him in my field of vision for longer. But most of the streets were narrow and crooked - the way they linked up made a genuine labyrinth. I realised there were actually two dwarves, but it was easy to confuse the second one with the first. He was dressed in exactly the same way, in some old rags, only the brim of his hat was bent up on one side. Gradually I became certain there was someone else with them as well, but no matter how hard I tried, I couldn't see the third person. Sometimes I could just catch a glimpse of the edge of his dark cloak from round a corner. I guessed I needed to find the way to the main street - it would be long and wide and I would be able to see all of them...",
    "[Romeo-y-Cohiba] What's the point of us listening to all this?",
    "[Monstradamus] Please, don't interrupt!",
    "[Monstradamus] What happened after that, Ariadne?",
    "[Ariadne] After that I made my way to the main street. There was a long line of palm trees in tubs along the middle of it. I remember that what was most astonishing was that there were yellow leaves everywhere, it was autumn, and then here were these palm trees.",
    "[Nutscracker] You started off with pink flowers. Now suddenly it's autumn, with yellow leaves.",
    "[Ariadne] Yes, autumn set in while I was following the dwarf. I thought he must have done that on purpose to spoil my mood and prevent me catching up with him. There was no one in the main street. I came to a large square with a fountain with bronze statues standing in it. From their style I thought they must be just as ancient as the city, but their subjects were more like something from a Japanese cartoon film - naked teenagers being strangled by tentacles twined around their bodies. Or snakes...",
    "[Nutscracker] What have Japanese cartoons got to do with anything?",
    "[IsoldA] She's talking about mangas, young girls who are raped by demons with their tentacles. It's a persistent theme in Japanese virtual porn.",
    "[Monstradamus] It's an expression of the repressed subconscious frustration resulting from defeat in the Second World War. The schoolgirl raped in these cartoons symbolises the Japanese national spirit, and the monster that sprouts these multiple phallic tentacles represents the modern Western-style corporate economy."
  ],
  [
    "[Monstradamus] Then, if no one has any objections, Ariadne can continue.",
    "[Ariadne] I realised I had to go over to the fountain and then I would see both dwarves. Only don't ask me how I realised it; it was suddenly clear, that's all. When I reached the fountain I turned my back to it and leaned against the wall. Opposite me there was a building with a colonnade - a massive, depressing building with ugly superstructures on the roof. It occurred to me somehow that a long time ago it had been burnt down, and nothing was left but the stone skeleton, and since then a lot of attempts had been made to repair it and restore it to life. But you could still see the traces of the catastrophe through the restoration work and the paint, and you could tell the building was dead and empty...",
    "[Romeo-y-Cohiba] I'd say we need an entire committee of psychiatrists for this spiel. Or we could ask Monstradamus, he's got a good handle on this stuff. What was that phrase he used - corporate frustration?",
    "[Monstradamus] Romeo, please, be patient just a moment longer.",
    "[Ariadne] Suddenly I noticed one of the dwarves standing beside me - the one with the side of his hat bent up. I didn't see how he got there. He was really close to me, but I couldn't see his face under the hat. I remember he was wearing medieval-style pointed shoes in red and white stripes. He began speaking without raising his head, and what he said was very strange. He said the master he served was the creator of everything I saw around me, and a great many other things too. The way I understood it, this master of his was not a man. Or not just a man. His name was Asterisk...",
    "[Monstradamus] Are you sure you heard correctly?",
    "[Ariadne] I think so. The way the dwarf explained it, Asterisk is some boundlessly and infinitely powerful being. I asked whether he didn't mean God, and he said that God was merely Asterisk's errand boy. I asked how that was possible. The dwarf told me not even to try to understand. He said it was a great mystery, and repeated this several times. I asked him what was the correct name to use for someone who is mightier than God. Any name you like, the dwarf replied - the word 'Asterisk', or any other that can be spoken - they're no more than loose dust covers, they make no difference at all. That was what he said, honestly...",
    "[Romeo-y-Cohiba] What absolute gibberish.",
    "[Ariadne] The way I understood it, Asterisk is angry with people because at some time in the past they killed him. Or because they will kill him at some time in the future - the dwarf expressed himself in such a complicated manner, you could take his meaning any way at all. Since that time - or until that time - people have to pay tribute to Asterisk by sending him people to join in his games and die in his arena. Like us, for instance...",
    "[Nutscracker] Well, there you go then.",
    "[Ariadne] But the dwarf said there was no need to be upset, because the people Asterisk sacrifices to himself all have already been born, and dying in the arena is the common fate that nobody escapes. I tried to ask in that case what was the point of the sacrificial tribute, but the dwarf began getting nervous and said, 'Look, he's coming, now you can see him for yourself.' I looked up. Two figures had appeared in front of the burnt-out building. Striding along solemnly in front was a dwarf holding a flag with the Merrill Lynch symbol on it - you remember it, they have that jolly little bull - and the inscription 'Be Bullish!' But I didn't feel like laughing at all, the figure following it looked so terrifying. I don't even know what to call him. He wasn't like a man. He was absolutely massive, and I thought for a moment he was a monstrously overgrown mushroom with a big cap of blackish-green metal. Then I took a closer look at him. He was wearing a long loose robe that reached right down to the ground, dark-coloured and not particularly clean either, but not the same kind of tattered rags as the dwarves. And on his head he had a bronze helmet, like a gladiator's mask - a headpiece with a wide brim and a plate with holes in it where the face would be. There were two horns on the helmet...",
    "[Monstradamus] Like a bull's horns?",
    "[Ariadne] They were much more massive and they didn't stick out to the sides, they ran backwards, merging into the helmet to form a single block. If I could compare them with anything, they looked a lot like the silencers of a bronze motorbike, curving along the rim of the headpiece with the round crown. There were lots of little rods and tubes on the helmet as well, all made of bronze, and they linked all its different parts together, so the whole thing looked a bit like an antique rocket engine.",
    "[Nutscracker] Did he say anything?",
    "[Ariadne] No, I didn't see him for very long. I only had just enough time to think the two dwarves were dressed so strangely because they were trying to look like him. Beside him they looked absolutely tiny. And there seemed to be something wistful or sad and lonely about him, as if he was some banished emperor. Or just the opposite, as though he was an emperor who had been left all alone because he had banished everyone else.",
    "[Monstradamus] Is that how the dream ended?",
    "[Ariadne] I didn't see Asterisk again. Suddenly the dwarf and I were somewhere else, on one of the little streets, facing an old wooden door with a handle in the form of a ring set through the head of a bull. The dwarf knocked on the door with the ring and it opened. Inside there was a small room. From where we were standing all we could see was a bed with a man sleeping on it, a tall man with a moustache and a mole beside his nose. The dwarf muttered that we were in the wrong place, led me to a different door and opened it in the same way. The room behind it looked the same, but it was empty. The dwarf raised his finger and asked, 'I shall construct a labyrinth in which I can lose myself, together with anyone who tries to find me - who said this and about what?' I started thinking about it - in the dream I almost knew the answer. Then suddenly he pushed me inside and slammed the door shut.",
    "[Monstradamus] What happened after that?",
    "[Ariadne] The push woke me up and I found myself in the room I am in now. Then I sat down at the desk with the screen and typed in that question. I was afraid I might forget it. But I can still hear it in my head now.",
    "[Monstradamus] Is it the same room as you entered in the dream?",
    "[Ariadne] It's hard to say. It's just as small.",
    "[Romeo-y-Cohiba] And who was the man with the mole beside his nose?",
    "[Ariadne] I don't know. I'd never seen him before.",
    "[Romeo-y-Cohiba] Can you describe him in more detail? Exactly where was this mole of his?",
    "[Ariadne] Between the side of the nostril and the cheek. He had a horseshoe moustache too. And he was absolutely bald. Big. I definitely remember that his arm was lying on the pillow and it had a tattoo on it, an anchor with a dollar sign twisted round it. I though it might be a yacht club symbol. A pretty moth-eaten type really.",
    "[Romeo-y-Cohiba] Well thanks a lot, sweetheart.",
    "[Nutscracker] I suspect someone might just have recognised himself. Right, Romeo?",
    "[Romeo-y-Cohiba] No one's ever called me a moth-eaten type before. But I do have a tattoo like that on my arm."
  ],
  [
    "[Organizm(-:] Why's that?",
    "[Monstradamus] Because, phenomenologically speaking, she only exists in the form of messages of unknown origin signed 'Ariadne'.",
    "[Ariadne] Thanks. Ariadne.",
    "[Monstradamus] Ariadne, please don't take offence. I'm talking about a hypothetical possibility. It doesn't mean I suspect you of anything. The same thing could apply to any of us.",
    "[Organizm(-:] What does 'phenomenologically' mean?",
    "[Monstradamus] It's the way you can see these words now."
  ],
  [
    "[Ariadne] Everything I told you was the truth.",
    "[Nutscracker] Nobody ever doubted it. Nebuchadnezzar's just theorising, right?",
    "[Monstradamus] I'm not Nebuchadnezzar."
  ],
  [
    "[Ariadne] Perhaps Theseus is one of us?",
    "[Nutscracker] Perhaps the Minotaur is one of us.",
    "[Organizm(-:] I bet a hundred xxx the Minotaur's Monstradamus.",
    "[Monstradamus] Stop clowning about."
  ],
  [
    "[Ariadne] I've composed a little poem. Dedicated to Monstradamus.",
    "[Monstradamus] Let's hear it.",
    "[Ariadne] The Minotaur lurks at the door, His axe it gleams moon-bright. 'Dear Watson this could not be more...' Then silence in the night.",
    "[Monstradamus] A bit on the dark side. But maybe I deserve it for being so suspicious."
  ],
  [
    "[Ariadne] Did it happen in all the rooms?",
    "[Monstradamus] It did in mine.",
    "[UGLI 666] Do you mean the music or the door?",
    "[Ariadne] The whole thing at once."
  ],
  [
    "[Monstradamus] What can you see outside the door?",
    "[Ariadne] There's another room outside mine."
  ],
  [
    "[Romeo-y-Cohiba] Enjoy your meal. Just tell us what it was you turned.",
    "[Organizm(-:] When I'm feeding my tum, I go all deaf and dumb.",
    "[Ariadne] Organism, you only need to type two words! Then you can go ahead and eat in peace."
  ],
  [
    "[Monstradamus] There's a small flap to the right of the monitor. Just a rectangle in the wall. Lift the flap and you'll find a tray behind it.",
    "[Ariadne] I found it, thank you.",
    "[Romeo-y-Cohiba] But what are you supposed to turn? Organism said...",
    "[Ariadne] He was just joking, Romeo. Having a laugh at us."
  ],
  [
    "[Romeo-y-Cohiba] OK. See you tomorrow, if it ever comes.",
    "[IsoldA] Let's hope it does. Ah yes, something else I forgot to tell you. I braid my hair at the back.",
    "[Ariadne] I think they're in love.",
    "[Monstradamus] According to their names they have to be. Imagine being called Romeo. What else could you do?"
  ],
  [
    "[Monstradamus] Ariadne, are you awake already?",
    "[Ariadne] Where are all the others?",
    "[Monstradamus] I don't know. Sleeping, I suppose. Well then? Did you dream about anything?",
    "[Ariadne] Yes.",
    "[Monstradamus] Tell me about it.",
    "[Ariadne] It was like a lecture. I was sitting in a lecture hall in some educational institution - a technical college to judge from all the pieces of equipment standing along the walls. I can't say what kind of equipment it was, some pieces had screens like televisions, others looked like scales with a lot of springs and counterweights. The lecture hall looked like an amphitheatre - it sloped down to a board and standing there beside it was the same dwarf who spoke to me by the fountain. Apart from us two, there was no one there. The entire board was covered by a complicated diagram of some kind of device.",
    "[Monstradamus] Can you remember what came before that? How you got there?",
    "[Ariadne] No. The dwarf waved to me as if I was an old friend and told me they had heard about our wish to discover what was on their master's mind. He said that would be the subject of the lecture. Everything that happened seemed to be perfectly natural, and I didn't feel like I needed to ask any questions. Although there were lots of strange things. For instance, the diagram wasn't drawn on the board with chalk. It was carved into it, like an engraving. I realised that because when the dwarf wanted to correct something in the drawing he took a chisel and began stripping long shavings of plastic off the board and leaving bright lines on it.",
    "[Monstradamus] What was it a diagram of?",
    "[Ariadne] It was Asterisk's mind.",
    "[Monstradamus] His mind?",
    "[Ariadne] Yes. The diagram was called 'the helmet of horror' - it was written in big letters above the drawing. But the dwarf repeated very insistently several times that it wasn't any kind of hat or apparatus, but precisely a mind, although everything about it looked like a drawing of some machine. The main body of the machine was shaped like a helmet. And there was an identical helmet standing on the demonstration table - an ancient bronze headpiece, and underneath it a visor with holes in it curving back inside.",
    "[Monstradamus] What do you mean by 'curving back inside'?",
    "[Ariadne] Its lower section ran back inside the helmet through a slit in the middle of the face. And there were some kind of side plates too - everything was very old, green with age. It looked like a Roman gladiator's helmet - like a bronze hat with a visor. Only this one had horns as well. They came out of the upper section of the helmet and curved backwards. I'd already seen that on the square by the fountain, when Asterisk walked by, only his helmet was bigger and more complicated, with lots of different wires and tubes. The dwarf said this one was a simplified model. What he told me sounded really peculiar.",
    "[Monstradamus] Can you tell me about it?",
    "[Ariadne] I remember that the helmet of horror consisted of several major parts and a lot of secondary ones. The parts had strange names: the Frontal Net, the Now Grid, the Separator Labyrinth, the Horns of Plenty, Tarkovsky's Mirror and so forth. The largest element consisted of the now grid and the frontal net. It had two parts that were sometimes fused into a single unit. Its external part, the net, looked like a visor with holes in it, and its internal part, the grid, divided the helmet into an upper section and a lower one, so there was no way you could squeeze even the smallest head into it. The dwarf said the now grid separates the past from the present, because it is the only place where what we call 'now' exists. Hence the name. The past is located in the upper section of the helmet, and the future in the lower section.",
    "[Monstradamus] That doesn't seem logical somehow. Maybe it's the other way round?",
    "[Ariadne] No, I definitely remember that. After that the dwarf began explaining how the helmet works. He said you had to grasp the essence of the matter first before going into the details. The helmet's operating cycle has no beginning, so it can be explained starting from any phase. And so, he said, start by imagining the gentle glow of a summer day caressing your face. That's precisely how the frontal net, heated by the action of the stream of impressions falling on it, transmits heat to the now grid. The grid sublimates the past contained in the upper section of the helmet, transforming it into vapour, which is driven up into the horns of plenty by the force of circumstances. The horns of plenty emerge from the forehead, curve round the sides of the helmet and intertwine to form the occipital braid, which descends into the base of the helmet. There, below the now grid, the bubbles of hope that arise in the occipital braid are ejected into the region of the future. As they rise, these bubbles burst against the now grid, generating the force of circumstances, which induces the stream of impressions in the separator labyrinth. And the stream of impressions, in turn, is shattered against the frontal net, heating the now grid and renewing the energy of the cycle. The heat he was speaking about when he used the verb 'to heat' is different from the kind of heat you get from fire, more like the kind you get from love. He said he was simply using an analogy with something I knew about, so I would be able to imagine what happens. And in the same way the stream of impressions doesn't actually flow anywhere, the bubbles of hope aren't really bubbles at all, and so on.",
    "[Monstradamus] I couldn't really say I understood all of that.",
    "[Ariadne] I didn't understand anything at first either, and the dwarf told me to ask questions. I didn't know where to begin, because everything was equally hard to understand. The last thing he'd mentioned was the bubbles of hope, so I asked why they were called that. The dwarf was a bit embarrassed and said it was the official name, like a formal title. In actual fact it's not always hope at all, he said, it's more likely to be fear and apprehension, suspicion and hate, all sorts of nonsense, in fact any of the cud that is chewed on with such habitual stupidity by... But then he broke off, glanced round furtively and muttered something about that not being the right way to put it. And then he went on in the formal lecturer's voice he'd been using before and said that technically speaking it was correct to call them bubbles of the past. And they were called bubbles because their constant tendency is to expand and occupy the entire volume of the helmet, preventing anything else from appearing in it and leaving no space or opportunity for the recognition of what is actually happening. The dwarf jabbed his pointer at the part of the diagram that showed the kind of vertical coil the horns formed where they came together at the back of the helmet and said that bubbles of hope arise in the occipital braid following the enrichment of past in the horns of plenty. But since past is enriched exclusively with more past, the bubbles of hope consist entirely of past, they are simply past in a different state. Which means that when Asterisk peers into the future, he sees nothing but the past. The lower section of the helmet is required primarily in order to cool the bubbles of hope, a process which endows them with vernal freshness and the elastic resilience of novelty. As they break against the now grid, they generate the force of circumstances, which lifts the past out of the upper section of the helmet into the entry chamber of the horns of plenty and forces it through the separator labyrinth, where the stream of impressions arises.",
    "[Monstradamus] What is the separator labyrinth?",
    "[Ariadne] It's a kind of plate with wavy slits in it located in the region of the forehead, in front of the entry chamber of the horns of plenty. The separator labyrinth is the most important part of the helmet of horror. It's the place where everything else is produced out of nothing, that is, the place where the stream of impressions arises. And it's also the place where the past, the present and the future are separated. The past moves upwards, the future moves downwards, and the present, in the form of the stream of impressions, falls on to the outer surface of the frontal net, generating the cycle's passionate desire to recur, so that it becomes a kind of perpetuum mobile .",
    "[Monstradamus] Hang on a moment. The bubbles of hope are just another state of past, right?",
    "[Ariadne] Yes, that's the way I understood it.",
    "[Monstradamus] But after they break, you get past, present and future?",
    "[Ariadne] That's right.",
    "[Monstradamus] That means it's past that decomposes into past, present and future?",
    "[Ariadne] In actual fact the whole cycle is simply the circulation of now in various states of mind, in the same way that water can be ice, or the sea, or thirst.",
    "[Monstradamus] But how does the stream of impressions arise in the separator labyrinth?",
    "[Ariadne] Under the force of circumstances.",
    "[Monstradamus] I see. But no, hang on. The separator labyrinth is inside the helmet?",
    "[Ariadne] Yes.",
    "[Monstradamus] You said the stream of impressions falls on to the outer surface of the helmet. But how can that happen, if it arises inside?",
    "[Ariadne] I asked about that too. The dwarf laughed and said that was merely an apparent contradiction. The point is, he explained, the 'inside' and 'outside' I was talking about have no existence in themselves. They are generated in the separator labyrinth by the force of circumstances and from there they enter the horns of plenty, where they enrich the past, transforming it into the state of bubbles of hope. But since there is no 'inside' and 'outside' anywhere except in the horns of plenty, the stream of impressions can quite easily arise inside the helmet and fall on to it from the outside. And the same applies to everything else as well. But the dwarf warned me that I should never under any circumstances regard anything as real. The entire phenomenon is induced, like the electromagnetic field in a transformer.",
    "[Monstradamus] Aha. Then what is Tarkovsky's mirror?",
    "[Ariadne] It's a small, fogged-up mirror set at an angle of forty degrees between the region of the future and the now grid. When the bubbles of hope entering from below are reflected in it they appear to be further along the line of their course than they are, which gives rise to the feeling that the line actually exists.",
    "[Monstradamus] I see. And why is the separator labyrinth the most important section of the structure?",
    "[Ariadne] Firstly, it's where the stream of impressions arises. Secondly, it's where 'I' and 'you', good and bad, right and left, black and white, so on and so forth and everything else arises. The dwarf said this part of the helmet of horror is the most important and it hasn't changed for thousands and thousands of years. Then just at that moment a ray of sunlight lit up a poster hanging beside the board. It showed a Cretan coin with a diagram of a labyrinth stamped into it. Most opportune, said the dwarf, that is the separator labyrinth. Its appearance is very distinctive. It has a cross section at the centre, which is reached immediately after entry, and numerous parallel paths running around the cross which seem at first to lead you off into the unknown but then come full circle. This is the most widespread image of the labyrinth, the one that is repeated on almost all the antique coins and drawings. The scanned projection of this labyrinth is a straight line, which means that once you've entered it there's no way you can get lost or find your way out. And that means we can regard the horns of plenty, the now grid, the separator labyrinth, the past and future as different sections of one and the same continuous route, which no one is actually following.",
    "[Monstradamus] Why are the horns of plenty called that?",
    "[Ariadne] Because they contain all sorts of everything - tender feelings, sidelong glances, exalted words, final thoughts and everything else. A genuine treasure house or rubbish tip. But all this infinite variety actually consists entirely of past. As far as I could understand it, the horns of plenty operate like enrichment units in a chemical plant. When it's driven through them by the force of circumstances, past gets mixed up with everything else, becoming richer and acquiring value, with the result that bubbles of hope are produced in the occipital braid, go gurgling through the region of the future, are reflected in Tarkovsky's mirror and perceived as the novel freshness of a brand new day.",
    "[Monstradamus] For a while now I've been getting the feeling something's not right here, but I just can't quite put my finger on it. Right, now I think I've got it! Who are they perceived by?",
    "[Ariadne] Who? By Asterisk, of course.",
    "[Monstradamus] That's it! But where is he, this Asterisk? The way I understand it, this helmet is arranged so you can't even squeeze your fist inside it, never mind your head. I don't suppose you asked about that?",
    "[Ariadne] No, I didn't, the dwarf told me himself. Asterisk comes into being in the same place as everything else. In the separator labyrinth.",
    "[Monstradamus] And then what?",
    "[Ariadne] And then the force of circumstances induces him to enter the horns of plenty, he gets mixed up with everything else, is enriched and returns to the now grid in the form of bubbles of hope.",
    "[Monstradamus] You don't understand. I want to know about the subject of perception of all this xxx. Its ultimate subject. Can't you understand that? Where is he?",
    "[Ariadne] I really don't understand what an ultimate subject of perception is. But there can't be any doubt that he must be in the horns of plenty, because there just isn't anywhere else.",
    "[Monstradamus] Then where does he come from?",
    "[Ariadne] From the separator labyrinth. Like everything else.",
    "[Monstradamus] Then what's the point of the whole business?",
    "[Ariadne] I don't know.",
    "[Monstradamus] All right. Let's try it a step at a time. Where does perception arise?",
    "[Ariadne] It's produced in the separator labyrinth.",
    "[Monstradamus] From what?",
    "[Ariadne] From the past. It was there in the past, wasn't it?",
    "[Monstradamus] It was.",
    "[Ariadne] Then why should it suddenly disappear from the present and the future?",
    "[Monstradamus] Where's Nutcracker got to? I can't make sense of all this on my own.",
    "[Nutscracker] I'm following your discussion with intense interest.",
    "[Monstradamus] My helmet of horror's about to overheat. Let me put the question a different way. If Asterisk, perception and everything else are produced in the separator labyrinth, then why do we say that it's Asterisk who perceives them?",
    "[Ariadne] The dwarf said that is simply his specific quality as a product. In other words, the idea that he perceives everything is produced in the separator labyrinth together with everything else.",
    "[Nutscracker] Produced from what?",
    "[Ariadne] From nothing. You haven't been listening properly.",
    "[Nutscracker] All right. Then I have a question as well. You say Asterisk appears in the separator labyrinth.",
    "[Ariadne] That's right.",
    "[Nutscracker] And instead of a head he has the helmet of horror?",
    "[Ariadne] Yes.",
    "[Nutscracker] But then that means the helmet of horror appears in the separator labyrinth, which is located inside the helmet itself?",
    "[Ariadne] Yes, it does.",
    "[Nutscracker] But the helmet has to be bigger than one of its parts. How can it be located inside one of its own components?",
    "[Ariadne] The dwarf said 'inside' and 'outside' only exist in the horns of plenty. The same thing applies to 'bigger' and 'smaller'. The horns contain absolutely everything you could possibly imagine and everything else as well.",
    "[Nutscracker] But in that case even the helmet only exists in these horns of plenty?",
    "[Ariadne] Yes, I think so.",
    "[Nutscracker] Whichever way you look at it, that means the helmet of horror arises inside one of its own component parts. But it exists inside a different one. Where's the sense in that?",
    "[Ariadne] Where? In the horns of plenty, of course.",
    "[Nutscracker] Ariadne, are you serious?",
    "[Ariadne] Yes, probably. Or perhaps not. To be quite honest, I'm tired. If I meet the dwarf, I'll make sure I ask him about everything. You think up some questions.",
    "[Monstradamus] Hang on a moment. How did the dream end?",
    "[Ariadne] After the lecture I went out into the corridor. There was no one there, just a big mirror in a semicircular frame on the wall. I went over and looked into it and woke up.",
    "[Monstradamus] What did you see in it?",
    "[Ariadne] Myself.",
    "[Monstradamus] And nothing unusual?",
    "[Ariadne] I was wearing a straw hat with a round crown and two little bunches of lilies-of-the-valley pinned to the brim at the back. The hat had a veil of thick lace with round holes, so I couldn't see my face behind it at all. It all looked very beautiful, but something made me feel nervous. I couldn't work out what was wrong until suddenly I recognised that bronze mask in my reflection and that frightened me, and then the dream suddenly ended. That's all. I'm going.",
    "[Organizm(-:] I thought from the very beginning that goon must be wearing a virtual reality helmet. Honest I did.",
    "[Nutscracker] That's not any kind of virtual reality helmet; it's some kind of fancy pressure cooker. Games for children. I ought to know how a virtual reality helmet works when grown-ups put one together, and this is nothing like it.",
    "[Organizm(-:] And how does it work?"
  ],
  [
    "[Organizm(-:] I get it. It's like what you see at the railway stations in Asia. When a passenger thinks it's the tumbler-gambler who's going to cheat him but actually everyone playing the game is in on the swindle even though they're arguing with each other all the time, maybe even fighting.",
    "[Nutscracker] Exactly. Only in our case absolutely everybody in the station is in on it, including the stone Atlantes by the main entrance.",
    "[Ariadne] How clever you are, Nutcracker. After I listened to you I wrote a poem. It's dedicated to you, Romeo and Isolde. Shall I read it?",
    "[Nutscracker] Go on.",
    "[Ariadne] Beyond the window-pane on Doom and Gloom Old Pavlov's Bitch's Sticky Glance is glued. My Minotaur! Creep silently into my room Beckon me with a glance, brazenly nude.",
    "[Nutscracker] Powerful as ever. And he's already partly fulfilled your wish by removing his helmet, even though he has no head underneath it. I'd say it's impossible to expose yourself any more brazenly than that."
  ],
  [
    "[Organizm(-:] That's not it either.",
    "[Monstradamus] I know what he means. None of us has said anything about our labyrinths.",
    "[Ariadne] Really? It's just that no one's asked me.",
    "[Nutscracker] And are you willing to tell us?",
    "[Ariadne] Of course.",
    "[Nutscracker] So what have you got outside your door?",
    "[Ariadne] A bedroom.",
    "[Nutscracker] What, just an ordinary bedroom?",
    "[Ariadne] No, not ordinary. If you ever leaf through those fashionable journals with all the chic interiors, you might have seen something of the kind. It's a large room, and the bed takes up at least half of it. The mattress is so wonderful I don't even know how to describe it. I should write more poems. When you lie down on it, it feels like you're parachuting through the air, soaring along the pillows, the blankets and the sheets - everything is absolutely the very best. And there's an air conditioner with heaps of different operating modes. You can set it so that a fresh breeze blows through the room as though it's coming straight off the sea. And there are thick curtains on the window that...",
    "[Nutscracker] You've got a window? What does it look out on?",
    "[Ariadne] I don't know. There's some kind of garden, and the branches of trees. I can't see anything else.",
    "[Nutscracker] Have you tried opening it?",
    "[Ariadne] The window doesn't open. What else now? There's a really elegant wall-lamp above the bed and a night-lamp in the corner. There's a mini-bar too, only there aren't any drinks in it, nothing but little boxes of sleeping pills. There are lots and lots of them, all beautiful kinds of colours, and inside each one there are instructions on how many pills you can take at once, which ones you can take with others, which ones you can't, and so on. Only I don't need any sleeping pills. I only have to lie down on the bed, and I'm gone. I just fly away.",
    "[Nutscracker] And is that all there is?",
    "[Ariadne] When I leave the bedroom for a long time - say an hour or more - someone changes the sheets and makes the bed. But I haven't met anyone, not even once. And there aren't any other doors in the bedroom, there's only one way in.",
    "[Nutscracker] How do you explain that?",
    "[Ariadne] I don't try. It's less scary that way.",
    "[Nutscracker] A labyrinth like that could give you bedsores, Ariadne.",
    "[Ariadne] You weren't listening to what I said, Nutcracker. The mattress I have is so wonderful I can't even feel it. What bedsores? An angel could sleep on it without even creasing its wings.",
    "[Monstradamus] That's an interesting subject. How angels sleep.",
    "[Ariadne] Probably like bats, on a coral perch. And they have special gold hooks on their slippers."
  ],
  [
    "[Monstradamus] By the way, on the subject of checking with your friends. Ariadne, you said we could ask you questions about the helmet of horror in case you have another dream about our management.",
    "[Ariadne] Of course.",
    "[Monstradamus] I have three. Firstly, I really would like to know how everything else can be manufactured out of nothing. And secondly, how the helmet of horror can be located inside one of its own parts, and does that mean that inside one helmet there is a second one, and inside the second a third one, and so on to infinity in both directions? And the final question is - exactly how does the separator labyrinth work?",
    "[Ariadne] All right, I'll ask.",
    "[Nutscracker] And at the same time ask them to say something about the occipital braid. So far we don't know a single thing about it.",
    "[Organizm(-:] I have a question - why is the helmet of horror called that?",
    "[Ariadne] All right. I'll be going then.",
    "[Monstradamus] Just like that?",
    "[Ariadne] I'll forget the questions later.",
    "[Nutscracker] Go on then. And we'll carry on here. What was that you said about your labyrinth. Monster?",
    "[Monstradamus] When was that?",
    "[Nutscracker] When Ugly was telling us about the cathedral. They showed her something like a target and said it was the most mystical labyrinth there could possibly be. And you claimed the most mystical one was yours. I'm curious about what it is."
  ],
  [
    "[Monstradamus] Ariadne! Good morning?",
    "[Ariadne] Good morning.",
    "[Monstradamus] Did you see the dwarf?",
    "[Ariadne] Yes.",
    "[Monstradamus] Tell me about it.",
    "[Ariadne] I was in the building on the square in front of the fountain. You remember, I told you about it. It looked dark and oppressive, as though there was a fire there a long time ago and afterwards they tried several times to fix it up, but they hadn't been able to. It was the same inside. It felt like a camouflaged smouldering ruin. I can't even say what it was that gave me the feeling. Everything was new, expensive and chic - like in those glass palaces they rent out for offices. The air was cool and clean, there wasn't the slightest smell of burning in it at all. But somehow I felt if you took the oak panels off the walls you'd see all the stonework was blackened with smoke.",
    "[Monstradamus] How did you know it was the same building?",
    "[Ariadne] I went across to the window and looked out. Down below me was the fountain with the snakes where I saw Asterisk for the first time. There was a wide street with palms standing in tubs leading away from the fountain. The street ran out to the very edge of the city and ended at a huge triumphal arch strewn with yellow leaves. Standing on the ground in front of the arch was a bronze head that must have been the size of a truck. There was a stepladder leaning against its ear, and it had a gold star on its forehead with an inscription: 'The Tomb of the Unknown Helmholtz'.",
    "[Nutscracker] How could you see all that through the window?",
    "[Ariadne] I just looked in that direction.",
    "[Nutscracker] And you could read the words at that distance?",
    "[Ariadne] What distances are there in a dream? There aren't any except the ones you dream about. I dreamed there was that inscription on the monument's forehead. I didn't dream about any distances.",
    "[Monstradamus] That's clear enough. What else did you see?",
    "[Ariadne] The further away from the main street, the fewer houses there were. The city boundary was a circular wall, and outside that there was a desert in various tones of beige. Further away still there were dark-blue mountains, or perhaps they were clouds in the sunset. I didn't have time to look at anything else, because then one of the dwarves appeared in the corridor. He was in a hurry to get somewhere and looking quite aggressive - his loose robe was caught in with a belt that had a little sabre dangling on it. He didn't stop, just gestured for me to follow him. We began climbing the stairs. I asked him a question, but he told me to keep quiet. He said his master was under threat - they wanted to kill him. And so all questions and answers were now being strictly documented. I asked who wanted to kill his master, but he muttered that the reply to that question had to be documented as well. We came to a large open area with identical shelves of files on all the walls - it looked like some kind of archive. There was a kind of double round table in the centre - about fifty centimetres above the table-top there was a smaller disc of wood that could rotate. They used to have something of the sort in old canteens so that people could move any dish within reach by turning the upper disc. The dwarf sat down at the table and pointed to the place opposite him. I sat down. On the table in front of me there was an inkwell with a genuine goose-quill pen and a file containing sheets of paper. The dwarf had an identical inkwell and file. He told me to write down my question and put the sheet of paper on the wooden disc. I wrote: 'Who wants to kill the Minotaur?' The quill actually wrote very easily, with a fine line. Meanwhile the dwarf took a sheet of paper out of his file and wrote something himself. We put the sheets of paper on the rotating wooden disc, the dwarf turned it through a hundred and eighty degrees, then he had my question in front of him and I had his answer. It was brief: 'You already know'. And it was written on paper headed with a crest. Apparently he didn't even need to read my question, he already knew it.",
    "[Nutscracker] Paper headed with a crest? What was the crest like?",
    "[Ariadne] A little star framed in laurel leaves. It looked very impressive, you could even feel it with your fingers. Embossing. There was a motto under the crest: 'per aspera ad asterisk'. And there were watermarks in the paper. And as well as all that, there was a three-figure number in the upper right corner of the page - the blank sheets were numbered. Monstradamus, I wanted to ask you, what do those words mean?",
    "[Monstradamus] There is an expression 'per aspera ad astra', meaning 'through difficulties to the stars'."
  ],
  [
    "[Ariadne] Next I wrote a question and he wrote an answer. Why don't I type them all out together from the sheets of paper?",
    "[Monstradamus] What do you mean, 'type them out'? Have you got the sheets there?",
    "[Ariadne] Yes.",
    "[Monstradamus] How did you get hold of them?",
    "[Ariadne] I don't know. When I woke up they were lying beside the bed. Perhaps the people who tidy up the room brought them.",
    "[Monstradamus] And you didn't notice anything?",
    "[Nutscracker] Monster, you're like a man who's turned into a bull and is amazed to find he has a bell on his tail."
  ],
  [
    "[Ariadne] Let me answer your questions and get something to eat, okay? Then you can talk among yourselves.",
    "[Monstradamus] Of course, Ariadne.",
    "[Ariadne] I've already told you about the first question. Let's move on. Question: 'How can everything else be manufactured out of nothing?'. Answer: 'See the answer to the next question.'. Next question: 'How can the helmet of horror be located inside one of its own parts?'. Answer: 'The helmet of horror fractionates the one thing that is, into the multitude of things that are not. But since the helmet of horror is in no way the one thing that is, it is also one of the multitude of things that are not. And the things that are not may enter into every possible conceivable and inconceivable kind of relationship, since these relationships do not in any case exist anywhere except in the helmet of horror, which does not actually exist itself.'. Question: 'Does this mean that inside the helmet there is another helmet and in the other helmet there is a third one and so on to infinity in both directions?'. Answer: 'An individual by the name of A may be a part of the helmet of horror worn by B, and an individual by the name of B may at the same time be a part of the helmet of horror worn by A. This is the final infinity in both directions, and often both of them are quite nice people.'. Question: 'Can you please say something about the occipital braid.'. Answer: 'Longer and thicker suits the girl better.'",
    "[Nutscracker] All very logical.",
    "[Ariadne] Question: 'How does the separator labyrinth work?'. Just look what happened then! The dwarf had his answer scribbled out even before I had finished writing my question. He waited for me, then tossed his page on to the upper table-top and began turning it. But halfway round he suddenly stopped it and asked in a considerate voice: 'Are you enjoying your stay as our guest? Be honest.' I told him: 'Not much. In fact, to be quite honest, I'm not enjoying it at all.' Then he let the wooden disc carry on turning and I received a sheet of paper with the answer: 'That's the way it works'.",
    "[Organizm(-:] I get it. Good, bad and UGLI. But did you ask him why the helmet of horror is called that? I asked you to, remember?",
    "[Ariadne] I remember. It was the last question I managed to ask.",
    "[Organizm(-:] Well then?",
    "[Ariadne] The dwarf asked me to excuse him. He said he'd run out of official paper. But he promised to answer shortly.",
    "[Nutscracker] What happened then?",
    "[Ariadne] We heard some kind of horn or trumpet sounding a low, sinister note. Or it could have been some animal bellowing. The dwarf was so startled he dropped his inkwell on the floor and it broke, making a blue puddle beside the table. He said his master was summoning him to help and he ran off. And as he left he shouted it was possible that blood would soon be spilled, but it would be avenged.",
    "[Nutscracker] Blood?",
    "[Ariadne] Yes."
  ],
  [
    "[Romeo-y-Cohiba] That's it. Nutcracker, I'm on my way to kill you.",
    "[Nutscracker] I couldn't give a xxx. I'm wearing a helmet of horror.",
    "[Ariadne] There's no need to be like that.",
    "[Organizm(-:] Julistan - it sounds like the name of some small but highly malevolent state located at the very centre of the axis of evil.",
    "[Ariadne] By the way, I've seen that word - Julistan.",
    "[Monstradamus] Where?",
    "[Ariadne] In that place where I was asking the dwarf questions. The archive.",
    "[Monstradamus] You didn't say anything about that.",
    "[Ariadne] When the dwarf ran off, I was left in the archive alone. At first I went on sitting at the table, waiting for him to come back. But he was gone for ages and ages. Then I got up and went over to look at the shelves of files along the walls. There were all sorts of different things on them. Depositions from the Minotaur's defeated enemies. Interrogations of Minotaurs by other Minotaurs. An entire shelf full of records of cross-examinations of Minotaurs by themselves - they were called 'Alone Together'. They must have been thinking of the horns, right? But the biggest number of files was filled with answers to the so-called eternal questions like the ones you and I were asking. They were all old and yellow with age and covered in dust. Do you know what paper covered with writing smells like when the people who wrote on it are already dead?",
    "[Monstradamus] Do you remember anything?",
    "[Ariadne] I have a whole pile of pages here from various files. When I woke up they were lying beside the dwarf 's answers. There's not much new in them. The eternal questions haven't got any cleverer - that's why they're eternal.",
    "[Monstradamus] Read us something.",
    "[Ariadne] Question: 'Why does the existent exist?'. Answer: 'To pass the time more pleasantly.'. Question: 'Why heap up so many events and beings to pass the time if in any case nowhere exists except in the helmet of horror?'. Answer: 'Events and beings also cannot be accumulated anywhere except in the helmet of horror, so Mesdames et Messieurs are requested not to be concerned.' What's next... About the separator labyrinth... 'But who...' Right, that's it: 'Who else is produced there?' A couple of pages from some review of historical chronicles. An analysis of contradictions. One text says the Minotaur himself is the builder of the labyrinth. Another claims the labyrinth was built by eighteen thousand Minotaurs divided into two columns. A third claims these columns should be understood metaphorically and the labyrinth is created by the two mental nodules or hemispheres, which are symbolised by the two horns. And so on. And here at the end there are a few pages about this Julistan. They look quite different, really ancient and faded. Many of them are so old I can hardly make anything out. Covered with strange, beautiful handwriting. They're translations of inscriptions from the Julistan caves. The actual inscriptions were destroyed long ago, together with the caves themselves, and all that's left are copies of copies. Fragmentary translations. Some are short and incoherent, some are a bit longer. Shall I read some?",
    "[Monstradamus] Certainly.",
    "[Ariadne] 'One may begin with whatever one likes, without worrying about it at all...'",
    "[Monstradamus] Begin what?",
    "[Ariadne] You seem to be worrying about it already. Wait, that's not the right page. Here's the beginning: 'Asterius is everything that is before us and within us, especially \"before\" and \"within\". Irrupting into the mind he simulates this world and our own reason with all its voices, which dispute so convincingly with each other. To understand this means to see Asterius. One may begin with whatever one likes, without worrying about it at all...'",
    "[UGLI 666] Instead of listening to this drivel, shouldn't we perhaps be thinking about what to do in real reality? I didn't like the sound of those words about blood that is about be spilled.",
    "[Ariadne] 'The true hidden name of Asterius, which gives power over him, is Asterius, which is We. For many years the magicians of ancient times cut away the final letters of all the inscriptions so that no one would understand...'",
    "[UGLI 666] We're wasting precious time.",
    "[Ariadne] The next sheet: 'Man is like unto a tree. The thoughts in his head are like the songs of birds in the crown of the tree. How many birds must sing in unison for that which we consider ourselves to appear? And does the tree truly possess a song of its own? Asterius is also created after this fashion...'",
    "[UGLI 666] Someone shut that crazy woman up.",
    "[Ariadne] 'Asterius' greatest secret is that he is entirely unnecessary. He is an incorruptible guard, guarding that which he himself has created against that which he himself has created. For all the severity of his visage and magnificence of his station, all that is created by him, yea and his own self, is pure superfluity, the empty play of mind, a counterfeit golden flourish on the border of the void. And therefore, when within this nothingness set in a richly ornamented frame the menace of necessity suddenly raises its head or implacable battle is joined for the triumph of true values, there arises a spectacle fit to induce laughter unto tears, because in truth all of this from the beginning to the end is entirely pointless...'",
    "[Monstradamus] What's that sound? Can anyone else hear it?",
    "[Ariadne] 'But one must laugh quietly or Asterius will take offence. He does not know that in reality he does not exist, but sometimes he begins to suspect it and this scares and angers him greatly. The means by which for many millennia he has attempted to make himself real are terrible and foolish, like all the mysteries of his world. Although he does not exist, he ends up drenched in sweat and blood, which also do not exist. Though this does not make him any more real, it does mean there is no one left to tell him so - no one is left at his side but servant dwarves, drenching him in blood and screaming that vengeance will follow for the blood that has been spilled...'",
    "[IsoldA] I can hear it too. It's terrifying.",
    "[Ariadne] 'Asterius should not be feared. If you fear him, it means that you are wearing the helmet of horror and he is master of your world. But once you have removed the helmet, then Asterius disappears, and nothing remains at which to laugh. It is a grave error either to wear the helmet or to remove it. One should do absolutely nothing with it, if only because in reality it does not exist...'",
    "[UGLI 666] Closer and closer, and still this stupid cow just won't...",
    "[Ariadne] 'You are free, and your freedom lies in the fact that the mind has no body, no matter what dwarves in strange hats may tell you. Even the body has no body, and therefore there is nothing on which to set the helmet of horror. But until you have understood this, Asterius is all that you see, feel, think and know. And the crude mechanical farce which the parts of the helmet play out for each other in the transparent void of the mind becomes your entire life. If you are wearing the helmet of horror, it seems that this is for all eternity. But no eternity lasts longer than a fleeting moment. And it is known beforehand what will be when that moment is past - you will recall who you truly are and see that the helmet of horror is merely a toy of your own devising...'",
    "[Nutscracker] What's happening? Help! I think that idiot Romeo...",
    "[Monstradamus] What's going on? What's that rumbling sound?",
    "[Nutscracker] I think he really has found me. If it's him. Someone's hammering like hell on the door from the outside. Or it..."
  ],
  [
    "[Sartrik] What the hell's going on out there? Stop it!",
    "[IsoldA] Romeo! Goodbye, you bastard!",
    "[Ariadne] My door's getting hot. Are yours?",
    "[Nutscracker] I'm stifling. Something...",
    "[Monstradamus] It's him!",
    "[Theseus] MINOTAURUS!"
  ],
  [
    "[IsoldA] But of course...",
    "[UGLI 666] There is no more Minotaur.",
    "[Ariadne] Hang on, papa."
  ],
  [
    "[Monstradamus] In what?",
    "[Organizm(-:] Well, in the whole pile of xxx. That he has a body. And it's in a room.",
    "[Ariadne] He never did believe in that.",
    "[Romeo-y-Cohiba] You could say he saved us. He could have just killed us all once he'd seen us.",
    "[Nutscracker] No he couldn't. Then he'd never have got the helmet off. He isn't kind, he just knew.",
    "[Ariadne] What I've heard is that if anyone knows then it's precisely because he is kind.",
    "[Nutscracker] And what I've heard is that if anyone's kind then it's precisely because he knows."
  ],
  [
    "[Monstradamus] He has. It just seems to us in here that he's dissolved himself.",
    "[UGLI 666] Ariadne, maybe you can explain what made you like him more than us?",
    "[Ariadne] Oh, go to hell. You can lead him round the labyrinth instead of me."
  ],
  [
    "[Ariadne] You be careful who you go yapping at. Or you'll wind up lost forever in that cathedral of yours, get it? You're here on my thread. And there isn't any other.",
    "[UGLI 666] Did you all hear that? Did you hear it? Papa, have you thought where we'll all end up when she goes running off to that snake?",
    "[Nutscracker] Don't be such a Cassandra."
  ]
]