[
  [
    "[Nutscracker] What have Japanese cartoons got to do with anything?",
    "[IsoldA] She's talking about mangas, young girls who are raped by demons with their tentacles. It's a persistent theme in Japanese virtual porn.",
    "[Monstradamus] It's an expression of the repressed subconscious frustration resulting from defeat in the Second World War. The schoolgirl raped in these cartoons symbolises the Japanese national spirit, and the monster that sprouts these multiple phallic tentacles represents the modern Western-style corporate economy.",
    "[Nutscracker] Or maybe they're just octopuses?",
    "[Monstradamus] Octopuses? How original. I'd never have thought of that."
  ],
  [
    "[Organizm(-:] Hey, who is this Isolde? Someone new?",
    "[IsoldA] Yes.",
    "[Romeo-y-Cohiba] Welcome to our little world, Isolde. We're very pleased to meet you.",
    "[IsoldA] Thank you, Romeo.",
    "[Organizm(-:] Are you pretty?",
    "[Romeo-y-Cohiba] Get a grip, Organism."
  ],
  [
    "[Romeo-y-Cohiba] You think that monster in the bronze helmet really is walking about outside our doors?",
    "[UGLI 666] You don't have to take everything so literally. In the dream the door was made of wood, with a bull's head. But in here it's made of bronze, with an infernal symbol. Dreams are metaphorical.",
    "[IsoldA] Ariadne saw Romeo in her dream and when she described him he recognised himself. What kind of metaphor is that?",
    "[Romeo-y-Cohiba] Who says I recognised myself? It was just a couple of details that matched.",
    "[IsoldA] But what kind of details? There can't be many tattoos like that. An anchor with a dollar sign.",
    "[Romeo-y-Cohiba] Let's introduce a bit of clarity here. I actually do have a tattoo on my arm, just above the wrist. It's a fountain of oil, gushing up through a dollar sign. From upside down it looks a bit like an anchor. That's all. I don't know what tattoo she saw. And my yacht club symbol is nothing like that."
  ],
  [
    "[Organizm(-:] And the two dwarves symbolise the balls, do they?",
    "[Nutscracker] Cool it, Romeo. Sometimes a cochiba's just a cigar.",
    "[IsoldA] Could you talk about that separately somehow?",
    "[UGLI 666] I second that motion.",
    "[Organizm(-:] Unfortunately we can't just go out into the corridor."
  ],
  [
    "[Monstradamus] Now for that double axe on the door. In Greek it's called a 'labros'. That's where we get the word 'Labyrinth', the place where the Minotaur lived. Some accounts say it was a beautiful palace with lots of corridors and rooms, according to others it was a foul-smelling cave with numerous branches plunged in eternal darkness. Or it could be that people from different cultures had different impressions of the same place.",
    "[IsoldA] But what has an axe got to do with a labyrinth?",
    "[Monstradamus] They find them in Crete. Where the labyrinth was. That's all I know."
  ],
  [
    "[IsoldA] It's a very common name. I had a lotion for dry skin called 'Ariadne's Milk'.",
    "[Romeo-y-Cohiba] Names and coincidences are all very well. But what I don't understand is - what are we going to do?",
    "[Monstradamus] Well, what can we do? Wait for Theseus, who will lead us out of the labyrinth. And hope the joke doesn't go too far."
  ],
  [
    "[UGLI 666] There's no point in getting upset, Romeo. It won't help matters.",
    "[IsoldA] Have they really stopped?",
    "[Organizm(-:] Good for you, Romeo! They did what you told them to. Why not try telling our moderators to do something else?",
    "[Romeo-y-Cohiba] Stick your xxx up your xxx and give it a double right twist.",
    "[IsoldA] They're following every word we write."
  ],
  [
    "[Monstradamus] Stop clowning about.",
    "[Organizm(-:] Theseus, answer us!",
    "[IsoldA] At least tell us if you're here or not! Theseus!",
    "[Monstradamus] By the way. If the moderators can fulfil our wishes, why don't we ask them to open the door?",
    "[UGLI 666] But what's outside the door?",
    "[Organizm(-:] We can find out."
  ],
  [
    "[UGLI 666] Do you mean the music or the door?",
    "[Ariadne] The whole thing at once.",
    "[IsoldA] I've got sky outside. Grey. Looks a bit like a park. Everything seems quiet. I'm going out to explore.",
    "[Romeo-y-Cohiba] Hey, Isolde, wait! It could be dangerous out there!"
  ],
  [
    "[IsoldA] I'm back. Who's there?",
    "[Romeo-y-Cohiba] I am. Is everything all right?",
    "[IsoldA] Yes.",
    "[Romeo-y-Cohiba] I was worried.",
    "[IsoldA] I was only gone for a moment. Where's everyone else?",
    "[Romeo-y-Cohiba] They're eating. There's just the two of us.",
    "[IsoldA] What's outside your door?",
    "[Romeo-y-Cohiba] A labyrinth of neatly trimmed rough bushes higher than my head. And running between the bushes is a dirt pathway.",
    "[IsoldA] And I've got the same kind of bushes along the sides of an alley.",
    "[Romeo-y-Cohiba] An alley?",
    "[IsoldA] My door opens into a park. The alley starts right outside and along the sides there are bushes. With treetops showing above them in places.",
    "[Romeo-y-Cohiba] What I've got is more like a corridor between the bushes, I wouldn't call it an alley. And it starts winding straightaway, so I can't see anything but leaves. It's more like a narrow corridor than anything else, neatly sliced through the bushes by something like a combine harvester.",
    "[IsoldA] What colour is the ground there?",
    "[Romeo-y-Cohiba] Beige.",
    "[IsoldA] It's beige here too. We're near each other!",
    "[Romeo-y-Cohiba] What else did you see?",
    "[IsoldA] I didn't go very far. There are lots of alleys, and they keep branching and twisting and turning corners. I wasn't afraid in the least. Quite the opposite, what I saw gave me a really good feeling. The labyrinth might be complex, but it's impossible to get lost in.",
    "[Romeo-y-Cohiba] Why?",
    "[IsoldA] Because there's a plan hanging at every place the path branches. And there's a little sign on the plan: 'You are here'.",
    "[Romeo-y-Cohiba] That's handy all right. And wasn't there any little sign saying: 'The Minotaur is here'?",
    "[IsoldA] No.",
    "[Romeo-y-Cohiba] I was joking. Did you meet anyone?",
    "[IsoldA] No. But several times I had the feeling there was someone just round the corner.",
    "[Romeo-y-Cohiba] And was there anything like what Ariadne was talking about?",
    "[IsoldA] Yes, kind of. Only not exactly. Once I spotted some roofs above the bushes, but they were a long way off. And I saw fountains with different kinds of figures.",
    "[Romeo-y-Cohiba] Like the one Ariadne talked about?",
    "[IsoldA] I don't know. I went through a few forks in the path and at every one there was a small... I don't know what to call it - an oasis, I suppose. Trees and a fountain with bronze figures of animals. First a hare and a tortoise. They were sitting facing each other, with their faces lifted up to the sky. Their mouths were open and there were long thin streams of water spurting out. To be quite honest, it looked a bit ridiculous, as though they were spitting at an invisible ceiling that was too high, so that everything just fell back down on their own heads. At another fork there was a fountain with a fox and a crow. The crow was high up in the tree, and so big it looked more like an eagle. There was a water pipe leading up to it, hidden among the leaves. The fox was squatting on his haunches gazing up at the crow as though it was trying to hit it with the stream of water spurting out of its throat, but it couldn't reach high enough. The crow had its wings pulled back and up and its beak was open, and there was another stream of water spurting out of that, as though the sight of the fox made it feel sick.",
    "[Sartrik] Now that's something I can understand.",
    "[IsoldA] What do you understand?",
    "[Romeo-y-Cohiba] Take no notice. You're a wonderful storyteller, Isolde. It was like seeing it all with my own eyes.",
    "[IsoldA] Yes, I forgot to say. The plan that was hanging everywhere looked more like an old engraving than something modern. Or like an enlarged photocopy of an engraving. And written on it in this strange oblique typeface was: plan du labirinthe de versailles . What could that mean? Is it from the word 'verse'? Because there are characters from fables in the fountains?",
    "[Romeo-y-Cohiba] A plan of the labyrinth at Versailles. That's a real piece of luck.",
    "[IsoldA] Versailles? Then why is it written with a small letter?",
    "[Monstradamus] I could suggest that's not really the strangest thing about our surroundings.",
    "[Romeo-y-Cohiba] Do you mind not butting into other people's private conversations?",
    "[Monstradamus] Sorry, I didn't realise it was private."
  ],
  [
    "[IsoldA] And where did you go, Romeo?",
    "[Romeo-y-Cohiba] I haven't been outside yet.",
    "[IsoldA] Why not?",
    "[Romeo-y-Cohiba] I think it's some kind of trap.",
    "[IsoldA] I think it's a trap, too. But we're already caught in it anyway. And the room you're sitting in is just as much a part of it as what's outside the door.",
    "[Romeo-y-Cohiba] That's true. I suppose I ought to go out and scout around. Maybe I could find the way to your fountains.",
    "[IsoldA] Wait, Romeo. It's dark out there already. You can go tomorrow. Why don't you tell me what you look like instead? Are you like what Ariadne said?",
    "[Romeo-y-Cohiba] I don't understand why everyone's decided I was the man she dreamed about. The only things we have in common are the tattoo and the moustache. We've already dealt with the tattoo. That just leaves the moustache. And that's like identifying a man by the colour of his tie.",
    "[IsoldA] Are you really bald?",
    "[Romeo-y-Cohiba] Not bald, my head's shaved. That's a big difference. People go bald because they have no choice, but they shave their heads out of self-respect. Even if it does look the same from a distance. And my mole is really small, you can hardly see it. And anyway, who doesn't have some kind of a mole on his face?",
    "[IsoldA] Are you handsome?",
    "[Romeo-y-Cohiba] What does 'handsome' mean?",
    "[IsoldA] Well, it means a man is nice to look at.",
    "[Romeo-y-Cohiba] Nice for who? I got used to the way I look ages ago. And as far as anyone else is concerned, it depends on the circumstances. But one thing I can say for certain is you needn't be afraid of being with me.",
    "[IsoldA] What do you mean? Do you mean I wouldn't be frightened of you? Or do you mean that with you I wouldn't have to be afraid of anything?",
    "[Nutscracker] He's trying to say that if you're with him even he won't frighten you.",
    "[Romeo-y-Cohiba] Just give people a chance to talk, will you?! Isolde, can I ask you something about yourself?",
    "[IsoldA] Such as?",
    "[Romeo-y-Cohiba] Such as... Do you like poetry?",
    "[IsoldA] Sometimes.",
    "[Romeo-y-Cohiba] Who's your favourite poet?",
    "[IsoldA] Caroline Kennedy.",
    "[Romeo-y-Cohiba] What has she written?",
    "[IsoldA] 'The Favourite Poems of Jacqueline Kennedy-Onassis.'",
    "[Romeo-y-Cohiba] And what do you look like?",
    "[IsoldA] How would you like me to look?",
    "[Romeo-y-Cohiba] I'd like to know how you really look.",
    "[IsoldA] Medium height. Dark hair. Green eyes. They say I'm beautiful.",
    "[Romeo-y-Cohiba] But can you describe yourself so I can imagine how you look?",
    "[IsoldA] I have been told... But I'm not sure it's worth mentioning.",
    "[Romeo-y-Cohiba] What have you been told?",
    "[IsoldA] I was compared once to a cover of 'The New Yorker' that had a drawing of Monica Lewinsky as the Mona Lisa. Only I look five times younger.",
    "[Romeo-y-Cohiba] You mean you look like Monica Lewinsky?",
    "[IsoldA] No, not at all.",
    "[Romeo-y-Cohiba] Like the Mona Lisa then?",
    "[IsoldA] Not in the slightest. I suppose it sounds stupid.",
    "[Romeo-y-Cohiba] It sounds just fine. I just don't quite get it.",
    "[Monstradamus] Allow me to explain. There was nothing mysterious about Monica Lewinsky, and nothing sexual about the Mona Lisa. But if we imagine the scintillating mystery of the Mona Lisa fused with the earthy sensuality of Monica Lewinsky, and then add the charm of early youth, we get Isolde. Get it now?",
    "[Romeo-y-Cohiba] How many damn times do I have to tell you not to go butting into other people's conversations, Nebuchadnezzar?"
  ],
  [
    "[Romeo-y-Cohiba] Isolde, they won't give us any peace.",
    "[IsoldA] It's late already. Let's go to bed.",
    "[Romeo-y-Cohiba] OK. See you tomorrow, if it ever comes.",
    "[IsoldA] Let's hope it does. Ah yes, something else I forgot to tell you. I braid my hair at the back.",
    "[Ariadne] I think they're in love.",
    "[Monstradamus] According to their names they have to be. Imagine being called Romeo. What else could you do?"
  ],
  [
    "[Romeo-y-Cohiba] Isolde, are you here?",
    "[IsoldA] Yes.",
    "[Romeo-y-Cohiba] I'm back. What's happening here?",
    "[IsoldA] Nothing very interesting. Nutcracker was telling everybody about politics. And I only got back from Versailles just recently.",
    "[Monstradamus] Nutcracker, on that business of royalist France. You know, the Marquis turned out not to be so terrible after all.",
    "[Romeo-y-Cohiba] It's all very monotonous where I am. Bushes, a bend, bushes, a fork, a bend, on and on for ever. The passage is about six feet wide.",
    "[IsoldA] What's that in metres?",
    "[Romeo-y-Cohiba] Two. Makes you feel like a rat in a maze. At one point I decided I'd had enough and tried to climb through the hedge. Some chance. There's a barbed-wire mesh fence in the bushes - like the grid of bars in reinforced concrete. And I'd been wondering how they managed to keep the bushes so even!",
    "[IsoldA] That labyrinth must lead out into my park. You just didn't go far enough. We have the same ground under our feet. Beige soil.",
    "[Romeo-y-Cohiba] I kept turning to the right. It's funny. A flashback from my childhood. You know the way it is - a memory illuminated by a warm, long-forgotten light that seems to conceal the most important answer of all. Some book of adventure stories you read God only knows how many years ago. Where it said you can get through any labyrinth if you keep turning right all the time. So I decided to try it. Seems it was right - I did find something interesting after all. I saw one of your fountains. It was a long way off, though.",
    "[IsoldA] Tell me about it, then.",
    "[Romeo-y-Cohiba] At one point in the labyrinth there's a little bench. A perfectly ordinary bench, like they have in parks. I climbed up on it and stood on the back, and my eyes were level with the upper edge of the bushes. On one side I could see a jet of water rising into the air, and on the other, way off in the distance, some kind of dark roof that looked as though it was covered with soot. The roof was hard to make out because it was so far away, and the jet of water was very strange - one jet shooting up into the air, but several of them falling down. Maybe it was an optical illusion.",
    "[IsoldA] No, that's right. I know that fountain. It has bronze figures too. There's a snake and a... I've forgotten what it's called, like a pig with long spines.",
    "[Romeo-y-Cohiba] A porcupine.",
    "[IsoldA] Yes, that's it. A porcupine sitting on a bronze tree-stump with water flowing out from it in all directions, as though the beast had suffered bad fright. And the snake is coiled up creeping towards the stump and shooting out a tall jet of water that divides into three branches and falls like rain on the porcupine and everything all around. It's an incredibly beautiful fountain. The first time I saw it there was a little rainbow suspended in the spray of water beside it, and from that moment on I loved it best of all. There are actually three jets of water, but with different pressures. Their nozzles are set close beside each other in the snake's mouth, so it looks as though there's one jet rising into the air and three falling downwards. And I remembered the tattoo on your wrist, the oil and the yachtclub. Does the jet you can see above the bushes divide into three?",
    "[Romeo-y-Cohiba] Yes, I think so.",
    "[IsoldA] Aren't you absolutely sure?",
    "[Romeo-y-Cohiba] I can see a jet of water and the roof of a house when I climb up on to a bench and stand on the back of it. But it's not possible to stand up there like that for very long, you sway backwards and forwards and then you lose your balance and you have to jump down. That makes it hard to make out the details. But if it is the same fountain you should see my labyrinth when you stand beside it.",
    "[IsoldA] There's a tall hedge beside the fountain with the snake and the porcupine and I can't tell what's behind it. It's very long - I walked a little way along it, the bushes fence off a large section of park. I think that must be your enclosure.",
    "[Romeo-y-Cohiba] If you've walked along that hedge, at one moment we might only have been ten feet apart. I was beside it too, on my own side. I'm practically certain it was the outside hedge. In the first place, there were two rows of barbed fencing instead of just one in the bushes. And in the second place, there's a spot where you can clearly hear the sound of falling water. Oh and, by the way, beside the spot with the sound of water there's a long wall protruding from the bushes. It looks like the back of some building and it's painted with pink and gold Cupids blowing seashells like trumpets. Have you got anything like that?",
    "[IsoldA] There is a single-storey building to the right of the fountain. It looks like a pavilion for storing garden tools, except that it's very big. Its back section disappears into the high hedge. But I didn't see any Cupids on it.",
    "[Romeo-y-Cohiba] Can you get inside?",
    "[IsoldA] The door's locked. Is there a door in your wall?",
    "[Romeo-y-Cohiba] Yes.",
    "[IsoldA] Does it open?",
    "[Romeo-y-Cohiba] To be honest I didn't try it. I stood beside it for a while and suddenly I felt terrified, I even got a pounding in my temples. I'm not the timid type at all, but suddenly there it was. For no reason at all. I thought - who knows what's inside there? What if it's the... Minotaur?"
  ],
  [
    "[IsoldA] Romeo, where are you? I'm back.",
    "[Romeo-y-Cohiba] I was starting to get worried. Tell me what happened.",
    "[IsoldA] You first.",
    "[Romeo-y-Cohiba] All right. I would have reached the pavilion quickly, because last time I marked which way to go at the forks in the path. But I met someone really terrifying on the way.",
    "[IsoldA] You too?",
    "[Romeo-y-Cohiba] What happened? Are you all right?",
    "[IsoldA] Yes, everything's fine. Go on.",
    "[Romeo-y-Cohiba] When I got past the bench where I can see the roof and the fountain, I suddenly sensed a movement behind me. And when I turned round I saw something absolutely incredible. Just imagine it, a long narrow corridor between the bushes. And coming towards me along it on roller skates was... I don't even know if it was a man or not. He was immensely tall, wearing a sombrero hat and an ice-hockey goalkeeper's mask made of white plastic. And there were two smaller figures on roller skates behind him. I could hardly see them, because he took up the entire passage. He was wearing a goalkeeper's uniform too - an immense blue sweatshirt with the number '35' and the words 'chicago bulls'. Or at least, that's what I thought at first. But when he got closer, I could see the number was actually totally weird: ' - 3.5%', and the word 'bulls' was really 'BEARS'. It was just that the minus sign and the percentage sign were the same colour as the sweatshirt and I hadn't spotted them from the distance. And he was holding a double hockey-stick.",
    "[IsoldA] How do you mean?",
    "[Romeo-y-Cohiba] You've seen a goalkeeper's stick, haven't you? Now imagine it has two blades curving in opposite directions. Of course, you couldn't possibly play with one like that.",
    "[IsoldA] And what happened when he reached you?",
    "[Romeo-y-Cohiba] He didn't get that far. When he was only ten feet away, he turned a corner and disappeared into a side passage. And the others darted in there after him as well.",
    "[IsoldA] Who was it following him?",
    "[Romeo-y-Cohiba] It was two dwarves. They were on roller skates too, and wearing sombreros. I couldn't see their faces, they had their heads lowered so the wind wouldn't blow their hats off. And they were holding up the hem at the back of his sweatshirt, like ladies in waiting.",
    "[IsoldA] Was that all?",
    "[Romeo-y-Cohiba] Fortunately, yes. Who did you meet?",
    "[IsoldA] It was at the corner of one of the alleys. I heard the sound of a guitar string behind me. When I turned round, about twenty metres away from me I saw an immensely tall man standing beside a fountain. He was dressed all in black and gold like an eighteenth-century gallant, and he was hiding his face behind a mask in the form of a golden sun that he was holding on a stick. There were two dwarves dressed up in red velvet standing beside him, holding old potbellied guitars. They strummed a few soft chords, then the giant turned his mask slightly and the sun glinted on it so brightly I was dazzled and I screwed up my eyes. And when I opened them again there was no one beside the fountain any more. I didn't even have time to be scared and I thought I must have had a hallucination after everything I'd been hearing. But now I don't know what to think. You go on.",
    "[Romeo-y-Cohiba] Well, I decided that if the giant had wanted to kill me he would have done it already. So I carried on as though nothing had happened. I didn't meet anyone else on the way. The door in the wall of the pavilion was open. And behind it there was a winding corridor. Naturally, there was no light. The floorboards squeaked horribly, as if every one of them had three mice sitting under it. It was absolutely terrifying. There were doors in the walls and more doors behind them. I began groping my way at random through the musty, squeaking darkness and became disorientated straightaway. I was overcome by apathy. I wanted to drop down on the floor, close my eyes and forget about absolutely everything. Probably that's what I would have done, but then one of the doors led me out into a large room where there was a light on. It was deserted and dusty, with no windows and divided in half by a set of steel bars so thick they could have kept out an elephant. There was no furniture at all, if you didn't count several pictures turned around so that the images faced the wall. I thought it was probably so they wouldn't get dusty - clever and very simple, no need for any glass. Hanging on the door, which closed behind my back, was a plaque that said 'Silence!' And beyond the bars was a fresco with a portrait of the most beautiful girl I've ever seen. Right across the whole wall.",
    "[IsoldA] A girl right across the whole wall?",
    "[Romeo-y-Cohiba] No, the fresco. Some kind of garden full of wonderful plants and birds. And the girl was at the very centre, life-size. Absolutely naked, but it suited her really well. She had green hair that looked like grass, fluttering in the painted breeze. And green eyelashes too. She was lying in a mother-of-pearl shell, barely concealing the lower part of her belly with a bouquet of flowers. There was one strange thing, though - the edge of the shell above her head was covered with projections that looked like horns. And there were black rubber handles attached to them. That is, the projections were painted, but the handles were real, like in a bus. I touched them and I could tell it really was possible to hold on to them. But I couldn't understand what for.",
    "[IsoldA] How could you touch them? You said there were bars between the door and the fresco.",
    "[Romeo-y-Cohiba] That's right. But it was easy enough to slip between the bars. So that's what I did. They probably weren't meant to keep out people.",
    "[IsoldA] Describe this girl.",
    "[Romeo-y-Cohiba] I suppose she was about eighteen, but she didn't look any older than fourteen. I'd describe her pose as brazen, but entirely natural. What I mean is, the pose would have been absolutely brazen, if she'd been lying there like that, knowing that she was being watched. But if she lay around like that at home, especially if it was hot, then of course, there wouldn't be anything brazen about it. But on the other hand, she was looking straight out of the picture at the spectator, which in this case meant straight at me. She had her eyes half-closed, as though she could see me and was taunting me, and she was smiling. And her eyes were as green as could be. I began to understand what the artist was trying to say. Either she'd posed like that knowing she was being watched, which meant she was absolutely shameless, which I didn't want to believe. Or she'd been lying like that because she thought there was no one around, and she was smiling at the spectator simply out of inertia, because she'd only just noticed him. In that case the artist was a real genius, because he'd caught the precise moment when her brain had already given the command to scream, but the command still hadn't reached the muscles of her throat. In that case, for as long as I carried on examining her, I was free of shame myself, so free in fact that it was actually arousing. In a word, genuine art. An absolutely enigmatic masterpiece. But I didn't have time to study her properly, because the bouquet she was using to conceal the lower part of her belly trembled and started sliding downwards. And it wasn't just the lower part of her belly she'd been hiding, but the lowest part of all, so low you can't get any lower, only higher...",
    "[IsoldA] All right, Romeo, I get the idea.",
    "[Romeo-y-Cohiba] There must have been some kind of mechanism in the wall. The arm that was holding the bouquet began turning from the elbow, like the hand of a clock. But I didn't get a chance to see what was behind the bouquet, because the light began to fade and soon it was completely dark. I went up to the wall and began feeling it with my hands. Where the bouquet had been quite a big gap had appeared. I put my hand into it carefully and suddenly felt something soft and alive that jerked away from me. I think it was another hand. I cried out in surprise and suddenly there was a spray of something acrid from the ceiling, like tear gas. I jumped back. The light started coming on. When it was bright enough to see, the bouquet was already back in place. My eyes were stinging really badly and I ran out of the room like it was a gas chamber.",
    "[IsoldA] Do your eyes still hurt?",
    "[Romeo-y-Cohiba] Not any more.",
    "[IsoldA] Now I see.",
    "[Romeo-y-Cohiba] What do you see, Isolde?",
    "[IsoldA] It seems I discovered the same amusement arcade from the other side. After the giant with the sun-mask disappeared, I went to the pavilion. The door was locked. And the windows too. I broke a window, lifted the latch and opened it. Behind the first door was the beginning of a dark, winding corridor like the one you told me about. From there I found my way into a large room with a light and no windows, just like you did. Instead of pictures it had mirrors painted over with white paint. Standing in the middle of the room was an absolutely huge steel ring as tall as the ceiling, with nylon mesh attached all around its edge  –  it hung down from the ring and trailed across the floor like a seine net. On the door there was a plaque about keeping silent, just like on yours. And on the wall behind the ring there was a mural, only it was very different from yours. It was a picture of something like the Grand Canyon. Through the mist I could make out the desert floor far below me. And on the edge of the red cliff, right up in front of the spectator's eyes, there was a car with a cloud of painted dust settling around it. It all looked just as though the car had braked after a steep turn and stopped at the very last moment, with its wheels hanging over the edge of the precipice. It was a Rolls-Royce jeep, in perfect profile, like a photo in an advert.",
    "[Romeo-y-Cohiba] Are you sure it was a Rolls-Royce?",
    "[IsoldA] Of course. It had the initials 'RR' and a little Oscar with wings on the radiator, like they all have.",
    "[Romeo-y-Cohiba] Then it wasn't a jeep. Rolls-Royce don't make jeeps.",
    "[IsoldA] Romeo, I can tell my SUV from my elbow. I even saw the name of the model  –  'Full Drive Shadow' I think it was. That's the whole point. It was an artist's fantasy, but it was so convincing I could see straight away that if Rolls-Royce decided to make an SUV they'd have to make the car that was painted there; circumstances would simply force them to do it. The jeep was made of gold and steel, like an exquisite watch. To say it looked impressive gives you no idea. If the space shuttle and the most expensive diamond necklace in the world could together produce a son, then it would probably look just like that when it grew up. In front of the jeep was a platform with steps. I mean the platform wasn't in the picture, it was on the floor of the room, real, made of wooden boards. And the jeep's windows were real too, tinted glass that looked black and there were skis and a surfboard on its roof.",
    "[Romeo-y-Cohiba] Real ones?",
    "[IsoldA] The skis and the board were painted. But the rack they were attached to, or that they looked as if they were attached to in the painting, was real, made of steel and gold.",
    "[Romeo-y-Cohiba] What kind of rack?",
    "[IsoldA] I don't know what its proper name is – the kind they make so you can tie on what you carry on the roof. There were loops of black leather hanging from it, like the ones used for doing gymnastics; they were real as well. And, apart from that, the door handles and the hub-caps were real – and they were made of steel and gold too.",
    "[Romeo-y-Cohiba] Did you try opening the door?",
    "[IsoldA] I told you, there weren't any doors, only handles. But I didn't even get a chance to touch them. The moment I took a couple of steps towards the jeep, its window began slowly winding down. Some kind of mechanism must have switched on. I really wanted to find out what was behind the glass, but the light began to fade, and a few seconds later it was dark. Exactly the same thing as happened to you, in fact. I climbed up on the platform and touched the wall where the window of the jeep had been. There was a gap there now. I ran my hand round its edge. It really felt like a car window. But the window hadn't opened all the way and the gap wasn't big enough to climb through the wall. There was a slight draught from the window, as if there was an air-conditioner working inside. And I thought I caught a faint glimpse of light. I leaned down to look inside, but as soon as my face was level with the opening something bumped against my cheek and I heard a terrible howl. I leapt back, lost my balance and fell off the platform on to the floor. The light came on – dim at first, then brighter and brighter, like in the cinema after a film. By the time it got really light, the jeep's window was already closed again. I went back out through the corridor into the open air and came back here. I was shaking all over at first, but I started feeling better on the way. It's funny to think about it now.",
    "[Romeo-y-Cohiba] Well, I've learned one lesson. Nice and easy does it.",
    "[IsoldA] Yes. Especially in your RR SUV.",
    "[Romeo-y-Cohiba] It's your RR SUV.",
    "[IsoldA] Why?",
    "[Romeo-y-Cohiba] It's on your side!",
    "[IsoldA] But you're the one inside it. That means it's yours.",
    "[Romeo-y-Cohiba] How can it be mine if I can't see it?",
    "[IsoldA] And how can it be mine if I can't even get into it? Apart from sticking my head in the window.",
    "[Romeo-y-Cohiba] Let's say it's ours then. Then we can't be wrong.",
    "[IsoldA] Agreed.",
    "[Romeo-y-Cohiba] Isolde... I want to tell you something. It will probably sound stupid, but I want you to hear it anyway. Whatever I'm thinking about, I always come back to you. As if all the thoughts that aren't connected with you are heavy weights and as soon as my mind tries to deal with them, the effort becomes too much. But everything to do with you is light and happy, like the bubbles in champagne. I just want to go on and on thinking about it.",
    "[IsoldA] Yes, Romeo, that really did sound stupid. But I could say the same thing to you.",
    "[Romeo-y-Cohiba] Why don't we meet again at the same place? Say tomorrow afternoon? Calmly, without any fuss. Or any noise.",
    "[IsoldA] But what if we're being followed? I mean there, inside.",
    "[Romeo-y-Cohiba] The light goes out when the window opens.",
    "[IsoldA] Haven't you ever heard of infra-red cameras? They could do more than just watch us. They could shoot an entire movie.",
    "[Romeo-y-Cohiba] Then who would they show it to?",
    "[IsoldA] Your wife, for instance. Or Ariadne in a dream.",
    "[Romeo-y-Cohiba] I haven't got a wife. And I couldn't give a damn for Ariadne and her dreams. If we start worrying about spies, pretty soon the world will be full of them.",
    "[IsoldA] You're right. The only way to be alone is to behave as though we are already alone.",
    "[Romeo-y-Cohiba] So it's a date then?",
    "[IsoldA] Tomorrow at three, Romeo. I date your car.",
    "[Romeo-y-Cohiba] Our car. My green-eyed Lolita. My lovely Mona Lita.",
    "[IsoldA] And now to sleep, Cohiba. Be seeing you."
  ],
  [
    "[Romeo-y-Cohiba] Isolde, are you there?",
    "[IsoldA] Yes. How did you get home yesterday, you beast?",
    "[Romeo-y-Cohiba] Why beast?",
    "[IsoldA] What am I supposed to call you after that?",
    "[Romeo-y-Cohiba] After what?",
    "[IsoldA] After the way you behaved.",
    "[Romeo-y-Cohiba] Me? Me? And just how did I behave?",
    "[IsoldA] Don't pretend to be stupid.",
    "[Romeo-y-Cohiba] Maybe we shouldn't carry on in front of everyone?",
    "[IsoldA] TODO So you're embarrassed of them, but not of me! And you have the cheek to ask me how you behaved? All right, I'll tell you. Like a coarse brute, that's how. Worse than that, like an absolutely shameless and depraved brute who thinks he can get away with anything.",
    "[Romeo-y-Cohiba] Well, well. How do you like that! Then let me tell you something. That sickening stunt you pulled yesterday left me feeling like I'd been defiled. It's like I've had some foul substance sprayed into my soul and it fogs up my mind and takes away the desire to go on living.",
    "[IsoldA] On the subject of sprays of filth that take away the desire to go on living, you've hit the nail on the head there. My fingers would have refused to type that. Even though it's exactly what I feel. I never even suspected that such a small opening...",
    "[Romeo-y-Cohiba] But what did I do? You did absolutely everything yourself. The only thing I have to reproach myself with is not offering any resistance. Though that was what I really wanted to do, even before it really began to hurt.",
    "[IsoldA] How can you lie so brazenly? But then, what else can I expect from you?",
    "[Monstradamus] Pardon me for butting in, I know you can't stand it. But perhaps I could set you thinking in a new direction. On the map that Isolde saw in the park it said 'Plan of the labyrinth at Versailles'. But the telephone booth that Romeo was calling her from is located, if we can believe the plaque, in a suburb of London. Do you see what I'm driving at?",
    "[Nutscracker] I wouldn't take those signs seriously. The Versailles outside Isolde's door is about as real as Romeo's London. Ugly would say the devil has us all exactly where he wants us. And she'd be absolutely right.",
    "[Monstradamus] I wouldn't argue with that. But every dimension has its own intrinsic laws. And even if we are somewhere in the suburbs of Hell, when one person sees 'Versailles' and another sees 'London', there's good reason to assume the devil's holding them in different places.",
    "[IsoldA] What gibberish.",
    "[Romeo-y-Cohiba] That's way over the top.",
    "[Monstradamus] But really, Romeo and Isolde, what made you think you were close to each other?"
  ],
  [
    "[Monstradamus] Can you describe it some other way?",
    "[Romeo-y-Cohiba] Dark-brown.",
    "[IsoldA] What's that - dark-brown? Beige is light yellow-grey!",
    "[Nutscracker] Right. So now we know. Romeo set off to meet Isolde and bumped into Juliet. Isolde set out to meet Romeo and ended up in Tristan's clutches. If we imagine that Juliet and Tristan are the same person... Although in this case we can hardly call it a real 'person'. More like an empty mask. Or maybe a 'helmet'?"
  ],
  [
    "[Monstradamus] What's that sound? Can anyone else hear it?",
    "[Ariadne] 'But one must laugh quietly or Asterius will take offence. He does not know that in reality he does not exist, but sometimes he begins to suspect it and this scares and angers him greatly. The means by which for many millennia he has attempted to make himself real are terrible and foolish, like all the mysteries of his world. Although he does not exist, he ends up drenched in sweat and blood, which also do not exist. Though this does not make him any more real, it does mean there is no one left to tell him so - no one is left at his side but servant dwarves, drenching him in blood and screaming that vengeance will follow for the blood that has been spilled...'",
    "[IsoldA] I can hear it too. It's terrifying."
  ],
  [
    "[UGLI 666] Do not waste your final moments in blasphemy!",
    "[IsoldA] Romeo! Goodbye, you bastard!"
  ],
  [
    "[Organizm(-:] Ladies and gents, I don't get it - what was that?",
    "[Nutscracker] I think it's getting cooler. And the noise has stopped.",
    "[IsoldA] What, don't you understand? It's Theseus!"
  ],
  [
    "[Organizm(-:] What difference does it make to us? How did we give ourselves away?",
    "[UGLI 666] We get distracted. Make too much fuss. Talk off the point, all this stuff about Versailles and Mona Lisa.",
    "[IsoldA] Ugly, you don't mind us living here, do you?"
  ],
  [
    "[Sartrik] What... What route is that?",
    "[Monstradamus] Back with us again, hero? Ladies and gents, a joke. Imagine Sartrik wakes up with a massive hangover. He can't remember anything about the previous day. There's a pool of blood beside him. He's surrounded by a labyrinth. But there's no Minotaur anywhere. Sartrik raises his eyes to the ceiling and whispers in horror: 'I killed him... Killed him and ate him...'",
    "[IsoldA] What's funny about that? That's exactly how it happened.",
    "[UGLI 666] Your joke's older than the labyrinth, Monstradamus. Let's discuss the serious situation we're in. Some day Ariadne will be the death of us.",
    "[IsoldA] Stop stirring things up, Ugly. It's not Ariadne's fault at all. Sartrik blurted it all out in a drunken stupor."
  ]
]