[
  [
    "[Monstradamus] Hi there, is it okay if I join in your discussion?",
    "[Organizm(-:] Who are you, Monstradamus?",
    "[Monstradamus] xxx. I live in xxx and I'm a xxx.",
    "[Romeo-y-Cohiba] Perhaps you ought to try something a bit more original?",
    "[Monstradamus] I've read all the messages on this thread. I'm in the same situation, the same room, the same fancy getup. And I don't remember how I got here, either.",
    "[Nutscracker] So now we are four. That's nice.",
    "[Organizm(-:] What's so nice about it?",
    "[Nutscracker] Maybe more will turn up soon. The more heads we have, the better our chances of coming up with something."
  ],
  [
    "[Romeo-y-Cohiba] I reckon it's a double-headed axe.",
    "[Organizm(-:] Maybe it's just decoration, without any meaning. But Romeo saying it looks like an axe has made me think so too. The fascists used to have axes like that - or was it the ancient Romans?",
    "[Monstradamus] If it is an axe, it's much older than Rome. They used to have axes like that in Crete and ancient Egypt.",
    "[Organizm(-:] Are you a historian then, Monstradamus?",
    "[Monstradamus] No. I'm a xxx.",
    "[Organizm(-:] Hey, that's right. I forgot.",
    "[Ariadne] Hi. I'm glad I'm not the only one here.",
    "[Organizm(-:] Hi there, darling."
  ],
  [
    "[Romeo-y-Cohiba] Where there are boys, there have to be girls. Some funny rainbow-coloured patches of light just appeared on my walls.",
    "[Monstradamus] That's odd, I had them too. Or maybe I imagined it.",
    "[Nutscracker] Ariadne? Did you start this thread?",
    "[Ariadne] Yes. But no one answered, and I fell asleep.",
    "[Monstradamus] So why did you write that phrase about the labyrinth?",
    "[Ariadne] I was trying to remember where it came from, but I couldn't. I had the feeling it was very important.",
    "[Monstradamus] Who are you and how did you get here?",
    "[Ariadne] I'm in exactly the same situation as you.",
    "[Organizm(-:] In that case, we know all about you already. Your real name's xxx, you're xxx years old and you come from xxx.",
    "[Ariadne] I know what's going on here."
  ],
  [
    "[Ariadne] I saw it all in a dream.",
    "[Romeo-y-Cohiba] I don't think I'd exactly regard that as bona fide information.",
    "[Monstradamus] I wouldn't mind hearing about it, though. Tell us about it.",
    "[Ariadne] I saw this old city. I mean, really ancient. The kind they must have built thousands and thousands of years ago. It was really beautiful there. Roads paved with big, flat stones, stone walls covered with living curtains of some climbing plant with pale-pink flowers. The doors and windows of all the houses were locked, but all the time I had the feeling I was being watched by someone. I wandered round the streets for ages, but I didn't meet anyone. And then on the crossroads up ahead of me I kept catching sight of a dwarf dressed in grey rags and a strange hat with a wide brim and a round crown. Every time I spotted him, he instantly darted round a corner, as though he could feel my gaze on his back. It happened lots of times, over and over again. Soon I realised he wasn't hiding from me, it was just that the rhythm of his movement was linked with the rhythm of mine so I couldn't see him for more than those few seconds. Only don't ask me how I realised it, in a dream everything has its own logic. I began trying to adjust to the rhythm, trying to get a better look at the dwarf. By choosing broad, straight streets, I could keep him in my field of vision for longer. But most of the streets were narrow and crooked - the way they linked up made a genuine labyrinth. I realised there were actually two dwarves, but it was easy to confuse the second one with the first. He was dressed in exactly the same way, in some old rags, only the brim of his hat was bent up on one side. Gradually I became certain there was someone else with them as well, but no matter how hard I tried, I couldn't see the third person. Sometimes I could just catch a glimpse of the edge of his dark cloak from round a corner. I guessed I needed to find the way to the main street - it would be long and wide and I would be able to see all of them...",
    "[Romeo-y-Cohiba] What's the point of us listening to all this?",
    "[Monstradamus] Please, don't interrupt!",
    "[Monstradamus] What happened after that, Ariadne?",
    "[Ariadne] After that I made my way to the main street. There was a long line of palm trees in tubs along the middle of it. I remember that what was most astonishing was that there were yellow leaves everywhere, it was autumn, and then here were these palm trees.",
    "[Nutscracker] You started off with pink flowers. Now suddenly it's autumn, with yellow leaves.",
    "[Ariadne] Yes, autumn set in while I was following the dwarf. I thought he must have done that on purpose to spoil my mood and prevent me catching up with him. There was no one in the main street. I came to a large square with a fountain with bronze statues standing in it. From their style I thought they must be just as ancient as the city, but their subjects were more like something from a Japanese cartoon film - naked teenagers being strangled by tentacles twined around their bodies. Or snakes..."
  ],
  [
    "[Nutscracker] What have Japanese cartoons got to do with anything?",
    "[IsoldA] She's talking about mangas, young girls who are raped by demons with their tentacles. It's a persistent theme in Japanese virtual porn.",
    "[Monstradamus] It's an expression of the repressed subconscious frustration resulting from defeat in the Second World War. The schoolgirl raped in these cartoons symbolises the Japanese national spirit, and the monster that sprouts these multiple phallic tentacles represents the modern Western-style corporate economy.",
    "[Nutscracker] Or maybe they're just octopuses?",
    "[Monstradamus] Octopuses? How original. I'd never have thought of that."
  ],
  [
    "[Nutscracker] Isolde, can you add anything to the sum of our experience?",
    "[IsoldA] No.",
    "[Monstradamus] Then, if no one has any objections, Ariadne can continue.",
    "[Ariadne] I realised I had to go over to the fountain and then I would see both dwarves. Only don't ask me how I realised it; it was suddenly clear, that's all. When I reached the fountain I turned my back to it and leaned against the wall. Opposite me there was a building with a colonnade - a massive, depressing building with ugly superstructures on the roof. It occurred to me somehow that a long time ago it had been burnt down, and nothing was left but the stone skeleton, and since then a lot of attempts had been made to repair it and restore it to life. But you could still see the traces of the catastrophe through the restoration work and the paint, and you could tell the building was dead and empty...",
    "[Romeo-y-Cohiba] I'd say we need an entire committee of psychiatrists for this spiel. Or we could ask Monstradamus, he's got a good handle on this stuff. What was that phrase he used - corporate frustration?",
    "[Monstradamus] Romeo, please, be patient just a moment longer.",
    "[Ariadne] Suddenly I noticed one of the dwarves standing beside me - the one with the side of his hat bent up. I didn't see how he got there. He was really close to me, but I couldn't see his face under the hat. I remember he was wearing medieval-style pointed shoes in red and white stripes. He began speaking without raising his head, and what he said was very strange. He said the master he served was the creator of everything I saw around me, and a great many other things too. The way I understood it, this master of his was not a man. Or not just a man. His name was Asterisk...",
    "[Monstradamus] Are you sure you heard correctly?",
    "[Ariadne] I think so. The way the dwarf explained it, Asterisk is some boundlessly and infinitely powerful being. I asked whether he didn't mean God, and he said that God was merely Asterisk's errand boy. I asked how that was possible. The dwarf told me not even to try to understand. He said it was a great mystery, and repeated this several times. I asked him what was the correct name to use for someone who is mightier than God. Any name you like, the dwarf replied - the word 'Asterisk', or any other that can be spoken - they're no more than loose dust covers, they make no difference at all. That was what he said, honestly...",
    "[Romeo-y-Cohiba] What absolute gibberish.",
    "[Ariadne] The way I understood it, Asterisk is angry with people because at some time in the past they killed him. Or because they will kill him at some time in the future - the dwarf expressed himself in such a complicated manner, you could take his meaning any way at all. Since that time - or until that time - people have to pay tribute to Asterisk by sending him people to join in his games and die in his arena. Like us, for instance..."
  ],
  [
    "[Ariadne] But the dwarf said there was no need to be upset, because the people Asterisk sacrifices to himself all have already been born, and dying in the arena is the common fate that nobody escapes. I tried to ask in that case what was the point of the sacrificial tribute, but the dwarf began getting nervous and said, 'Look, he's coming, now you can see him for yourself.' I looked up. Two figures had appeared in front of the burnt-out building. Striding along solemnly in front was a dwarf holding a flag with the Merrill Lynch symbol on it - you remember it, they have that jolly little bull - and the inscription 'Be Bullish!' But I didn't feel like laughing at all, the figure following it looked so terrifying. I don't even know what to call him. He wasn't like a man. He was absolutely massive, and I thought for a moment he was a monstrously overgrown mushroom with a big cap of blackish-green metal. Then I took a closer look at him. He was wearing a long loose robe that reached right down to the ground, dark-coloured and not particularly clean either, but not the same kind of tattered rags as the dwarves. And on his head he had a bronze helmet, like a gladiator's mask - a headpiece with a wide brim and a plate with holes in it where the face would be. There were two horns on the helmet...",
    "[Monstradamus] Like a bull's horns?",
    "[Ariadne] They were much more massive and they didn't stick out to the sides, they ran backwards, merging into the helmet to form a single block. If I could compare them with anything, they looked a lot like the silencers of a bronze motorbike, curving along the rim of the headpiece with the round crown. There were lots of little rods and tubes on the helmet as well, all made of bronze, and they linked all its different parts together, so the whole thing looked a bit like an antique rocket engine."
  ],
  [
    "[Monstradamus] Is that how the dream ended?",
    "[Ariadne] I didn't see Asterisk again. Suddenly the dwarf and I were somewhere else, on one of the little streets, facing an old wooden door with a handle in the form of a ring set through the head of a bull. The dwarf knocked on the door with the ring and it opened. Inside there was a small room. From where we were standing all we could see was a bed with a man sleeping on it, a tall man with a moustache and a mole beside his nose. The dwarf muttered that we were in the wrong place, led me to a different door and opened it in the same way. The room behind it looked the same, but it was empty. The dwarf raised his finger and asked, 'I shall construct a labyrinth in which I can lose myself, together with anyone who tries to find me - who said this and about what?' I started thinking about it - in the dream I almost knew the answer. Then suddenly he pushed me inside and slammed the door shut.",
    "[Monstradamus] What happened after that?",
    "[Ariadne] The push woke me up and I found myself in the room I am in now. Then I sat down at the desk with the screen and typed in that question. I was afraid I might forget it. But I can still hear it in my head now.",
    "[Monstradamus] Is it the same room as you entered in the dream?",
    "[Ariadne] It's hard to say. It's just as small."
  ],
  [
    "[UGLI 666] That's of no relevance.",
    "[Organizm(-:] Is he/she really serious?",
    "[Monstradamus] I think he/she means what he/she says."
  ],
  [
    "[Monstradamus] We were talking about Ariadne's dream. It has been suggested that she was shown it specially and it contains information for everyone.",
    "[Romeo-y-Cohiba] What does that mean - shown it specially? This isn't a cinema. And if the information's for everyone, then why was it shown to Ariadne?"
  ],
  [
    "[Nutscracker] New members, once again, please introduce yourselves.",
    "[Sartrik] I'm absolutely xxx. My entire body aches.",
    "[Monstradamus] Have you been beaten up, or what?",
    "[Sartrik] I feel sick. Is there any beer to be had around here?",
    "[Monstradamus] I doubt it. Did you overdo it yesterday then?",
    "[Sartrik] Something of the sort.",
    "[Nutscracker] How did you end up in here?",
    "[Sartrik] I don't remember a thing."
  ],
  [
    "[Romeo-y-Cohiba] Leave the man alone, let him get his head together. But can this dream of Ariadne's be interpreted scientifically? Seems to me Monstradamus knows about that kind of thing.",
    "[Monstradamus] What does 'interpreted scientifically' mean?",
    "[Romeo-y-Cohiba] Well, for instance, this Asterisk is tall, with a big helmet. That symbolises the male sexual organ in a state of erection.",
    "[Organizm(-:] And the two dwarves symbolise the balls, do they?",
    "[Nutscracker] Cool it, Romeo. Sometimes a cochiba's just a cigar."
  ],
  [
    "[Organizm(-:] Unfortunately we can't just go out into the corridor.",
    "[Romeo-y-Cohiba] You didn't answer the question, Monstradamus. Can the dream be analysed?",
    "[Monstradamus] If you're thinking of penis symbolism, then I've got nothing to add to what Nutcracker said. But I do have a few observations along an entirely different line. I can share them if you're interested.",
    "[Nutscracker] Of course we're interested.",
    "[Monstradamus] In the first place, the names. Has anyone any guesses on that score?",
    "[UGLI 666] Names of demons from hell.",
    "[Monstradamus] The soap, the toilet paper and other items in the bathroom are all marked with something that looks like the symbol for indicating a footnote - a little star. It's called an asterisk, which is also the name of the character Ariadne dreamed about. It sounds a lot like 'Asterius.'",
    "[UGLI 666] What's 'Asterius'?",
    "[Monstradamus] 'Starry' in Latin. Asterius, the son of Minos and Parsiphae. The half-man, half-animal from Crete. Better known as the Minotaur."
  ],
  [
    "[Monstradamus] Now for that double axe on the door. In Greek it's called a 'labros'. That's where we get the word 'Labyrinth', the place where the Minotaur lived. Some accounts say it was a beautiful palace with lots of corridors and rooms, according to others it was a foul-smelling cave with numerous branches plunged in eternal darkness. Or it could be that people from different cultures had different impressions of the same place.",
    "[IsoldA] But what has an axe got to do with a labyrinth?",
    "[Monstradamus] They find them in Crete. Where the labyrinth was. That's all I know.",
    "[UGLI 666] Maybe the Minotaur was killed with an axe like that?",
    "[Monstradamus] Let me go on with the names. As well as Asterius and Asterisk, it's hard not to notice another coincidence. It was Ariadne who dreamed about him. That was the name of the Minotaur's sister. And it was also Ariadne who started this thread with the question about the labyrinth.",
    "[IsoldA] It's a very common name. I had a lotion for dry skin called 'Ariadne's Milk'.",
    "[Romeo-y-Cohiba] Names and coincidences are all very well. But what I don't understand is - what are we going to do?",
    "[Monstradamus] Well, what can we do? Wait for Theseus, who will lead us out of the labyrinth. And hope the joke doesn't go too far.",
    "[UGLI 666] Does it seem like a joke to you?",
    "[Monstradamus] Well, I'd say our hosts certainly seem to have a sense of humour.",
    "[Romeo-y-Cohiba] I haven't laughed even once yet."
  ],
  [
    "[Monstradamus] The name makes sense though. Our guardian really is unlimited.",
    "[Nutscracker] And another joke is the Merrill Lynch symbol on the flag.",
    "[Organizm(-:] But Ariadne saw the flag in a dream, so it's not clear whose joke it is. Our moderators' or hers.",
    "[Monstradamus] I wouldn't like to alarm anyone, but shouldn't we consider the possibility that Ariadne herself is also a joke by our moderators, as Organism called them.",
    "[Organizm(-:] Why's that?",
    "[Monstradamus] Because, phenomenologically speaking, she only exists in the form of messages of unknown origin signed 'Ariadne'.",
    "[Ariadne] Thanks. Ariadne.",
    "[Monstradamus] Ariadne, please don't take offence. I'm talking about a hypothetical possibility. It doesn't mean I suspect you of anything. The same thing could apply to any of us.",
    "[Organizm(-:] What does 'phenomenologically' mean?",
    "[Monstradamus] It's the way you can see these words now.",
    "[Ariadne] Everything I told you was the truth.",
    "[Nutscracker] Nobody ever doubted it. Nebuchadnezzar's just theorising, right?",
    "[Monstradamus] I'm not Nebuchadnezzar.",
    "[Nutscracker] Sorry, Monstradamus.",
    "[Monstradamus] I'm no more Monstradamus than I am Nebuchadnezzar, so what's the difference?",
    "[Organizm(-:] You know what I think? Either no one's noticed it or everyone has, but no one's saying.",
    "[Romeo-y-Cohiba] What's that, then?",
    "[Organizm(-:] We don't post our messages complete, like in a normal chat room. The words appear on the screen one letter at a time, in real time. We can even interrupt each other, and then three dots appear at the end of the phrase that's interrupted."
  ],
  [
    "[Romeo-y-Cohiba] Stick your xxx up your xxx and give it a double right twist.",
    "[IsoldA] They're following every word we write.",
    "[Monstradamus] Maybe that's why Theseus isn't saying anything?",
    "[Organizm(-:] What Theseus?",
    "[Nutscracker] The one who killed the Minotaur, Organism. Or who has to kill him. What do you have in mind, Monstradamus?",
    "[Monstradamus] Maybe he's already here, but he doesn't want the moderator to notice him. And I suspect the moderator's our bronze mushroom."
  ],
  [
    "[Monstradamus] And for exactly the same reason, Romeo, there's no reason to believe that you exist.",
    "[Romeo-y-Cohiba] That just about does it. Leave it out, will you?"
  ],
  [
    "[Organizm(-:] I bet a hundred xxx the Minotaur's Monstradamus.",
    "[Monstradamus] Stop clowning about.",
    "[Organizm(-:] Theseus, answer us!",
    "[IsoldA] At least tell us if you're here or not! Theseus!",
    "[Monstradamus] By the way. If the moderators can fulfil our wishes, why don't we ask them to open the door?",
    "[UGLI 666] But what's outside the door?",
    "[Organizm(-:] We can find out.",
    "[Romeo-y-Cohiba] You be careful, or the door might really go ahead and open."
  ],
  [
    "[Ariadne] I've composed a little poem. Dedicated to Monstradamus.",
    "[Monstradamus] Let's hear it.",
    "[Ariadne] The Minotaur lurks at the door, His axe it gleams moon-bright. 'Dear Watson this could not be more...' Then silence in the night.",
    "[Monstradamus] A bit on the dark side. But maybe I deserve it for being so suspicious."
  ],
  [
    "[Ariadne] Did it happen in all the rooms?",
    "[Monstradamus] It did in mine.",
    "[UGLI 666] Do you mean the music or the door?",
    "[Ariadne] The whole thing at once."
  ],
  [
    "[Organizm(-:] Doors, close!",
    "[Nutscracker] xxx be praised.",
    "[Monstradamus] Organizm, don't go trying any more experiments like that.",
    "[Romeo-y-Cohiba] Now how's Isolde going to get back? Doors, open!",
    "[Nutscracker] xxx, eh? Again!",
    "[Monstradamus] Let's just keep calm and get our bearings."
  ],
  [
    "[Romeo-y-Cohiba] It works.",
    "[Monstradamus] What can you see outside the door?",
    "[Ariadne] There's another room outside mine.",
    "[UGLI 666] Semi-darkness. Benches, a lot of benches.",
    "[Romeo-y-Cohiba] Fresh air at last."
  ],
  [
    "[UGLI 666] I never understood before why gluttony is a sin. Then a spiritual friend of mine explained. Gluttony is not so very terrible in itself. But it's a sign of a base soul. The same thing applies to debauchery. The soul doesn't become debased through committing these acts. A base soul manifests itself through them.",
    "[Romeo-y-Cohiba] No, you won't get under his skin that easily.",
    "[Monstradamus] Moderators! Give us all something to eat!",
    "[Ariadne] I heard some kind of noise. But where's the food?",
    "[Monstradamus] There's a small flap to the right of the monitor. Just a rectangle in the wall. Lift the flap and you'll find a tray behind it."
  ],
  [
    "[Romeo-y-Cohiba] A plan of the labyrinth at Versailles. That's a real piece of luck.",
    "[IsoldA] Versailles? Then why is it written with a small letter?",
    "[Monstradamus] I could suggest that's not really the strangest thing about our surroundings.",
    "[Romeo-y-Cohiba] Do you mind not butting into other people's private conversations?",
    "[Monstradamus] Sorry, I didn't realise it was private."
  ],
  [
    "[IsoldA] Not in the slightest. I suppose it sounds stupid.",
    "[Romeo-y-Cohiba] It sounds just fine. I just don't quite get it.",
    "[Monstradamus] Allow me to explain. There was nothing mysterious about Monica Lewinsky, and nothing sexual about the Mona Lisa. But if we imagine the scintillating mystery of the Mona Lisa fused with the earthy sensuality of Monica Lewinsky, and then add the charm of early youth, we get Isolde. Get it now?",
    "[Romeo-y-Cohiba] How many damn times do I have to tell you not to go butting into other people's conversations, Nebuchadnezzar?",
    "[Monstradamus] I'm not Nebuchadnezzar.",
    "[Romeo-y-Cohiba] Don't butt in anyway. I thought you wanted to eat. So why don't you?",
    "[Monstradamus] I've already eaten.",
    "[Romeo-y-Cohiba] Then have something to drink."
  ],
  [
    "[IsoldA] Let's hope it does. Ah yes, something else I forgot to tell you. I braid my hair at the back.",
    "[Ariadne] I think they're in love.",
    "[Monstradamus] According to their names they have to be. Imagine being called Romeo. What else could you do?"
  ],
  [
    "[Nutscracker] Romeo, are you still there? We thought you'd gone to bed.",
    "[Monstradamus] Ariadne! If you dream about that bronze mushroom again, try to find out what he's got on his mind.",
    "[Monstradamus] Ariadne, are you awake already?",
    "[Ariadne] Where are all the others?",
    "[Monstradamus] I don't know. Sleeping, I suppose. Well then? Did you dream about anything?",
    "[Ariadne] Yes.",
    "[Monstradamus] Tell me about it.",
    "[Ariadne] It was like a lecture. I was sitting in a lecture hall in some educational institution - a technical college to judge from all the pieces of equipment standing along the walls. I can't say what kind of equipment it was, some pieces had screens like televisions, others looked like scales with a lot of springs and counterweights. The lecture hall looked like an amphitheatre - it sloped down to a board and standing there beside it was the same dwarf who spoke to me by the fountain. Apart from us two, there was no one there. The entire board was covered by a complicated diagram of some kind of device.",
    "[Monstradamus] Can you remember what came before that? How you got there?",
    "[Ariadne] No. The dwarf waved to me as if I was an old friend and told me they had heard about our wish to discover what was on their master's mind. He said that would be the subject of the lecture. Everything that happened seemed to be perfectly natural, and I didn't feel like I needed to ask any questions. Although there were lots of strange things. For instance, the diagram wasn't drawn on the board with chalk. It was carved into it, like an engraving. I realised that because when the dwarf wanted to correct something in the drawing he took a chisel and began stripping long shavings of plastic off the board and leaving bright lines on it.",
    "[Monstradamus] What was it a diagram of?",
    "[Ariadne] It was Asterisk's mind.",
    "[Monstradamus] His mind?",
    "[Ariadne] Yes. The diagram was called 'the helmet of horror' - it was written in big letters above the drawing. But the dwarf repeated very insistently several times that it wasn't any kind of hat or apparatus, but precisely a mind, although everything about it looked like a drawing of some machine. The main body of the machine was shaped like a helmet. And there was an identical helmet standing on the demonstration table - an ancient bronze headpiece, and underneath it a visor with holes in it curving back inside.",
    "[Monstradamus] What do you mean by 'curving back inside'?",
    "[Ariadne] Its lower section ran back inside the helmet through a slit in the middle of the face. And there were some kind of side plates too - everything was very old, green with age. It looked like a Roman gladiator's helmet - like a bronze hat with a visor. Only this one had horns as well. They came out of the upper section of the helmet and curved backwards. I'd already seen that on the square by the fountain, when Asterisk walked by, only his helmet was bigger and more complicated, with lots of different wires and tubes. The dwarf said this one was a simplified model. What he told me sounded really peculiar.",
    "[Monstradamus] Can you tell me about it?",
    "[Ariadne] I remember that the helmet of horror consisted of several major parts and a lot of secondary ones. The parts had strange names: the Frontal Net, the Now Grid, the Separator Labyrinth, the Horns of Plenty, Tarkovsky's Mirror and so forth. The largest element consisted of the now grid and the frontal net. It had two parts that were sometimes fused into a single unit. Its external part, the net, looked like a visor with holes in it, and its internal part, the grid, divided the helmet into an upper section and a lower one, so there was no way you could squeeze even the smallest head into it. The dwarf said the now grid separates the past from the present, because it is the only place where what we call 'now' exists. Hence the name. The past is located in the upper section of the helmet, and the future in the lower section.",
    "[Monstradamus] That doesn't seem logical somehow. Maybe it's the other way round?",
    "[Ariadne] No, I definitely remember that. After that the dwarf began explaining how the helmet works. He said you had to grasp the essence of the matter first before going into the details. The helmet's operating cycle has no beginning, so it can be explained starting from any phase. And so, he said, start by imagining the gentle glow of a summer day caressing your face. That's precisely how the frontal net, heated by the action of the stream of impressions falling on it, transmits heat to the now grid. The grid sublimates the past contained in the upper section of the helmet, transforming it into vapour, which is driven up into the horns of plenty by the force of circumstances. The horns of plenty emerge from the forehead, curve round the sides of the helmet and intertwine to form the occipital braid, which descends into the base of the helmet. There, below the now grid, the bubbles of hope that arise in the occipital braid are ejected into the region of the future. As they rise, these bubbles burst against the now grid, generating the force of circumstances, which induces the stream of impressions in the separator labyrinth. And the stream of impressions, in turn, is shattered against the frontal net, heating the now grid and renewing the energy of the cycle. The heat he was speaking about when he used the verb 'to heat' is different from the kind of heat you get from fire, more like the kind you get from love. He said he was simply using an analogy with something I knew about, so I would be able to imagine what happens. And in the same way the stream of impressions doesn't actually flow anywhere, the bubbles of hope aren't really bubbles at all, and so on.",
    "[Monstradamus] I couldn't really say I understood all of that.",
    "[Ariadne] I didn't understand anything at first either, and the dwarf told me to ask questions. I didn't know where to begin, because everything was equally hard to understand. The last thing he'd mentioned was the bubbles of hope, so I asked why they were called that. The dwarf was a bit embarrassed and said it was the official name, like a formal title. In actual fact it's not always hope at all, he said, it's more likely to be fear and apprehension, suspicion and hate, all sorts of nonsense, in fact any of the cud that is chewed on with such habitual stupidity by... But then he broke off, glanced round furtively and muttered something about that not being the right way to put it. And then he went on in the formal lecturer's voice he'd been using before and said that technically speaking it was correct to call them bubbles of the past. And they were called bubbles because their constant tendency is to expand and occupy the entire volume of the helmet, preventing anything else from appearing in it and leaving no space or opportunity for the recognition of what is actually happening. The dwarf jabbed his pointer at the part of the diagram that showed the kind of vertical coil the horns formed where they came together at the back of the helmet and said that bubbles of hope arise in the occipital braid following the enrichment of past in the horns of plenty. But since past is enriched exclusively with more past, the bubbles of hope consist entirely of past, they are simply past in a different state. Which means that when Asterisk peers into the future, he sees nothing but the past. The lower section of the helmet is required primarily in order to cool the bubbles of hope, a process which endows them with vernal freshness and the elastic resilience of novelty. As they break against the now grid, they generate the force of circumstances, which lifts the past out of the upper section of the helmet into the entry chamber of the horns of plenty and forces it through the separator labyrinth, where the stream of impressions arises.",
    "[Monstradamus] What is the separator labyrinth?",
    "[Ariadne] It's a kind of plate with wavy slits in it located in the region of the forehead, in front of the entry chamber of the horns of plenty. The separator labyrinth is the most important part of the helmet of horror. It's the place where everything else is produced out of nothing, that is, the place where the stream of impressions arises. And it's also the place where the past, the present and the future are separated. The past moves upwards, the future moves downwards, and the present, in the form of the stream of impressions, falls on to the outer surface of the frontal net, generating the cycle's passionate desire to recur, so that it becomes a kind of perpetuum mobile .",
    "[Monstradamus] Hang on a moment. The bubbles of hope are just another state of past, right?",
    "[Ariadne] Yes, that's the way I understood it.",
    "[Monstradamus] But after they break, you get past, present and future?",
    "[Ariadne] That's right.",
    "[Monstradamus] That means it's past that decomposes into past, present and future?",
    "[Ariadne] In actual fact the whole cycle is simply the circulation of now in various states of mind, in the same way that water can be ice, or the sea, or thirst.",
    "[Monstradamus] But how does the stream of impressions arise in the separator labyrinth?",
    "[Ariadne] Under the force of circumstances.",
    "[Monstradamus] I see. But no, hang on. The separator labyrinth is inside the helmet?",
    "[Ariadne] Yes.",
    "[Monstradamus] You said the stream of impressions falls on to the outer surface of the helmet. But how can that happen, if it arises inside?",
    "[Ariadne] I asked about that too. The dwarf laughed and said that was merely an apparent contradiction. The point is, he explained, the 'inside' and 'outside' I was talking about have no existence in themselves. They are generated in the separator labyrinth by the force of circumstances and from there they enter the horns of plenty, where they enrich the past, transforming it into the state of bubbles of hope. But since there is no 'inside' and 'outside' anywhere except in the horns of plenty, the stream of impressions can quite easily arise inside the helmet and fall on to it from the outside. And the same applies to everything else as well. But the dwarf warned me that I should never under any circumstances regard anything as real. The entire phenomenon is induced, like the electromagnetic field in a transformer.",
    "[Monstradamus] Aha. Then what is Tarkovsky's mirror?",
    "[Ariadne] It's a small, fogged-up mirror set at an angle of forty degrees between the region of the future and the now grid. When the bubbles of hope entering from below are reflected in it they appear to be further along the line of their course than they are, which gives rise to the feeling that the line actually exists.",
    "[Monstradamus] I see. And why is the separator labyrinth the most important section of the structure?",
    "[Ariadne] Firstly, it's where the stream of impressions arises. Secondly, it's where 'I' and 'you', good and bad, right and left, black and white, so on and so forth and everything else arises. The dwarf said this part of the helmet of horror is the most important and it hasn't changed for thousands and thousands of years. Then just at that moment a ray of sunlight lit up a poster hanging beside the board. It showed a Cretan coin with a diagram of a labyrinth stamped into it. Most opportune, said the dwarf, that is the separator labyrinth. Its appearance is very distinctive. It has a cross section at the centre, which is reached immediately after entry, and numerous parallel paths running around the cross which seem at first to lead you off into the unknown but then come full circle. This is the most widespread image of the labyrinth, the one that is repeated on almost all the antique coins and drawings. The scanned projection of this labyrinth is a straight line, which means that once you've entered it there's no way you can get lost or find your way out. And that means we can regard the horns of plenty, the now grid, the separator labyrinth, the past and future as different sections of one and the same continuous route, which no one is actually following.",
    "[Monstradamus] Why are the horns of plenty called that?",
    "[Ariadne] Because they contain all sorts of everything - tender feelings, sidelong glances, exalted words, final thoughts and everything else. A genuine treasure house or rubbish tip. But all this infinite variety actually consists entirely of past. As far as I could understand it, the horns of plenty operate like enrichment units in a chemical plant. When it's driven through them by the force of circumstances, past gets mixed up with everything else, becoming richer and acquiring value, with the result that bubbles of hope are produced in the occipital braid, go gurgling through the region of the future, are reflected in Tarkovsky's mirror and perceived as the novel freshness of a brand new day.",
    "[Monstradamus] For a while now I've been getting the feeling something's not right here, but I just can't quite put my finger on it. Right, now I think I've got it! Who are they perceived by?",
    "[Ariadne] Who? By Asterisk, of course.",
    "[Monstradamus] That's it! But where is he, this Asterisk? The way I understand it, this helmet is arranged so you can't even squeeze your fist inside it, never mind your head. I don't suppose you asked about that?",
    "[Ariadne] No, I didn't, the dwarf told me himself. Asterisk comes into being in the same place as everything else. In the separator labyrinth.",
    "[Monstradamus] And then what?",
    "[Ariadne] And then the force of circumstances induces him to enter the horns of plenty, he gets mixed up with everything else, is enriched and returns to the now grid in the form of bubbles of hope.",
    "[Monstradamus] You don't understand. I want to know about the subject of perception of all this xxx. Its ultimate subject. Can't you understand that? Where is he?",
    "[Ariadne] I really don't understand what an ultimate subject of perception is. But there can't be any doubt that he must be in the horns of plenty, because there just isn't anywhere else.",
    "[Monstradamus] Then where does he come from?",
    "[Ariadne] From the separator labyrinth. Like everything else.",
    "[Monstradamus] Then what's the point of the whole business?",
    "[Ariadne] I don't know.",
    "[Monstradamus] All right. Let's try it a step at a time. Where does perception arise?",
    "[Ariadne] It's produced in the separator labyrinth.",
    "[Monstradamus] From what?",
    "[Ariadne] From the past. It was there in the past, wasn't it?",
    "[Monstradamus] It was.",
    "[Ariadne] Then why should it suddenly disappear from the present and the future?",
    "[Monstradamus] Where's Nutcracker got to? I can't make sense of all this on my own.",
    "[Nutscracker] I'm following your discussion with intense interest.",
    "[Monstradamus] My helmet of horror's about to overheat. Let me put the question a different way. If Asterisk, perception and everything else are produced in the separator labyrinth, then why do we say that it's Asterisk who perceives them?",
    "[Ariadne] The dwarf said that is simply his specific quality as a product. In other words, the idea that he perceives everything is produced in the separator labyrinth together with everything else.",
    "[Nutscracker] Produced from what?",
    "[Ariadne] From nothing. You haven't been listening properly."
  ],
  [
    "[Nutscracker] Ariadne, are you serious?",
    "[Ariadne] Yes, probably. Or perhaps not. To be quite honest, I'm tired. If I meet the dwarf, I'll make sure I ask him about everything. You think up some questions.",
    "[Monstradamus] Hang on a moment. How did the dream end?",
    "[Ariadne] After the lecture I went out into the corridor. There was no one there, just a big mirror in a semicircular frame on the wall. I went over and looked into it and woke up.",
    "[Monstradamus] What did you see in it?",
    "[Ariadne] Myself.",
    "[Monstradamus] And nothing unusual?",
    "[Ariadne] I was wearing a straw hat with a round crown and two little bunches of lilies-of-the-valley pinned to the brim at the back. The hat had a veil of thick lace with round holes, so I couldn't see my face behind it at all. It all looked very beautiful, but something made me feel nervous. I couldn't work out what was wrong until suddenly I recognised that bronze mask in my reflection and that frightened me, and then the dream suddenly ended. That's all. I'm going.",
    "[Organizm(-:] I thought from the very beginning that goon must be wearing a virtual reality helmet. Honest I did.",
    "[Nutscracker] That's not any kind of virtual reality helmet; it's some kind of fancy pressure cooker. Games for children. I ought to know how a virtual reality helmet works when grown-ups put one together, and this is nothing like it."
  ],
  [
    "[Nutscracker] Well, imagine you decide for yourself who's going to shoot who when you're watching an action movie. If you decide the main hero gets killed in the first shootout, then what happens to the rest of the plot? If you had genuinely free choice, the results could be pretty miserable. But art is supposed to make us happy, not miserable.",
    "[Monstradamus] That's for sure. And even when it does make us miserable, we should feel happy in our misery."
  ],
  [
    "[Organizm(-:] We don't have much else to occupy ourselves with.",
    "[Monstradamus] That's right. Tell us about it, Nutcracker. Let's give our brains a break."
  ],
  [
    "[Organizm(-:] How about an example?",
    "[Nutscracker] The simplest external editing program is 'Sticky Eye'. That's when, as you turn your head, one of the vases gets stuck in the field of vision and lingers there longer than it should.",
    "[Monstradamus] But what about the two other vases? They're standing next to it. According to the laws of perspective...",
    "[Nutscracker] How perspective operates inside the helmet is decided by us and our client."
  ],
  [
    "[Nutscracker] Touch your face with your hands. Can you feel any helmet?",
    "[Organizm(-:] No, but...",
    "[Monstradamus] I know what he's going to ask now. He's going to ask whether you can use a helmet to simulate what you feel with your hands.",
    "[Organizm(-:] Well that's right. It seems a natural enough question to me.",
    "[Nutscracker] If everything is simulated by the helmet, then it's not a helmet or a simulation any more. It's life."
  ],
  [
    "[Nutscracker] Certainly. There's an operator with a special monitor. He sees the Helmholtz as a dot on a radar screen. And the vases would be, say, red rhomboids. There's a manipulation menu on the same screen. The rest is all just like in Windows - click and drag.",
    "[Monstradamus] Click and drag. A great slogan for a double-edged axe."
  ],
  [
    "[Nutscracker] I don't know much about hypnosis. But if a hypnotist was powerful enough to make others see what he sees, why would he need a helmet?",
    "[Organizm(-:] In order to know what the others have to see.",
    "[Monstradamus] You could take it even further. Not just seeing, but actually being there. Asterisk wears a helmet in which he sees a labyrinth. And we're all inside this labyrinth. And he manipulates us.",
    "[Nutscracker] You mean we're all inside the Minotaur's head?",
    "[Monstradamus] You could say we're in the space that he sees.",
    "[Nutscracker] Then where's the Minotaur?",
    "[Monstradamus] We have to assume he's in the space that Ariadne sees in her dreams.",
    "[Organizm(-:] End of the line. Remember, Nutcracker, at the very beginning you asked me 'Where is here exactly?' I didn't understand your question at first. In the helmet of horror, that's where!"
  ],
  [
    "[Monstradamus] Automatically. It might all depend on which section of the helmet of horror a bubble of hope happens to burst in.",
    "[Organizm(-:] But I'm the one who sees the ray of sunlight or the dove, not Asterisk. I don't understand anything any more. Who's wearing the helmet of horror? Me or the Minotaur?",
    "[Nutscracker] The Helmholtz.",
    "[Monstradamus] We've been talking about that helmet too long already. It feels like we keep trying it on over and over again. It will attach itself permanently to our heads soon. Let's change the subject.",
    "[Organizm(-:] Great idea, let's. I've just had a thought. Has anyone ever wondered why Star Wars has such a strange sequel - instead of filming what came after the third episode, they filmed what came before the first one?",
    "[Monstradamus] Why?",
    "[Organizm(-:] At the end of the third episode Darth Vader dies, and that's the end of all the Star Wars. There can't be any more, because he's the Minotaur of that world, and that black heap of junk on his head is the helmet of horror. He thinks every one of them: Luke Skywalker, the robots, Chewbacca and all the rest of it. So after he's killed there can't be any continuation.",
    "[Monstradamus] But Darth Vader takes his helmet off before he dies. And underneath he has a normal head, only covered in scars.",
    "[Organizm(-:] Yes, but it's just a fantasy, after all."
  ],
  [
    "[Romeo-y-Cohiba] I'm back. What's happening here?",
    "[IsoldA] Nothing very interesting. Nutcracker was telling everybody about politics. And I only got back from Versailles just recently.",
    "[Monstradamus] Nutcracker, on that business of royalist France. You know, the Marquis turned out not to be so terrible after all."
  ],
  [
    "[UGLI 666] Nutcracker, do you know any Latin?",
    "[Nutscracker] The Senate and People of Rome. P-Q-R-S. No, I'm confusing it with the alphabet. What the Romans had was S-P-Q-R.",
    "[Monstradamus] Why are you interested in Latin, Ugly?",
    "[UGLI 666] To translate a few words.",
    "[Monstradamus] I'll give it a try.",
    "[UGLI 666] What's 'aiselceclesia'?",
    "[Monstradamus] I don't know.",
    "[UGLI 666] And 'ieselceaeclesi'?",
    "[Monstradamus] I don't know that either. Are you sure it's Latin?",
    "[UGLI 666] What else could it be?",
    "[Monstradamus] I can't tell yet. Can you give us the whole phrase?",
    "[UGLI 666] It's very long.",
    "[Monstradamus] Then a couple of words at least.",
    "[UGLI 666] It starts: 'aiselceclesia ieselceaeclesi selceataecles elceatctaecle'.",
    "[Monstradamus] Stop, that's enough for now.",
    "[UGLI 666] What is it?",
    "[Monstradamus] Not so fast. Let me have a think.",
    "[Nutscracker] Where's it from, Ugly?",
    "[UGLI 666] From a labyrinth.",
    "[Nutscracker] Have you got a labyrinth outside your door?",
    "[UGLI 666] What else am I supposed to have?",
    "[Nutscracker] Catacombs.",
    "[Monstradamus] Don't mock, Nutcracker."
  ],
  [
    "[UGLI 666] Can you make anything of it, Monstradamus?",
    "[Monstradamus] Were the words written in a column, one under the other?",
    "[UGLI 666] Yes.",
    "[Monstradamus] Can you type the one that was in the middle?",
    "[UGLI 666] What do you mean? Which one's that?",
    "[Monstradamus] The seventh from the top, if that makes it easier.",
    "[UGLI 666] Eatcnasanctae.",
    "[Nutscracker] Eat NASA. I can't make out any other references there.",
    "[Monstradamus] Where did you find it?",
    "[UGLI 666] I don't really want to talk about that.",
    "[Monstradamus] What if I reproduce the entire inscription, then will you tell me?",
    "[UGLI 666] In that case, yes.",
    "[Monstradamus] The inscription was this: A I S E L C E C L E S I A I S E L C E A E C L E S I S E L C E A T A E C L E S E L C E A T C T A E C L E L C E A T C N C T A E C L C E A T C E A N C T A E C E A T C N A S A N C T A E C E A T C N A N C T A E C L C E A T C N C T A E C L E L C E A T C T A E C L E S E L C E A T A E C L E S I S E L C E A E C L E S I A I S E L C E C L E S I A",
    "[UGLI 666] That's right. How did you do that?",
    "[Monstradamus] Dominus illuminatio mea.",
    "[UGLI 666] But what does it mean?",
    "[Monstradamus] The Lord is my light.",
    "[UGLI 666] I mean what does my inscription mean?",
    "[Monstradamus] Well, what do you think?",
    "[UGLI 666] I can't make any sense of it at all. What sense is there?",
    "[Monstradamus] The sense can be very different, depending on where you found it. So you'll have to be honest about everything.",
    "[UGLI 666] All right. Outside my door there really is a hall with benches. I didn't really look at it properly at first. But then when I did... I'm not even sure whether you'll believe me or not, Monstradamus.",
    "[Monstradamus] I'll give it a try.",
    "[UGLI 666] There's a cathedral there. A Gothic cathedral."
  ],
  [
    "[Monstradamus] The meaning of that is more or less as follows - 'the labyrinth represents the world in which we live, wide at the entrance, but narrow at the exit. He who is ensnared by the joys of this world and is burdened with its sins, may only rediscover the doctrine of life through effort.' Only don't ask me what the doctrine of life is. Was there really a wide entrance and a narrow exit?",
    "[UGLI 666] There wasn't any entrance or exit at all in the usual sense. The entire labyrinth was laid out on the floor of the cathedral in light-blue marble. It's just a mosaic."
  ],
  [
    "[UGLI 666] Yes. But the second canon objected that the Christian path is as simple and straight as an arrow. And the twists and turns and dead-ends of the labyrinth symbolise sin, in which fallen souls wander, hopelessly lost. And then the first canon replied that he had essentially meant the same thing, since sin is a distortion arising in the straight line of the Christian path. But no matter how tortuous the path of life might be, if the person walking it remains within the bosom of the Church, the simple arithmetic of good and evil ceases to apply, and the higher mathematics of the spirit comes into play.",
    "[Nutscracker] Now we've got a second canon as well.",
    "[Monstradamus] And what higher mathematics is that?",
    "[UGLI 666] However crooked and tortuous a life may be overall, a communicant of the Sacred Gifts may regard each infinitesimally small sector of his path as straight. And if any sector of his path is straight, then it is straight at any moment, and if it is straight at any moment, then it is always straight, and the Lord will not reject his soul."
  ],
  [
    "[UGLI 666] They said that a long time ago, when faith was strong in people's souls, a priest could send a repentant sinner on a pilgrimage to the Holy Land. In later times, when faith began to fail...",
    "[Nutscracker] Not about the instructions, tell us about the canons themselves. Don't you understand, or what? No one else here has met anybody.",
    "[Monstradamus] What about Ariadne?",
    "[Nutscracker] She only dreamed about them. Surely I don't have to explain the difference?",
    "[Monstradamus] Yes, explain it, Nutcracker.",
    "[Nutscracker] You don't understand the difference between a dream and reality?",
    "[Monstradamus] I don't understand what the difference is between the two stories.",
    "[Nutscracker] The difference is one's about a dream and one's about reality.",
    "[Monstradamus] But all I can see are letters on a screen."
  ],
  [
    "[Nutscracker] These canons, what did they look like?",
    "[UGLI 666] Medium height. In threadbare cassocks, with old-fashioned, wide-brimmed cardinal's hats on their heads. The canons explained that the hats once belonged to holy prelates and they helped to calm the passions. The second canon had the brim of his hat bent upwards at one side, like a duellist. It reminded me of Aramis from 'The Three Musketeers', the one who was an ordinary sinner at first, and then became a general of the order of Jesuits.",
    "[Monstradamus] Sounds like the two dwarves that Ariadne saw at the very beginning.",
    "[Nutscracker] That's what I thought too. But those were dwarves, and these two are medium height.",
    "[Monstradamus] Ugly, what height are you?",
    "[UGLI 666] That has nothing to do with anything."
  ],
  [
    "[Nutscracker] The League?",
    "[UGLI 666] Yes. It's the old name for the church labyrinth. That's approximately how long it was. Although the one I was facing was a lot shorter. You were supposed to walk through these labyrinths on your knees. And for the time of ultimate decline that will come just before the end of the world, labyrinths on walls were prepared, really small ones that people go through by tracing the way with their finger. They are for those who are only willing to spend a very small amount of time on their souls. But there are labyrinths that are quite the opposite, endlessly long ones in which you can repent eternally. For instance in the Church of Sta. Maria-di-Trastavera in Rome. The first canon showed me a plan of it.",
    "[Monstradamus] He prepared well for the conversation.",
    "[UGLI 666] He didn't prepare for it. The plans of the labyrinths were on the columns and walls of the cathedral. In fact, everything there was covered with them. The one that's in Sta. Maria-di-Trastavera consists of a large number of circles set inside each other. It looks like a target for shooting practice. It's the most mystical of all the labyrinths.",
    "[Monstradamus] The most mystical one is mine; please enter that in the minutes."
  ],
  [
    "[Nutscracker] And where's that inscription with the secret message from, the one you asked us to translate?",
    "[UGLI 666] From an ancient basilica in Algeria.",
    "[Monstradamus] Does it have a labyrinth too?",
    "[UGLI 666] Yes. It surrounds a central square containing the holy inscription. The canon told me to copy it out and assured me there was a secret in the inscription. He said I would only be able to read it when I had the key. In exactly the same way, he said, I would not be able to understand the predestined purpose of people and things in this world until the moment when the wisdom that comes with true faith opened my eyes to the transcendental meaning of creation. And the key to that wisdom was the same as the key to the inscription. He also told me not to be seduced by the empty talk about Theseus, which he knows all about. In time, he said, I would see for myself that the true Theseus is the One whom he serves. And that's all. Is Monstradamus still there?",
    "[Nutscracker] Later. Go on with your story.",
    "[UGLI 666] I'm not going to tell you any more until he translates for me.",
    "[Nutscracker] Monster, are you there? Translate for her, please.",
    "[Monstradamus] The whole point is in the way the letters are arranged. In French it's called a jeu-de-lettres .",
    "[UGLI 666] But do you have the key to the inscription the canon was talking about?",
    "[Monstradamus] Of course.",
    "[UGLI 666] What is it?",
    "[Monstradamus] It's a cross.",
    "[UGLI 666] My Lord! Thy will be done!",
    "[Monstradamus] Yes. You have to start from the very centre. Find the letter S there and trace a cross through it. If you read the text in any direction of the cross and then along any line from it at right angles, you get SANCTA ECLESIA, which means 'the holy church', with one mistake.",
    "[UGLI 666] Are you saying the inscription was made with a spelling mistake? Or does the inscription refer to a mistake made by the holy church?",
    "[Monstradamus] What I'm saying is there should be two C's in the word for church - ecclesia. But in olden times they might have thought that was excessive.",
    "[Nutscracker] Then what happened, Ugly?",
    "[UGLI 666] Wait a moment. Let me see if it works with the letters. It really does. How profound! Now I understand what the canon was trying to say, Monstradamus. This world will remain a meaningless conglomeration of absurdities and riddles, where we continue to wander aimlessly about in the dark, until we accept the teachings of the Holy Church. But as soon as that happens, the holy cross will shine out at the centre of life's labyrinth, and the fullness of the purpose concealed in all things will instantly be revealed! The world will be miraculously transformed, the harmonious scheme of things will emerge from the chaos and insanity, and whichever way we direct our gaze, we shall see Hosannah to the Lord on every side! Is that right, Monstradamus?",
    "[Monstradamus] But of course. And we shall hear the radiance of His glory."
  ],
  [
    "[Nutscracker] And are you sure you didn't just dream it all, like Ariadne?",
    "[UGLI 666] Yes, I'm sure. The canon gave me a rosary and I'm holding it in my hand. I'm going to take a rest now.",
    "[Monstradamus] Yes, Ugly, take a rest. After all you've been through it will do you good.",
    "[Nutscracker] An interesting crossword puzzle. But from a mystical point of view, how do you explain that at the very centre of the labyrinth of life there lies the letter 'S'?",
    "[Monstradamus] That ought to be clear enough to you of all people, Nutscracker.",
    "[Nutscracker] Why?",
    "[Monstradamus] You have the same letter at your centre too. And just at the moment it's looking like a dollar sign.",
    "[Nutscracker] Where? Oh, that. That's the moderators taking the piss again. If that's what you had in mind, I can tell you the pay for my job is so low it's an insult.",
    "[Romeo-y-Cohiba] Isolde, are you back yet?",
    "[Monstradamus] Hi there, Romeo.",
    "[Romeo-y-Cohiba] Are you IsoldA then?",
    "[Nutscracker] Cohiba's in a bad mood today.",
    "[Monstradamus] I liked the phrase 'With every new second I was immersed deeper and deeper into the past.'",
    "[Nutscracker] Yes, I noticed that too.",
    "[Monstradamus] Pure poetry. With every new day we slide deeper and deeper into the past. We disappear into it, like a diver sinking under the water in a slow-motion sequence. What is the difference between an old man and a young man if you put them side by side?",
    "[Nutscracker] One of them is old and one of them is young.",
    "[Monstradamus] Yes, but what does that mean? That there is only a tiny little piece of the old man left in our dimension - he is almost completely submerged in Lethe's waters of oblivion. But the young man is still all here - he has just barely touched the surface of the water. Isn't that it?",
    "[Nutscracker] I don't know. The way things are these days, they could both go down together at any moment. And the size of the pieces would depend less on their age than the force of the blast.",
    "[Monstradamus] That's also true.",
    "[Nutscracker] And, as for that phrase you liked, I think Ugly was thinking of the helmet of horror. The future is produced from the past, so the further we go into the future, the more past is required to produce it. You know, the closer you build to the stars, the deeper the pit you dig the soil out of..."
  ],
  [
    "[Nutscracker] And, to complete the picture, you could say the bubbles of the past were bursting in a helmet that was running 'Sticky Eye' and 'Sunny Kiss' simultaneously.",
    "[UGLI 666] What?",
    "[Monstradamus] Are you still here, Ugly? Take no notice, he's joking.",
    "[UGLI 666] I should never have told you.",
    "[Monstradamus] Don't be offended, Ugly.",
    "[UGLI 666] I'm never going to tell you anything again.",
    "[Monstradamus] Say you're sorry, Nutcracker.",
    "[Nutscracker] For what?",
    "[Monstradamus] Please, say you're sorry.",
    "[Nutscracker] All right. I'm sorry, Ugly.",
    "[UGLI 666] God will forgive you."
  ],
  [
    "[IsoldA] And now to sleep, Cohiba. Be seeing you.",
    "[Nutscracker] Be seeing you, be seeing you. Monster, are you there?",
    "[Monstradamus] Yes. Where else could I be?",
    "[Nutscracker] Well, what do you make of that?",
    "[Monstradamus] No doubt our master shed a great big sentimental tear. The twilight of Ancient Greek thought in a nutshell. Zeno's paradoxes. Achilles can't go riding in his big beautiful car. Because when he's riding in it, he can't see it. The passers-by can see it, so they're the ones riding in it. And Achilles only imagines he's driving it, but in actual fact it's driving him.",
    "[Nutscracker] I feel a bit jealous. How about you?",
    "[Monstradamus] Not particularly. I don't like jeeps. You're too high above the road when you sit in them. And anyway an RR SUV is a bit OTT. Cohiba ought to have an Alfa Romeo.",
    "[Nutscracker] I don't mean the car. Alfa Romeo, Beta Romeo - all that sounds like the stud ranking in a herd of chimpanzees to me. I mean the feelings.",
    "[Monstradamus] But you have them too. They have love, you have envy. As comrade Ariadne teaches us, these are merely different states assumed by past within the helmet of horror.",
    "[Nutscracker] And on that optimistic note...",
    "[Monstradamus] Yes indeed. Good night."
  ],
  [
    "[Organizm(-:] Who wants to chat?",
    "[Ariadne] I do.",
    "[Nutscracker] And I do.",
    "[Monstradamus] And I do I suppose.",
    "[Organizm(-:] An interesting team. Monstradamus, Ariadne, me and Nutcracker. Has anyone noticed that the four of us have something in common?",
    "[Nutscracker] It would be hard not to notice. We all use toilet paper with a little star on it.",
    "[Monstradamus] And we share a great passion for life."
  ],
  [
    "[Monstradamus] I know what he means. None of us has said anything about our labyrinths.",
    "[Ariadne] Really? It's just that no one's asked me."
  ],
  [
    "[Nutscracker] A labyrinth like that could give you bedsores, Ariadne.",
    "[Ariadne] You weren't listening to what I said, Nutcracker. The mattress I have is so wonderful I can't even feel it. What bedsores? An angel could sleep on it without even creasing its wings.",
    "[Monstradamus] That's an interesting subject. How angels sleep.",
    "[Ariadne] Probably like bats, on a coral perch. And they have special gold hooks on their slippers.",
    "[Monstradamus] Perhaps. Only they hang head-up, because they aren't attracted by the earth's gravity, only by the love of the Lord. Like Ugly said. Angels are non-material beings.",
    "[Organizm(-:] Then how did they manage to choose wives for themselves from among the daughters of man and beget children?",
    "[Nutscracker] Ugly probably knows about that. Or she can check with some of her friends. Ugly, are you there?",
    "[Monstradamus] By the way, on the subject of checking with your friends. Ariadne, you said we could ask you questions about the helmet of horror in case you have another dream about our management.",
    "[Ariadne] Of course.",
    "[Monstradamus] I have three. Firstly, I really would like to know how everything else can be manufactured out of nothing. And secondly, how the helmet of horror can be located inside one of its own parts, and does that mean that inside one helmet there is a second one, and inside the second a third one, and so on to infinity in both directions? And the final question is - exactly how does the separator labyrinth work?",
    "[Ariadne] All right, I'll ask."
  ],
  [
    "[Ariadne] All right. I'll be going then.",
    "[Monstradamus] Just like that?",
    "[Ariadne] I'll forget the questions later.",
    "[Nutscracker] Go on then. And we'll carry on here. What was that you said about your labyrinth. Monster?",
    "[Monstradamus] When was that?",
    "[Nutscracker] When Ugly was telling us about the cathedral. They showed her something like a target and said it was the most mystical labyrinth there could possibly be. And you claimed the most mystical one was yours. I'm curious about what it is.",
    "[Monstradamus] I think I really ought to take those words back. The most mystical one is probably Sartrik's. Sartrik, are you there?",
    "[Nutscracker] He must be busy with his booze now.",
    "[Monstradamus] Then tell me about your labyrinth. Or Organism can tell us about his.",
    "[Organizm(-:] I haven't got anything interesting. Just a screen-saver.",
    "[Monstradamus] What?",
    "[Organizm(-:] In Windows there's a screen-saver called 'maze'. And I've got a model of it here. Built out of planks instead of pixels. It's the only time I can ever recall software being turned into hardware.",
    "[Monstradamus] Did anyone understand that?",
    "[Nutscracker] I know what he's talking about. It's a kind of program.",
    "[Monstradamus] And it switches off the screen?",
    "[Nutscracker] Just the opposite, it switches it on to full power.",
    "[Monstradamus] Then why's it called a screen-saviour? What kind of salvation is that?",
    "[Nutscracker] Ugly can ask her canons about that. They know all about saviours and salvation."
  ],
  [
    "[UGLI 666] If that is a blasphemous insult to the Saviour, He'll forgive you for it, you sinful simpleton.",
    "[Nutscracker] Do you know who he reminds me of? A spiteful little sorcerer who gets the urge to torture a kitten. So he goes down into a deep, dark cellar, moulds a kitten out of clay, brings it to life and then - whack! - he smashes its head against the corner of the wall. And he does that every weekend, a hundred times or more. And to make sure no miaowing is ever heard from the cellar, our sorcerer teaches the kittens to think stoically - I came from the dust and to the dust I return. And he forces them to pray to him for the few seconds of their existence.",
    "[Monstradamus] God only knows what goes on inside that head of yours, Nutcracker.",
    "[UGLI 666] Not God, the devil. That's already a blasphemy against the Holy Ghost, be careful, Nutcracker.",
    "[Monstradamus] Stop it will you, you're like little children. Let's just drop it. Why don't you tell us about this screen-saver, Organism?"
  ],
  [
    "[Organizm(-:] A little room with the words 'Open GL' on the wall. The real screen-saver has the same words, but they hang in the air there, and here they're daubed on the plywood in gloss paint. What does that mean, anyway?",
    "[Nutscracker] Do you know, Monster?",
    "[Monstradamus] Open General License? Or maybe Open Great Labyrinth?"
  ],
  [
    "[Organizm(-:] I sat there for ages and ages. I had the feeling I was about to understand the most important thing of all at any moment. But I didn't understand a thing.",
    "[Monstradamus] That's always the way.",
    "[Organizm(-:] What do you mean? Always the way when you sit looking into a mirror for a long time?",
    "[Monstradamus] Always the way when you feel you're just about to understand something important. It's like the whistle of a bullet or the roar of an aeroplane. If you can hear them, it means they're already zooming past you.",
    "[Nutscracker] Organism, why are you so sure the centre of the labyrinth is where the mirror and the chair are?",
    "[Organizm(-:] Because of the mirror and the chair. What else would they be doing there?",
    "[Monstradamus] That seems pretty obvious.",
    "[Nutscracker] So what have you got, Monster? I'm dying of curiosity.",
    "[Monstradamus] You go first, we agreed.",
    "[Nutscracker] Okay. I'll tell you what I've got. It's a bit like a TV editing room. Professional equipment - a Betacam VCR, a special monitor, all sorts of mixers for functions I don't really understand. The whole works. There's a weird-looking poster hanging on the wall, a picture of a dog in an empty white room. On the wall in front of the dog there's something like a distribution board with a few little lamps screwed into it. Two of them are lit up - a red one on the left and a blue one on the right. And below the lamps there's a bell, surrounded by drawings of sound waves - it's obviously ringing. There's an electrode inserted into the dog's head, with wires leading from it to the distribution board. And there's a cut on its belly stuck together with sticking plaster and a rubber tube leading down out of it into a glass flask standing on the floor. The dog's right paw is raised, its tongue is hanging out, its ears are pricked up and its eyes are full of love. The text underneath it reads: 'Put it there, bro!' The first time I saw it I just froze. I wondered how the moderators could have found out. It was only afterwards I remembered I told you all about 'Pavlov's Bitch'. Standing under the poster there's a safe full of Betacam tapes with episodes of 'The Hornists of Plenitude' - that's a kind of chic international TV programme, it has these interesting titles, with the globe flanked by two bugles. The tapes all contain pretty much the same thing: a television address by someone putting himself forward for the job of Theseus. In most cases the candidate is a middle-aged man with a pleasant face and good diction. He's sitting in front of some kind of symbol, with a dozen microphones standing on a table in front of him. He promises to deal with the Minotaur and lead everyone out of the labyrinth. Before that, naturally, he expounds his own vision of what the labyrinth is and who the Minotaur is.",
    "[Monstradamus] What kind of visions are they?",
    "[Nutscracker] All sorts.",
    "[Monstradamus] How about an example?",
    "[Nutscracker] Well, take the last one for instance. The candidate was a tall man with grey hair. A professor of history, very distinguished looking, stylishly dressed. And his symbol was beautiful, a bit like a knight's coat of arms: a bull's skull in a net against a hatched ground. The man said the labyrinth is a symbol of the brain. An exposed brain and a classical labyrinth even look very similar. The Minotaur is the animal part of the mind and Theseus is the human part. The animal part is stronger, of course, but the human part triumphs in the end, and this is the meaning of evolution in history. At the very centre of the labyrinth there is a cross that symbolises the intersection of the animal and human principles. That is the site of the initiatory passage, where Theseus meets and conquers his enemy. He said you can only conquer the Minotaur in yourself. We must strangle the beast without mercy, and then we will be morally justified in renaming the Helmet of Horror the Helmet of Civilisation and Progress.",
    "[Monstradamus] And what was his program like?",
    "[Nutscracker] In the labyrinth you have to turn twice to the right and once to the left, then twice to the right and once to the left again, and so on right to the end.",
    "[Monstradamus] Tell us about another one then.",
    "[Nutscracker] The last but one. A Frenchman. He was definitely the cleverest of the lot, and his appearance was very picturesque - a threadbare Chinese field jacket, with a pipe and a wild shock of hair. His symbol was a red and white chessboard with butterflies on the white squares and letters from various alphabets on the red ones. For the first few minutes he just stared into the camera, then he ruffled up his hair and announced that he would start with a truism. The major achievement of contemporary French philosophy, he said, was its success in establishing a non-contradictory unity of liberal values and revolutionary romanticism within the bounds of a unitary sexually aroused consciousness. After that he glared out of the screen for at least a minute without speaking, then he raised a finger and explained in a whisper that this declaration, despite its crystal clarity, is already a labyrinth, for a labyrinth comes into being in the course of any discussion with yourself or others, and for that period of time each of us becomes either the Minotaur or his victim. Although there is nothing we can do with this, he continued, there's nothing we can do without it either. Specifically, however, we can introduce a broader concept than the labyrinth - we can declare a discourse.",
    "[Monstradamus] Oh Mama! When I hear the word 'discourse', I reach for my simulacrum.",
    "[Nutscracker] According to the shaggy professor, a discourse is the place in which words and concepts, labyrinths and Minotaurs, Theseuses and Ariadnes all come into being. Even the discourse itself can only come into being within the discourse. But the paradox is that, although the entirety of nature arises within it, the discourse itself is not encountered anywhere in nature and was only developed quite recently. Another tragic dissonance is that, although everything comes into being within the discourse, without funding from the state or private individuals the discourse itself only lasts for three days at the most and is then extinguished forever. And so there can be no more urgent task for society than to fund the discourse.",
    "[Monstradamus] Okay, I understand about the discourse, but what did he say about the labyrinth?",
    "[Nutscracker] When he was talking about the labyrinth he spoke very quickly, so I don't remember it all. Basically, a labyrinth comes into being when you have to choose between several alternatives, and the alternatives are a set of our possible preferences, conditioned by the nature of language, the structure of the moment and the specific features of the sponsor. I didn't understand very much after that, I only remember that at some point he launched into the 'Internationale', and at first he sang really loudly and menacingly, but after a minute he shifted into 'Happy birthday to you'.",
    "[Monstradamus] That's called the plurality of discourses. I remember that from university. And what did he say about the Minotaur?",
    "[Nutscracker] The Minotaur is you.",
    "[Monstradamus] Me?",
    "[Nutscracker] I could almost feel you shudder. He didn't mean you in person. He looked into the eyes of his imaginary viewer, waved his arms about like an eagle flapping its wings and yelled: 'Minotaure! Minotaure, c'est toi!! Tu es Minotaure!!!' Then he calmed down. He said you simply have to understand that the Minotaur is a projection of your mind and therefore he is nobody else but you.",
    "[Monstradamus] Did he say what we ought to do?",
    "[Nutscracker] What else? As long as there's a sponsor, carry on with the discourse!",
    "[Monstradamus] But what turns do we make in the labyrinth?",
    "[Nutscracker] We follow the turns the discourse takes.",
    "[Monstradamus] Interesting.",
    "[Nutscracker] To be honest, I didn't really understand what a discourse is, even after the hairy guy had just been talking about it.",
    "[Monstradamus] It's something like a glue that sticks the helmet of horror on really solidly. So you can't get it off again.",
    "[Nutscracker] Don't frighten me.",
    "[Monstradamus] You're the one who's been frightening me for the last hour. Were there any women candidates?",
    "[Nutscracker] Yes. There was one very attractive little heifer who looked like a psychiatrist. Her symbol was right for that, too: a bull on a chain lying on a couch. I don't remember everything she said now, but the main idea was that the only way to defeat the Minotaur is to stop thinking of yourself as a victim. Then he'll simply disappear. Everyone has his own Minotaur, she said, but in reality it's not he who pursues us, we pursue him. And the labyrinth in which we seek him is the dopamine chains of pleasure linking up into rings in the human brain - they're different for everyone, as unique as fingerprints. And as for which turns to make in the labyrinth, it's all very simple. Suppose you're standing at an intersection with ten identical corridors leading in different directions. Then of course your choice of which corridor to follow should not be determined by fears and superstitions, but by the promptings of simple common sense.",
    "[Monstradamus] So did you make a choice?",
    "[Nutscracker] How do you mean? Between corridors?",
    "[Monstradamus] Between candidates.",
    "[Nutscracker] I'm not really sure what position I'd be choosing the candidate for. Or what institution, or what term. Or how he'd be going to lead me out of the labyrinth, when the room has no doors or windows.",
    "[Monstradamus] He'll lead you out through the television. How else? You of all people should understand that. Is there anything else you remember?",
    "[Nutscracker] I watched it all on fast forward, just listened to each one for about five minutes to get the general idea. As long as they're talking it all seems interesting and new. Then you wind on the cassette and you've forgotten it all. Some American or other said that the labyrinth is the Internet. That it's inhabited by a some being that hacks into the mind, and that's the Minotaur. It's not really a bull-man, it's a spider-man. He said if there's a worldwide web, then there must be a soul-sucking spider. He also explained why the Minotaur has two names. It seems that 'Minotaur' is the politically correct version of the name 'Asterisk'. So every time we want to say 'Asterisk', we should say 'Minotaur'. But then 'Asterisk' is the politically correct version of the name 'Minotaur', and every time we want to say 'Minotaur' we should say 'Asterisk'. And so in principle we can use both names, only not when we want to, but the other way round. There was an interesting German who said that the Minotaur is the spirit of the time, the Zeitgeist , which has manifested itself in the form of mad cow disease, hence its symbolic representation in the form of a man with a bull's head. Its counterpart in art is postmodernism, which is the mad cow disease of a culture forced to feed on its own powdered bones. And in politics it's all that stuff you see and feel when you switch on the television. Then there was an Italian, dressed in black, who announced that the Minotaur - he said 'Mondotaur' - is a being whose physical body is the gross dollar supply. It's stupid to believe that everything is controlled through money, he said - why through it and not by money itself? The Mondotaur is the evil spirit that reigns over the world, and compels every single one of us to wander aimlessly through the foul, stinking labyrinth of his intestines. And his two horns are... I've forgotten.",
    "[Monstradamus] It doesn't matter, I can imagine.",
    "[Nutscracker] Then a priest with kind eyes spoke and explained that the creator of the labyrinth is also our saviour, who loves us greatly. In much the same way as we love little children, he said.",
    "[Monstradamus] And what proposals did they all have?",
    "[Nutscracker] It all came down to how many times to turn right and how many times to turn left, and in which order. Everyone wanted to do it his own way.",
    "[Monstradamus] Perhaps that's the whole point. Not to think about where the way out is, but to realise that life is the crossroads where you're standing at this precise moment. Then the labyrinth will disappear as well. After all it only exists as a complete whole in our minds, and in reality there is nothing but a simple choice - which way to go next.",
    "[Nutscracker] Uhuh. And the Minotaur won't do anything to us, because the present 'us' will no longer exist when he catches up with us. One of them said that as well.",
    "[Organizm(-:] And now what's outside your door, Monstradamus? It's about time you told us, you're the only one left.",
    "[Monstradamus] You'll be disappointed, Organism.",
    "[Nutscracker] We'll see. So what have you got?",
    "[Monstradamus] A dead-end.",
    "[Nutscracker] I don't get it.",
    "[Monstradamus] A corridor a few metres long ending in a blank concrete wall with a single depressing graffito . Or at least I find it depressing. The imprint of a gigantic seal drawn in fluorescent lilac paint, like something on an official document from Hell. In the centre is the Roman numeral 'VII' and running out from it in a spiral is an endless string of symbols like the ones that street-gangs leave on walls. Nothing but zigzags, intricate curls, arrows and brackets - impossible to make out a single word. But all very suggestive.",
    "[Nutscracker] Just a dead-end?",
    "[Monstradamus] That's all there is.",
    "[Nutscracker] All there is?",
    "[Monstradamus] Well, not quite. There's a table standing against the wall directly under the seal. And a stool by the table. And on the table there's a blank sheet of paper, a pencil and a pistol with a single bullet.",
    "[Nutscracker] What about the labyrinth?",
    "[Monstradamus] I think that starts afterwards.",
    "[Organizm(-:] Truly magnificent simplicity and elegance.",
    "[Monstradamus] There's nothing for you to be envious of. You've got a dead-end too, only it's longer and it has plywood partitions. And Nutcracker's got a television instead of plywood. We've all got dead-ends. Only it's not obvious straightaway, it just takes a little while.",
    "[Nutscracker] Maybe that's the whole point - whether it's obvious straightaway or not. Don't you think the 'little while' it takes might just be life?",
    "[Monstradamus] Maybe so. But I'm fed up of these labyrinths you can't get lost in or escape from. And all these Minotaurs with horns on their xxx who promise to lead us out to the stars in just a moment. I wonder what Theseus will see instead of all this. I'd give a lot to find out.",
    "[Nutscracker] What do you care what he'll see?",
    "[Monstradamus] IMHO, Nutcracker, the possibility of escape is determined by whether you can see the way out or not.",
    "[Nutscracker] I already told you, for the Helmholtz that's not exactly the way it is. The Helmholtz can see anything you like. Even the plan of his own helmet. For all the good it will do him.",
    "[Monstradamus] What I wonder is, has he got a head on his shoulders or a helmet of horror? Hey, Theseus! I know you can hear me!",
    "[Nutscracker] To be honest, Monstradamus, I used to think you were Theseus.",
    "[Organizm(-:] I was convinced Monstradamus was the Minotaur.",
    "[Monstradamus] I already told you, it all depends on which part of the separator labyrinth the bubble of hope was in when it burst."
  ],
  [
    "[Nutscracker] Sartrik, that isn't a userpic. Perhaps we can call it a dialogue header. And that isn't a gaping xxx, it's a capital 'O'.",
    "[Sartrik] Monstradamus just said - right? - that everything is determined by what you see. I take that to mean that if someone can see the answer to the most important question of all, then he is Theseus. Am I right, Monstradamus?",
    "[Monstradamus] Possibly. But exactly what is the most important question of all?",
    "[Sartrik] Let me explain. Have you noticed that we never exist simultaneously, only by turns?",
    "[Monstradamus] An interesting observation. You mean the writing on the screen?",
    "[Sartrik] I mean in general. Since you didn't understand the question, I'll ask it a different way. The helmet of horror is a machine. What does it run on? What does it have instead of petrol?",
    "[Nutscracker] He's lost it, Monster. Delirium tremens. He needs a drip installed.",
    "[Monstradamus] Wait, Nutcracker. So what does it have instead of petrol?",
    "[Nutscracker] Vodka?",
    "[Sartrik] Why vodka? Do you think I'm a drunken xxx and I don't understand a thing? Instead of petrol it has Theseus.",
    "[Monstradamus] Explain that, please.",
    "[Sartrik] You remember Ariadne looking into the mirror and seeing that hat with a veil, and afterwards she realised it was the helmet of horror? The petrol that the whole deal was running on was her, get it? Everything's made out of the person who sees it. Because it can't possibly be made out of anything else. Without the person there won't be any hat or any veil, or any lilies-of-the-valley. Nothing. Get it? Theseus is the one who looks into the mirror, and the Minotaur is the one he sees, because he's wearing a helmet of horror.",
    "[Monstradamus] You mean to say the Minotaur is just an illusion?",
    "[Sartrik] If you listened to what I'm saying, then you'd know what I'm trying to say. He sees this bronze phizog with horns on it because he sees himself in the mirror through the holes. Without Theseus there is no xxx Minotaur.",
    "[Nutscracker] Did you get that, Monster?",
    "[Monstradamus] Naturally. If you put on a Batman mask and look in the mirror, you'll see Batman. But the mask will never see itself.",
    "[Sartrik] That's it. The helmet of horror is simply the reflection that Theseus sees, and that's all. But if he decides there really is a Minotaur and starts swearing blind at him and discussing the meaning of life with him, well that's when the Minotaur appears. And how! And then there's no way to get the helmet of horror off again. Get it now, you vermin? I know everything.",
    "[Nutscracker] I bet you he can see little pink Minotaurs running round the room. Now that's the kind of labyrinth I understand! And no need to bother going anywhere.",
    "[Monstradamus] And why are we vermin?",
    "[Sartrik] Because you're all nothing but bits and pieces of the helmet of horror. I figured that out ages ago. And that's the real xxx killer, when you realise that absolutely everybody - all your friends and all your enemies - are just little bits and pieces! I'm not talking about you. Meaning you're not my friends. And not my enemies. But you're bits and pieces, all right. You, Monstradamus, and you, Nutcracker - you're the horns. You'll stick out a bit too far some day. Ariadne's the labyrinth, but she's not such a bad girl, she's okay. Ugly's the past that makes me want to puke. And Organism's the future, that makes me want to puke five times worse. Who's left? Romeo and that Isolde of his? They're the double net that's cooking up the whole mess."
  ],
  [
    "[Sartrik] That you're all nothing but shadows, I'm the only one here that's alive. You're nothing but shackles on the convolutions of my brain. All your Rolls-Royces and Lolitas, Ferraris and Berlusconis, all your shaved and scented glamour, your magic wonderland TV quizzes, where you get shafted up the xxx every day underneath the money tree - you made it all out of my head! You do all that out of my head, and I'm nothing to you, but you're the entire deal for me, eh? In my xxx head! But I'll dump you all.",
    "[Nutscracker] Monster, maybe you understood some of that?",
    "[Monstradamus] I might have. But I'm not a hundred per cent certain.",
    "[Nutscracker] Translate from the Latin, will you?",
    "[Monstradamus] There's quite a profound thought here. He's trying to say the helmet of horror is the contents of the mind, which attempt to supplant the mind by proving that they - the contents - exist, and the mind in which they arise doesn't. Or that the mind is no more than its function.",
    "[Nutscracker] Who are they trying to prove it to?",
    "[Monstradamus] Themselves. Certainly not the mind. The mind, as Sartrik puts it, couldn't give a xxx.",
    "[Nutscracker] And where are they trying to prove it?",
    "[Monstradamus] What d'you mean, where? In the mind. Where else?",
    "[Nutscracker] This climb's a bit too high without a bottle. For me at least.",
    "[Sartrik] Listen, Monstradamus, you're some guy! The way you put that! I even understood it myself. Some mess, eh? If you think that thought through all the way to the end, all those English astrophysicists and the entire xxx Academy of Sciences should be thrown in the slammer!",
    "[Monstradamus] Why bother putting them away? Who cares about those buffoons.",
    "[Sartrik] Oho! You're a hard case, aren't you? Theseus, you're Theseus, no two ways about it."
  ],
  [
    "[Monstradamus] Ariadne! Good morning?",
    "[Ariadne] Good morning.",
    "[Monstradamus] Did you see the dwarf?",
    "[Ariadne] Yes.",
    "[Monstradamus] Tell me about it.",
    "[Ariadne] I was in the building on the square in front of the fountain. You remember, I told you about it. It looked dark and oppressive, as though there was a fire there a long time ago and afterwards they tried several times to fix it up, but they hadn't been able to. It was the same inside. It felt like a camouflaged smouldering ruin. I can't even say what it was that gave me the feeling. Everything was new, expensive and chic - like in those glass palaces they rent out for offices. The air was cool and clean, there wasn't the slightest smell of burning in it at all. But somehow I felt if you took the oak panels off the walls you'd see all the stonework was blackened with smoke.",
    "[Monstradamus] How did you know it was the same building?",
    "[Ariadne] I went across to the window and looked out. Down below me was the fountain with the snakes where I saw Asterisk for the first time."
  ],
  [
    "[Ariadne] What distances are there in a dream? There aren't any except the ones you dream about. I dreamed there was that inscription on the monument's forehead. I didn't dream about any distances.",
    "[Monstradamus] That's clear enough. What else did you see?"
  ],
  [
    "[Monstradamus] There is an expression 'per aspera ad astra', meaning 'through difficulties to the stars'. And so this version means...",
    "[Organizm(-:] Through xxx to the xxx.",
    "[Monstradamus] Well, that's not exactly a poetic translation. What came next, Ariadne?",
    "[Ariadne] Next I wrote a question and he wrote an answer. Why don't I type them all out together from the sheets of paper?",
    "[Monstradamus] What do you mean, 'type them out'? Have you got the sheets there?",
    "[Ariadne] Yes.",
    "[Monstradamus] How did you get hold of them?",
    "[Ariadne] I don't know. When I woke up they were lying beside the bed. Perhaps the people who tidy up the room brought them.",
    "[Monstradamus] And you didn't notice anything?",
    "[Nutscracker] Monster, you're like a man who's turned into a bull and is amazed to find he has a bell on his tail.",
    "[Monstradamus] Is that bit about the bull some kind of a hint?",
    "[Ariadne] Let me answer your questions and get something to eat, okay? Then you can talk among yourselves.",
    "[Monstradamus] Of course, Ariadne."
  ],
  [
    "[Romeo-y-Cohiba] But what did I do? You did absolutely everything yourself. The only thing I have to reproach myself with is not offering any resistance. Though that was what I really wanted to do, even before it really began to hurt.",
    "[IsoldA] How can you lie so brazenly? But then, what else can I expect from you?",
    "[Monstradamus] Pardon me for butting in, I know you can't stand it. But perhaps I could set you thinking in a new direction. On the map that Isolde saw in the park it said 'Plan of the labyrinth at Versailles'. But the telephone booth that Romeo was calling her from is located, if we can believe the plaque, in a suburb of London. Do you see what I'm driving at?",
    "[Nutscracker] I wouldn't take those signs seriously. The Versailles outside Isolde's door is about as real as Romeo's London. Ugly would say the devil has us all exactly where he wants us. And she'd be absolutely right.",
    "[Monstradamus] I wouldn't argue with that. But every dimension has its own intrinsic laws. And even if we are somewhere in the suburbs of Hell, when one person sees 'Versailles' and another sees 'London', there's good reason to assume the devil's holding them in different places.",
    "[IsoldA] What gibberish.",
    "[Romeo-y-Cohiba] That's way over the top.",
    "[Monstradamus] But really, Romeo and Isolde, what made you think you were close to each other?",
    "[Romeo-y-Cohiba] Everything around us is the same.",
    "[Nutscracker] What exactly? Bushes? Bushes are the same everywhere.",
    "[Monstradamus] Especially the word 'bushes' on two different screens.",
    "[Romeo-y-Cohiba] Even the soil under our feet is the same colour. Beige.",
    "[Monstradamus] Beige - what colour is that?",
    "[Romeo-y-Cohiba] How do you mean, what colour?",
    "[Monstradamus] Can you describe it some other way?",
    "[Romeo-y-Cohiba] Dark-brown."
  ],
  [
    "[Organizm(-:] Julistan - it sounds like the name of some small but highly malevolent state located at the very centre of the axis of evil.",
    "[Ariadne] By the way, I've seen that word - Julistan.",
    "[Monstradamus] Where?",
    "[Ariadne] In that place where I was asking the dwarf questions. The archive.",
    "[Monstradamus] You didn't say anything about that.",
    "[Ariadne] When the dwarf ran off, I was left in the archive alone. At first I went on sitting at the table, waiting for him to come back. But he was gone for ages and ages. Then I got up and went over to look at the shelves of files along the walls. There were all sorts of different things on them. Depositions from the Minotaur's defeated enemies. Interrogations of Minotaurs by other Minotaurs. An entire shelf full of records of cross-examinations of Minotaurs by themselves - they were called 'Alone Together'. They must have been thinking of the horns, right? But the biggest number of files was filled with answers to the so-called eternal questions like the ones you and I were asking. They were all old and yellow with age and covered in dust. Do you know what paper covered with writing smells like when the people who wrote on it are already dead?",
    "[Monstradamus] Do you remember anything?",
    "[Ariadne] I have a whole pile of pages here from various files. When I woke up they were lying beside the dwarf 's answers. There's not much new in them. The eternal questions haven't got any cleverer - that's why they're eternal.",
    "[Monstradamus] Read us something.",
    "[Ariadne] Question: 'Why does the existent exist?' Answer: 'To pass the time more pleasantly.' Question: 'Why heap up so many events and beings to pass the time if in any case nowhere exists except in the helmet of horror?' Answer: 'Events and beings also cannot be accumulated anywhere except in the helmet of horror, so Mesdames et Messieurs are requested not to be concerned.' What's next... About the separator labyrinth... 'But who...' Right, that's it: 'Who else is produced there?' A couple of pages from some review of historical chronicles. An analysis of contradictions. One text says the Minotaur himself is the builder of the labyrinth. Another claims the labyrinth was built by eighteen thousand Minotaurs divided into two columns. A third claims these columns should be understood metaphorically and the labyrinth is created by the two mental nodules or hemispheres, which are symbolised by the two horns. And so on. And here at the end there are a few pages about this Julistan. They look quite different, really ancient and faded. Many of them are so old I can hardly make anything out. Covered with strange, beautiful handwriting. They're translations of inscriptions from the Julistan caves. The actual inscriptions were destroyed long ago, together with the caves themselves, and all that's left are copies of copies. Fragmentary translations. Some are short and incoherent, some are a bit longer. Shall I read some?",
    "[Monstradamus] Certainly.",
    "[Ariadne] 'One may begin with whatever one likes, without worrying about it at all...'",
    "[Monstradamus] Begin what?",
    "[Ariadne] You seem to be worrying about it already."
  ],
  [
    "[Monstradamus] What's that sound? Can anyone else hear it?",
    "[IsoldA] I can hear it too. It's terrifying."
  ],
  [
    "[Nutscracker] What's happening? Help! I think that idiot Romeo...",
    "[Monstradamus] What's going on? What's that rumbling sound?",
    "[Organizm(-:] The door's giving way."
  ],
  [
    "[Ariadne] My door's getting hot. Are yours?",
    "[Nutscracker] I'm stifling. Something...",
    "[Monstradamus] It's him!",
    "[Theseus] MINOTAURUS!"
  ],
  [
    "[IsoldA] What, don't you understand? It's Theseus!",
    "[Romeo-y-Cohiba] Theseus! How we've longed for you to come!",
    "[Monstradamus] Theseus. At last. Where are you? What do you see around you?",
    "[Organizm(-:] Theseus, answer!",
    "[Nutscracker] Stop it. It's pointless.",
    "[Monstradamus] Has he really gone?",
    "[Nutscracker] Yes."
  ],
  [
    "[Organizm(-:] Why don't we look for him? Maybe he still believes?",
    "[Monstradamus] In what?",
    "[Organizm(-:] That he has a body. And it's in a room.",
    "[Ariadne] He never did believe in that."
  ],
  [
    "[UGLI 666] This time it was Ariadne who blurted everything out. That's why he gave us the slip.",
    "[Monstradamus] What do you suggest?",
    "[UGLI 666] Not to tell him anything."
  ],
  [
    "[Monstradamus] That's right, any route. But it seems like a very long time since anyone walked round your route, Ugly.",
    "[Sartrik] What... What route is that?",
    "[Monstradamus] Back with us again, hero? Ladies and gents, a joke. Imagine Sartrik wakes up with a massive hangover. He can't remember anything about the previous day. There's a pool of blood beside him. He's surrounded by a labyrinth. But there's no Minotaur anywhere. Sartrik raises his eyes to the ceiling and whispers in horror: 'I killed him... Killed him and ate him...'",
    "[IsoldA] What's funny about that? That's exactly how it happened."
  ],
  [
    "[Sartrik] You always blame everything on Sartrik.",
    "[IsoldA] You should be xxx to xxx. Why did you butt in? What for? Lousy drunk.",
    "[Monstradamus] But how did he actually find out the Name?",
    "[UGLI 666] Ariadne gave away the whole thing to him in so many words.",
    "[Nutscracker] Then why hasn't he dissolved the lot of us if he knows the Name?",
    "[Monstradamus] He has. It just seems to us in here that he's dissolved himself."
  ],
  [
    "[Nutscracker] Don't be such a Cassandra.",
    "[Organizm(-:] What are we going to do here now?",
    "[Monstradamus] What are we going to do? Carry on with the discourse.",
    "[Nutscracker] I know that. But in what capacity?",
    "[Monstradamus] You've only got the capacity for doing one thing, Nutcracker. Staring into that screen, like Pavlov's bitch gazing into Tarkovsky's mirror."
  ],
  [
    "[UGLI 666] We always were, heh-heh. That human stuff was nothing but a nuisance. And all that bovine stuff too.",
    "[Organizm(-:] We'll be a dragon. We'll fly up to the clouds and dive down to the bottom of the sea. Maybe now things really will be easier.",
    "[Monstradamus] Easier? But we've got Sartrik stuck right in the middle of us. Now we'll feel like puking all the time. Constantly. No matter how deep we dive, no matter who we pretend to be. Even Lolita, even a Rolls-Royce."
  ],
  [
    "[Sartrik] And my stomach's rumbling, xxx. Listen, Monstradamus. There's one thing I still don't get. Where did all this happen?",
    "[Monstradamus] Are you really that stupid or can you just not sober up? In the helmet of horror.",
    "[Sartrik] Oh. And who to?",
    "[Monstradamus] You."
  ]
]