[
  [
    "[Organizm(-:] What's going on? Is there anyone there...?",
    "[Romeo-y-Cohiba] I'm here.",
    "[Organizm(-:] So what's going on round here?",
    "[Romeo-y-Cohiba] Your guess is as good as mine.",
    "[Organizm(-:] Ariadne, are you there?",
    "[Romeo-y-Cohiba] Who's she?",
    "[Organizm(-:] She started this thread. Seems this isn't the Internet, just looks like it. You can't link to anywhere else from here.",
    "[Romeo-y-Cohiba] xxx",
    "[Organizm(-:] Hello! If anyone can read this, please answer.",
    "[Nutscracker] I can read it.",
    "[Organizm(-:] Who posted the first message?",
    "[Nutscracker] It's been up on the board a long time."
  ],
  [
    "[Organizm(-:] Attention, roll-call. There's just Nutcracker, Romeo and me here, is that right?",
    "[Romeo-y-Cohiba] That's right.",
    "[Nutscracker] At least, we're the only ones who want to join in."
  ],
  [
    "[Nutscracker] But where is here exactly?",
    "[Organizm(-:] How do you mean?",
    "[Nutscracker] Quite literally. Can you describe where you are now? What is it - a room, a hall, a house? A hole in someone's xxx?",
    "[Romeo-y-Cohiba] Well I'm in a room, anyway. Or a cell, I can't tell which is more correct. Not very big. Green walls, white ceiling lamp. A bed by one wall and by the opposite wall a desk with the keyboard I'm typing on right now. The keyboard is attached rigidly to the desk. Above the desk there's an LCD screen set in the wall behind thick glass. That's where all these letters appear. It's impossible to break, I tried already. The room has two doors, one made of strange, blackish-green metal. It's locked. There's a raised section in the middle of it. The other door's made of wood, painted white, and it leads into a bathroom. It's open.",
    "[Organizm(-:] I've got the same as Romeo. A locked metal door with some kind of relief design on it. A hotel-style bathroom with soap, shower gel and shampoo on the shelf under the mirror. Everything in packaging marked with a strange symbol - something like a little cogwheel. So where are you, Nutcracker?",
    "[Nutscracker] In the same kind of room. I think the door's made of cast bronze. But Organism, the symbol on the soap looks more like a star than a cogwheel. In fact it looks like the symbol they use in books for a footnote. It's even on the loo paper, every sheet.",
    "[Romeo-y-Cohiba] So we're all in the same hotel. Let's try knocking on the walls. Can you hear anything?",
    "[Organizm(-:] No.",
    "[Nutscracker] Me neither.",
    "[Organizm(-:] I'll try knocking on the door, listen.",
    "[Romeo-y-Cohiba] I can't hear a thing.",
    "[Organizm(-:] So how did we get here?",
    "[Romeo-y-Cohiba] Personally speaking, I haven't got the slightest idea. How about you, Organism?",
    "[Organizm(-:] I just woke up here wearing this pooftah's housecoat with nothing underneath it.",
    "[Nutscracker] It's not a housecoat. It's a chiton - the kind of tunic the ancient Greeks used to wear, so I won't take issue with your opinion of it. I don't think they wore any underclothes either.",
    "[Romeo-y-Cohiba] It's a good job it's warm in here then.",
    "[Organizm(-:] So, maybe you remember how you got here, Nutcracker?",
    "[Nutscracker] No, I don't."
  ],
  [
    "[Romeo-y-Cohiba] I suppose that depends whose you compare it with. And anyway, it wasn't me who invented the name. It just appears on the screen when I send a message. I'm not Romeo, I'm xxx. A professional xxx, if anyone's interested.",
    "[Organizm(-:] Porn business? Socially significant work. You and I are almost colleagues, Romeo - I'm a xxx. I used to work at xxx.com, so I'm temporarily out of a job. But there's not much danger of that for you.",
    "[Romeo-y-Cohiba] How did the porn business get mixed up in all this? And what are all these x's?",
    "[Nutscracker] That's not the first time they've appeared. It's the censor. Someone's monitoring our conversation. And he doesn't like it when we try to exchange information about who we really are. Or start swearing."
  ],
  [
    "[Romeo-y-Cohiba] There's a xxx embassy everywhere.",
    "[Nutscracker] Are you sure? What if we're in xxx?",
    "[Organizm(-:] Apparently you guys can understand each other without words. But I don't understand what the xxx embassy is, and where xxx is, if there's no xxx embassy there. And what the xxx you want it for anyway.",
    "[Monstradamus] Hi there, is it okay if I join in your discussion?",
    "[Organizm(-:] Who are you, Monstradamus?",
    "[Monstradamus] xxx. I live in xxx and I'm a xxx."
  ],
  [
    "[Nutscracker] So now we are four. That's nice.",
    "[Organizm(-:] What's so nice about it?",
    "[Nutscracker] Maybe more will turn up soon. The more heads we have, the better our chances of coming up with something.",
    "[Organizm(-:] And what if we've simply died?",
    "[Nutscracker] Don't panic! Dead people don't hang around in chat rooms.",
    "[Organizm(-:] We don't know that for a fact. Maybe that's all they can do.",
    "[Romeo-y-Cohiba] If this is the afterlife, then I for one am disappointed.",
    "[Nutscracker] Let's discuss the situation. I suggest we don't take Organism's hypothesis about the afterlife into consideration.",
    "[Organizm(-:] Then maybe it's a dream?",
    "[Romeo-y-Cohiba] Pinch yourself. Maybe you'll wake up. I tried already, it didn't work.",
    "[Nutscracker] Right, so everybody has a bronze door. Let's try figuring out the design on that door. It's a figure like a rectangle with the upper and lower edges bent inwards and the sides bent outwards.",
    "[Organizm(-:] It looks like a bat. Or the Batman symbol.",
    "[Romeo-y-Cohiba] I reckon it's a double-headed axe.",
    "[Organizm(-:] Maybe it's just decoration, without any meaning. But Romeo saying it looks like an axe has made me think so too. The fascists used to have axes like that - or was it the ancient Romans?",
    "[Monstradamus] If it is an axe, it's much older than Rome. They used to have axes like that in Crete and ancient Egypt.",
    "[Organizm(-:] Are you a historian then, Monstradamus?",
    "[Monstradamus] No. I'm a xxx.",
    "[Organizm(-:] Hey, that's right. I forgot.",
    "[Ariadne] Hi. I'm glad I'm not the only one here.",
    "[Organizm(-:] Hi there, darling."
  ],
  [
    "[Monstradamus] Who are you and how did you get here?",
    "[Ariadne] I'm in exactly the same situation as you.",
    "[Organizm(-:] In that case, we know all about you already. Your real name's xxx, you're xxx years old and you come from xxx."
  ],
  [
    "[Organizm(-:] Hey, who is this Isolde? Someone new?",
    "[IsoldA] Yes.",
    "[Romeo-y-Cohiba] Welcome to our little world, Isolde. We're very pleased to meet you.",
    "[IsoldA] Thank you, Romeo.",
    "[Organizm(-:] Are you pretty?",
    "[Romeo-y-Cohiba] Get a grip, Organism."
  ],
  [
    "[Nutscracker] So does anyone have any ideas?",
    "[Organizm(-:] I don't get it, are we seriously discussing someone's dream?"
  ],
  [
    "[Romeo-y-Cohiba] And what were we locked up for?",
    "[UGLI 666] Each of us for his own reason. For it is said: 'There is no man that shall live without sin, though his life be but a single day.'",
    "[Organizm(-:] Ugly, what sex are you?",
    "[UGLI 666] That's of no relevance.",
    "[Organizm(-:] Is he/she really serious?",
    "[Monstradamus] I think he/she means what he/she says.",
    "[UGLI 666] I'm female, since it interests you so very much. My name's xxx, I'm a xxx by profession and a xxx by education, but by vocation I've always been a xxx. I've read everything already. And I have nothing interesting to add. As for whether I'm being serious or not, you can be quite sure I always mean what I say.",
    "[Organizm(-:] Tell me, Ugly, did you invent your views to match your name or was your name invented to match your views?",
    "[UGLI 666] My name's for my sins. And so is yours.",
    "[Organizm(-:] But do you know what 'UGLI' really means? It's not from the word 'ugly' as you probably thought. It's 'Universal Gate for Logic Implementation'. A universal logic element, I remember that from school. So if you chose your views to match your name you were looking in the wrong place altogether.",
    "[Monstradamus] We were talking about Ariadne's dream. It has been suggested that she was shown it specially and it contains information for everyone.",
    "[Romeo-y-Cohiba] What does that mean - shown it specially? This isn't a cinema. And if the information's for everyone, then why was it shown to Ariadne?",
    "[Organizm(-:] You'll get a showing too, don't be in such a hurry."
  ],
  [
    "[Monstradamus] What does 'interpreted scientifically' mean?",
    "[Romeo-y-Cohiba] Well, for instance, this Asterisk is tall, with a big helmet. That symbolises the male sexual organ in a state of erection.",
    "[Organizm(-:] And the two dwarves symbolise the balls, do they?",
    "[Nutscracker] Cool it, Romeo. Sometimes a cochiba's just a cigar."
  ],
  [
    "[IsoldA] Could you talk about that separately somehow?",
    "[UGLI 666] I second that motion.",
    "[Organizm(-:] Unfortunately we can't just go out into the corridor."
  ],
  [
    "[Monstradamus] 'Starry' in Latin. Asterius, the son of Minos and Parsiphae. The half-man, half-animal from Crete. Better known as the Minotaur.",
    "[Sartrik] That one on the 'Remy Martin' bottle?",
    "[Organizm(-:] No, the 'Remy Martin' beast is a Cyclops. The Minotaur is a freak with a bull's head."
  ],
  [
    "[Nutscracker] Monster's right. There's definitely humour in all of this, only it's infernal humour. Forcing serious people like us to call each other by idiotic names. Dressing us in ancient Greek chitons and making us sit at these screens. And then the Internet we end up in has about as much to do with the real one as we do with Ancient Greece.",
    "[Organizm(-:] It's not really all that different. The screen design is an imitation of the 'Guardian' site. The heading is the same - 'Guardian Unlimited'. And the chat area looks the same. The difference is there are hundreds of threads there. But we've only got one.",
    "[Monstradamus] The name makes sense though. Our guardian really is unlimited.",
    "[Nutscracker] And another joke is the Merrill Lynch symbol on the flag.",
    "[Organizm(-:] But Ariadne saw the flag in a dream, so it's not clear whose joke it is. Our moderators' or hers.",
    "[Monstradamus] I wouldn't like to alarm anyone, but shouldn't we consider the possibility that Ariadne herself is also a joke by our moderators, as Organism called them.",
    "[Organizm(-:] Why's that?",
    "[Monstradamus] Because, phenomenologically speaking, she only exists in the form of messages of unknown origin signed 'Ariadne'.",
    "[Ariadne] Thanks. Ariadne.",
    "[Monstradamus] Ariadne, please don't take offence. I'm talking about a hypothetical possibility. It doesn't mean I suspect you of anything. The same thing could apply to any of us.",
    "[Organizm(-:] What does 'phenomenologically' mean?",
    "[Monstradamus] It's the way you can see these words now."
  ],
  [
    "[Organizm(-:] You know what I think? Either no one's noticed it or everyone has, but no one's saying.",
    "[Romeo-y-Cohiba] What's that, then?",
    "[Organizm(-:] We don't post our messages complete, like in a normal chat room. The words appear on the screen one letter at a time, in real time. We can even interrupt each other, and then three dots appear at the end of the phrase that's interrupted.",
    "[Nutscracker] Everyone's noticed that.",
    "[Organizm(-:] But at the same time, as far as I can tell, no one's made a single spelling mistake yet. Not a single typing error. Doesn't that seem a bit strange?",
    "[Monstradamus] That's richt.",
    "[Nutscracker] They cantroll our entire canvasation."
  ],
  [
    "[IsoldA] Have they really stopped?",
    "[Organizm(-:] Good for you, Romeo! They did what you told them to. Why not try telling our moderators to do something else?",
    "[Romeo-y-Cohiba] Stick your xxx up your xxx and give it a double right twist."
  ],
  [
    "[Organizm(-:] What Theseus?",
    "[Nutscracker] The one who killed the Minotaur, Organism. Or who has to kill him."
  ],
  [
    "[Ariadne] Perhaps Theseus is one of us?",
    "[Nutscracker] Perhaps the Minotaur is one of us.",
    "[Organizm(-:] I bet a hundred xxx the Minotaur's Monstradamus.",
    "[Monstradamus] Stop clowning about.",
    "[Organizm(-:] Theseus, answer us!",
    "[IsoldA] At least tell us if you're here or not! Theseus!"
  ],
  [
    "[Organizm(-:] We can find out.",
    "[Romeo-y-Cohiba] You be careful, or the door might really go ahead and open."
  ],
  [
    "[Organizm(-:] An experiment. Doors, open!",
    "[UGLI 666] Lord have mercy!",
    "[Romeo-y-Cohiba] I warned you!",
    "[Ariadne] Did it happen in all the rooms?"
  ],
  [
    "[Nutscracker] Did everyone hear the trumpets?",
    "[Ariadne] Do you think they were trumpets?",
    "[Organizm(-:] Doors, close!",
    "[Nutscracker] xxx be praised.",
    "[Monstradamus] Organizm, don't go trying any more experiments like that.",
    "[Romeo-y-Cohiba] Now how's Isolde going to get back? Doors, open!",
    "[Nutscracker] xxx, eh? Again!",
    "[Monstradamus] Let's just keep calm and get our bearings.",
    "[Organizm(-:] Okay, I think I've got it. When the door opens, a lever shaped like a leg with a hoof moves out and down.",
    "[UGLI 666] Lord save us and keep us!"
  ],
  [
    "[Romeo-y-Cohiba] Fresh air at last.",
    "[Sartrik] Two fridges full of booze. Minotaur just a great guy after all!",
    "[Organizm(-:] Plywood walls painted to look like bricks. It all looks pretty naff.",
    "[Nutscracker] I've got a load of electronic equipment.",
    "[Organizm(-:] I'm hungry. Hey, you moderators, how's about a bit of nosh down here? Right... I think I've got it. You have to turn this thingy that way, and then that thingy this way... Now we're talking.",
    "[Monstradamus] What?",
    "[Romeo-y-Cohiba] What was it you turned, tell us.",
    "[Organizm(-:] They sent down some pancakes with jam. Not bad for Ancient Greece. I feel like a nice quiet meal, so I'm taking a break now.",
    "[Romeo-y-Cohiba] Enjoy your meal. Just tell us what it was you turned.",
    "[Organizm(-:] When I'm feeding my tum, I go all deaf and dumb.",
    "[Ariadne] Organism, you only need to type two words! Then you can go ahead and eat in peace.",
    "[Nutscracker] Organism, we're all asking you.",
    "[Organizm(-:] I'm busy.",
    "[UGLI 666] I never understood before why gluttony is a sin. Then a spiritual friend of mine explained. Gluttony is not so very terrible in itself. But it's a sign of a base soul. The same thing applies to debauchery. The soul doesn't become debased through committing these acts. A base soul manifests itself through them.",
    "[Romeo-y-Cohiba] No, you won't get under his skin that easily.",
    "[Monstradamus] Moderators! Give us all something to eat!"
  ],
  [
    "[Ariadne] I think they're in love.",
    "[Monstradamus] According to their names they have to be. Imagine being called Romeo. What else could you do?",
    "[Organizm(-:] Take a pack of condoms and go looking for your Juliet.",
    "[Nutscracker] Or take a pump-action shotgun and go looking for your Shakespeare."
  ],
  [
    "[Monstradamus] And nothing unusual?",
    "[Ariadne] I was wearing a straw hat with a round crown and two little bunches of lilies-of-the-valley pinned to the brim at the back. The hat had a veil of thick lace with round holes, so I couldn't see my face behind it at all. It all looked very beautiful, but something made me feel nervous. I couldn't work out what was wrong until suddenly I recognised that bronze mask in my reflection and that frightened me, and then the dream suddenly ended. That's all. I'm going.",
    "[Organizm(-:] I thought from the very beginning that goon must be wearing a virtual reality helmet. Honest I did.",
    "[Nutscracker] That's not any kind of virtual reality helmet; it's some kind of fancy pressure cooker. Games for children. I ought to know how a virtual reality helmet works when grown-ups put one together, and this is nothing like it.",
    "[Organizm(-:] And how does it work?",
    "[Nutscracker] Maybe I don't understand too well which way the current flows and what it's transformed into and all, but I do know perfectly well what someone in one of those helmets sees and thinks, because I've dealt with it as a professional, by studying the problem of choice in an interactive environment. We worked with those helmets all the time.",
    "[Organizm(-:] I've never heard of that problem. What is it?",
    "[Nutscracker] Well, imagine you decide for yourself who's going to shoot who when you're watching an action movie. If you decide the main hero gets killed in the first shootout, then what happens to the rest of the plot? If you had genuinely free choice, the results could be pretty miserable. But art is supposed to make us happy, not miserable.",
    "[Monstradamus] That's for sure. And even when it does make us miserable, we should feel happy in our misery."
  ],
  [
    "[UGLI 666] What's that?",
    "[Nutscracker] That's a long story.",
    "[Organizm(-:] We don't have much else to occupy ourselves with.",
    "[Monstradamus] That's right. Tell us about it, Nutcracker. Let's give our brains a break.",
    "[Nutscracker] I suppose there's no need to explain what the Helmholtz sees?",
    "[Organizm(-:] Who?",
    "[Nutscracker] In professional jargon that's what they call the guy in the helmet. A Helmholtz is someone who's located in an artificial dimension that totally isolates him from the real world and moves around in it, or rather, thinks he moves around in it.",
    "[Organizm(-:] Three identical marble vases. Hardly makes it worth bothering to put the helmet on.",
    "[Nutscracker] Instead of vases they could be doors, turns at a road junction, any kind of choice at all in fact. It's not important. Everything you see in the helmet is computed by a special program and the program can be set up so that, every time, the Helmholtz makes the same choice we made for him earlier.",
    "[Organizm(-:] Sure, you can fix the program, but not the experimental subject. He's got his own programming.",
    "[Nutscracker] That's the whole point. When the helmet and the Helmholtz fuse into a single whole, you can edit the reader as well as the book, if you get my meaning. That's why we say editing technology can be external or internal. Although there's no clear boundary between them, of course.",
    "[Organizm(-:] Come again?",
    "[Nutscracker] External technologies affect what we see, internal technologies affect what we think.",
    "[Organizm(-:] How about an example?",
    "[Nutscracker] The simplest external editing program is 'Sticky Eye'. That's when, as you turn your head, one of the vases gets stuck in the field of vision and lingers there longer than it should."
  ],
  [
    "[Organizm(-:] A mathematical weight. That's beautiful.",
    "[Nutscracker] The next technology up is 'Pavlov's Bitch'. That's an intermediate conditioned reflex editor.",
    "[Organizm(-:] So it's named after that Russian scientist who noticed his stomach juices started flowing when the phone rang?",
    "[UGLI 666] No he didn't. He just studied conditioned reflexes in dogs."
  ],
  [
    "[Nutscracker] We want you to notice it straightaway, draw the right conclusion and look in the right direction in future. It's a cheap technology for third-world countries. But if the budget's big enough, then for instance we can use infrasonics. The Helmholtz won't notice anything, but he'll experience a dark, mysterious horror when he turns towards any vase except the one we want. The obverse method is stimulation of the pleasure centre when the correct choice is made. They used to insert an electrode, but now it's done by pharmacological means or by entraining the brain to delta rhythms.",
    "[Organizm(-:] You don't say. Are you telling me they'll be doing all that stuff to us if we watch interactive movies?",
    "[Nutscracker] I don't think so. These techniques weren't developed for the movies, not even for virtual spaces. They were just modelled there. The topic is not in the public domain. But since you and I aren't in the public domain either, I suppose it's okay for me to tell you about it.",
    "[Organizm(-:] So what are the internal editing programs like?",
    "[Nutscracker] Well, for instance, take 'Sunny Kiss'. The vase we have to choose is endowed with positive emotional coloration by employing universally accepted aesthetic codes, given a positive inner content, if you like."
  ],
  [
    "[Organizm(-:] Fair enough. What else?",
    "[Nutscracker] There's another technology called 'The Seventh Seal'. The vase that has to be chosen is marked out using secret signs that attract interest or stimulate the imagination. It can be absolutely anything - a hand print on its surface, arrows pointing to it on the ground, a dove sitting on its edge, mysterious graffiti, and so on and so forth. The obverse method is 'The Le Pen Club'. That's when the vases we wish to exclude are covered in the crudest obscenities you can imagine, preferably not even in paint, but xxx. Virtual, of course.",
    "[Organizm(-:] And you mean the Helmholtz won't notice anything?",
    "[Nutscracker] Used on its own, any one of the techniques used is easy enough to spot. But if the methods are combined together in a subtle fashion and always applied in rotation at a level of intensity just on the border line of perception, you get practically a hundred per cent precise manipulation combined with total imperceptibility.",
    "[Organizm(-:] I get it. It's like what you see at the railway stations in Asia. When a passenger thinks it's the tumbler-gambler who's going to cheat him but actually everyone playing the game is in on the swindle even though they're arguing with each other all the time, maybe even fighting.",
    "[Nutscracker] Exactly. Only in our case absolutely everybody in the station is in on it, including the stone Atlantes by the main entrance."
  ],
  [
    "[Nutscracker] In the real world you see what's in front of your eyes. No matter which way you point your rump. But in this world you see what's in front of your eyes, no matter which way you point your head. As we used to say in the xxx, it's chalk and cheese, even though it sounds pretty much the same. You don't have any independent system of coordinates, and we decide everything you see. So you can't even suspect anything. For you even the world isn't what it really is, but what's shown to you. You feel like you're looking around in a natural manner, but in fact all the time your eyes keep stumbling over our candidate - sorry, I mean our vase - and it gives you this light and happy feeling. But you never think to ask why, the same way no one ever asks why it's a sunny day.",
    "[Organizm(-:] An interesting slip of the tongue.",
    "[Nutscracker] And if the mark turns his head too rapidly, so that 'Sticky Eye' and 'Sunny Kiss' stop working, then 'Doom and Gloom' and 'The Weight' kick in immediately.",
    "[Organizm(-:] Well, Nutcracker, so now I understand what you do for a living. Tell me, as a professional, do you reckon they could be influencing us in some similar kind of way in here?",
    "[Nutscracker] I'd have to think about that.",
    "[UGLI 666] I noticed a long time ago that conspiracy theory has taken the place of religion for atheists. They always think there's someone manipulating them, hypnotising them, zombifying them, bugging them, trailing them. But that someone is simply the devil, and that's all. The fact is, it's only a short step from atheism to schizophrenia, and in most cases it's already been taken. What about you, Organism? Do you feel like someone's manipulating you?",
    "[Organizm(-:] To be honest, I do.",
    "[UGLI 666] What kind of manipulation is it?",
    "[Organizm(-:] Being locked in here, for instance. Or being fed pancakes for the second day running.",
    "[UGLI 666] Ah, in that sense. But that's not manipulation, that's God's punishment.",
    "[Organizm(-:] Ugly, let me explain to you how we're manipulated in here. Let's assume that headgear on Asterisk's head is a virtual reality helmet after all.",
    "[UGLI 666] And then what?",
    "[Organizm(-:] Perhaps everything we see here is something like that flat area Nutcracker was talking about - with the three identical vases, except one of them is more identical than the others.",
    "[Nutscracker] For us to be manipulated like that, we'd have to be wearing helmets.",
    "[Organizm(-:] Maybe we are.",
    "[Nutscracker] Touch your face with your hands. Can you feel any helmet?",
    "[Organizm(-:] No, but...",
    "[Monstradamus] I know what he's going to ask now. He's going to ask whether you can use a helmet to simulate what you feel with your hands.",
    "[Organizm(-:] Well that's right. It seems a natural enough question to me.",
    "[Nutscracker] If everything is simulated by the helmet, then it's not a helmet or a simulation any more. It's life.",
    "[Organizm(-:] Nutcracker, there's one thing you didn't explain. Who switches on all these 'Sticky Eyes' and 'Sunny Kisses'? Surely someone has to control it all?",
    "[Nutscracker] Certainly. There's an operator with a special monitor. He sees the Helmholtz as a dot on a radar screen. And the vases would be, say, red rhomboids. There's a manipulation menu on the same screen. The rest is all just like in Windows - click and drag.",
    "[Monstradamus] Click and drag. A great slogan for a double-edged axe.",
    "[Organizm(-:] And how can you do it the other way round?",
    "[Nutscracker] How do you mean?",
    "[Organizm(-:] So the virtual reality helmet is on the operator who controls the manipulation. And this operator somehow makes the others see what he sees.",
    "[Nutscracker] How could he make them do that?",
    "[Organizm(-:] Hypnosis.",
    "[UGLI 666] There you are. I was just waiting for that word.",
    "[Nutscracker] I don't know much about hypnosis. But if a hypnotist was powerful enough to make others see what he sees, why would he need a helmet?",
    "[Organizm(-:] In order to know what the others have to see.",
    "[Monstradamus] You could take it even further. Not just seeing, but actually being there."
  ],
  [
    "[Nutscracker] Then where's the Minotaur?",
    "[Monstradamus] We have to assume he's in the space that Ariadne sees in her dreams.",
    "[Organizm(-:] End of the line. Remember, Nutcracker, at the very beginning you asked me 'Where is here exactly?' I didn't understand your question at first. In the helmet of horror, that's where!",
    "[Nutscracker] That doesn't fit, though. On the one hand, the Minotaur's manipulating all of us, but on the other hand, he's got no head... But then again, quite apart from this particular case, I can testify professionally that's what causes all the problems.",
    "[Organizm(-:] Absolutely. This Asterisk has a cheap kettle with a solar battery in his helmet. How can he decide where to use 'Sunny Kiss' and where to use 'The Seventh Seal'?",
    "[Monstradamus] Automatically. It might all depend on which section of the helmet of horror a bubble of hope happens to burst in.",
    "[Organizm(-:] But I'm the one who sees the ray of sunlight or the dove, not Asterisk. I don't understand anything any more. Who's wearing the helmet of horror? Me or the Minotaur?",
    "[Nutscracker] The Helmholtz.",
    "[Monstradamus] We've been talking about that helmet too long already. It feels like we keep trying it on over and over again. It will attach itself permanently to our heads soon. Let's change the subject.",
    "[Organizm(-:] Great idea, let's. I've just had a thought. Has anyone ever wondered why Star Wars has such a strange sequel - instead of filming what came after the third episode, they filmed what came before the first one?",
    "[Monstradamus] Why?",
    "[Organizm(-:] At the end of the third episode Darth Vader dies, and that's the end of all the Star Wars. There can't be any more, because he's the Minotaur of that world, and that black heap of junk on his head is the helmet of horror. He thinks every one of them: Luke Skywalker, the robots, Chewbacca and all the rest of it. So after he's killed there can't be any continuation.",
    "[Monstradamus] But Darth Vader takes his helmet off before he dies. And underneath he has a normal head, only covered in scars.",
    "[Organizm(-:] Yes, but it's just a fantasy, after all.",
    "[Nutscracker] Yes, Organism. Very profound..."
  ],
  [
    "[Organizm(-:] Who wants to chat?",
    "[Ariadne] I do.",
    "[Nutscracker] And I do.",
    "[Monstradamus] And I do I suppose.",
    "[Organizm(-:] An interesting team. Monstradamus, Ariadne, me and Nutcracker. Has anyone noticed that the four of us have something in common?",
    "[Nutscracker] It would be hard not to notice. We all use toilet paper with a little star on it.",
    "[Monstradamus] And we share a great passion for life.",
    "[Organizm(-:] That's not all, though.",
    "[Nutscracker] We've all been fed garbage just recently as well. Did everyone get that putrid lasagne yesterday? And how did you like today's vegetarian beefsteak, rare and bloody?",
    "[Organizm(-:] That's not it either.",
    "[Monstradamus] I know what he means. None of us has said anything about our labyrinths.",
    "[Ariadne] Really? It's just that no one's asked me."
  ],
  [
    "[Ariadne] Probably like bats, on a coral perch. And they have special gold hooks on their slippers.",
    "[Monstradamus] Perhaps. Only they hang head-up, because they aren't attracted by the earth's gravity, only by the love of the Lord. Like Ugly said. Angels are non-material beings.",
    "[Organizm(-:] Then how did they manage to choose wives for themselves from among the daughters of man and beget children?",
    "[Nutscracker] Ugly probably knows about that. Or she can check with some of her friends."
  ],
  [
    "[Ariadne] All right, I'll ask.",
    "[Organizm(-:] I have a question - why is the helmet of horror called that?",
    "[Ariadne] All right. I'll be going then."
  ],
  [
    "[Nutscracker] He must be busy with his booze now.",
    "[Monstradamus] Then tell me about your labyrinth. Or Organism can tell us about his.",
    "[Organizm(-:] I haven't got anything interesting. Just a screen-saver.",
    "[Monstradamus] What?",
    "[Organizm(-:] In Windows there's a screen-saver called 'maze'. And I've got a model of it here. Built out of planks instead of pixels. It's the only time I can ever recall software being turned into hardware.",
    "[Monstradamus] Did anyone understand that?",
    "[Nutscracker] I know what he's talking about. It's a kind of program."
  ],
  [
    "[UGLI 666] Nutcracker, you're always trying to turn any conversation into a farting match. I must say sometimes you manage it.",
    "[Monstradamus] Stop it will you, you're like little children. Let's just drop it. Why don't you tell us about this screen-saver, Organism?",
    "[Organizm(-:] It's a standard program. If you don't touch the keyboard for a few minutes, a labyrinth with red-brick walls appears on the screen, with a camera moving through it. It has all sorts of bells and whistles, like stones that turn everything upside down when you bump into them. The ceiling becomes the floor, the floor becomes the ceiling, and the camera starts turning in the opposite direction at the forks in the path. There's a big rat in the labyrinth too. I've actually got two screen-savers like that. The first one appears on the screen when I forget about you lot for a long time. And the second is right outside my door, constructed fairly accurately out of plywood and planks. It even has a rat in it - a kind of little mat with a plush face and paws sewn on to it. Sometimes the rat is lying in the passage. Sometimes it's glued to the ceiling. There are tumble-stones too, blocks of grey plastic. Only they don't turn anything upside down. If you touch one of them, the maze freezes.",
    "[Nutscracker] What do you mean, it freezes?",
    "[Organizm(-:] That's what I call it, like a computer program. What happens is, the light goes out and a panel lights up above the tumble-stone: 'This program has performed an illegal operation and will be shut down. If the problem persists, contact the program vendor.'",
    "[Nutscracker] Then what happens?",
    "[Organizm(-:] I have to go home in the dark. And that's a bit of a drag, because the voices start to get on my nerves.",
    "[Nutscracker] What voices?",
    "[Organizm(-:] All kinds. Quiet and loud. Women, men, even children. Sometimes far away. Sometimes close up.",
    "[Nutscracker] So what do these voices say?",
    "[Organizm(-:] Always the same thing: 'I am the vendor, I am the vendor. What will you do? What can you do?'",
    "[Nutscracker] Yes, you've been screwed all right. And doesn't Bull Gates ever get in touch?",
    "[Organizm(-:] No, he doesn't.",
    "[Nutscracker] Maybe he does, but you just don't understand. Maybe the Minotaur's actually the dead rat on the ceiling.",
    "[Organizm(-:] Maybe. Anyway, if you don't touch these stones, and avoid doing a couple of other things, you can walk right round the labyrinth without any bother. And then you realise fairly quickly it's not a real labyrinth at all, just a big concrete cellar with plywood partitions.",
    "[Nutscracker] Have you tried breaking down the partitions?",
    "[Organizm(-:] If you shift them even slightly, the whole thing freezes instantly. Then you have to find your way out in the dark and listen to those voices. It's better not to touch anything.",
    "[Nutscracker] Have you reached the centre then?",
    "[Organizm(-:] Yes, I have.",
    "[Nutscracker] And what's in it?",
    "[Organizm(-:] A little room with the words 'Open GL' on the wall. The real screen-saver has the same words, but they hang in the air there, and here they're daubed on the plywood in gloss paint. What does that mean, anyway?",
    "[Nutscracker] Do you know, Monster?",
    "[Monstradamus] Open General License? Or maybe Open Great Labyrinth?",
    "[Nutscracker] So there's nothing but those words in the central room, Organism, is that right?",
    "[Organizm(-:] There's a chair as well, with a mirror in front of it.",
    "[Nutscracker] I can guess. Tarkovsky's Mirror.",
    "[Organizm(-:] I sat there for ages and ages. I had the feeling I was about to understand the most important thing of all at any moment. But I didn't understand a thing.",
    "[Monstradamus] That's always the way.",
    "[Organizm(-:] What do you mean? Always the way when you sit looking into a mirror for a long time?",
    "[Monstradamus] Always the way when you feel you're just about to understand something important. It's like the whistle of a bullet or the roar of an aeroplane. If you can hear them, it means they're already zooming past you.",
    "[Nutscracker] Organism, why are you so sure the centre of the labyrinth is where the mirror and the chair are?",
    "[Organizm(-:] Because of the mirror and the chair. What else would they be doing there?",
    "[Monstradamus] That seems pretty obvious."
  ],
  [
    "[Monstradamus] Perhaps that's the whole point. Not to think about where the way out is, but to realise that life is the crossroads where you're standing at this precise moment. Then the labyrinth will disappear as well. After all it only exists as a complete whole in our minds, and in reality there is nothing but a simple choice - which way to go next.",
    "[Nutscracker] Uhuh. And the Minotaur won't do anything to us, because the present 'us' will no longer exist when he catches up with us. One of them said that as well.",
    "[Organizm(-:] And now what's outside your door, Monstradamus? It's about time you told us, you're the only one left.",
    "[Monstradamus] You'll be disappointed, Organism.",
    "[Nutscracker] We'll see. So what have you got?",
    "[Monstradamus] A dead-end."
  ],
  [
    "[Monstradamus] There's a table standing against the wall directly under the seal. And a stool by the table. And on the table there's a blank sheet of paper, a pencil and a pistol with a single bullet.",
    "[Organizm(-:] Truly magnificent simplicity and elegance.",
    "[Monstradamus] There's nothing for you to be envious of. You've got a dead-end too, only it's longer and it has plywood partitions. And Nutcracker's got a television instead of plywood. We've all got dead-ends. Only it's not obvious straightaway, it just takes a little while."
  ],
  [
    "[Monstradamus] What I wonder is, has he got a head on his shoulders or a helmet of horror? Hey, Theseus! I know you can hear me!",
    "[Nutscracker] To be honest, Monstradamus, I used to think you were Theseus.",
    "[Organizm(-:] I was convinced Monstradamus was the Minotaur.",
    "[Monstradamus] I already told you, it all depends on which part of the separator labyrinth the bubble of hope was in when it burst."
  ],
  [
    "[Sartrik] Didn't you ever think I was Theseus?",
    "[Nutscracker] Well hello, Sartrik! You know, not even once...",
    "[Organizm(-:] Somehow the idea never entered my head.",
    "[Sartrik] Organism, it's clear from your userpic that you're queer. Just look at that guilty smile and that gaping xxx.",
    "[Organizm)-:] That's it, I'm going. You can talk to him."
  ],
  [
    "[Nutscracker] All very logical.",
    "[Ariadne] Question: 'How does the separator labyrinth work?' Just look what happened then! The dwarf had his answer scribbled out even before I had finished writing my question. He waited for me, then tossed his page on to the upper table-top and began turning it. But halfway round he suddenly stopped it and asked in a considerate voice: 'Are you enjoying your stay as our guest? Be honest.' I told him: 'Not much. In fact, to be quite honest, I'm not enjoying it at all.' Then he let the wooden disc carry on turning and I received a sheet of paper with the answer: 'That's the way it works'.",
    "[Organizm(-:] I get it. Good, bad and UGLI. But did you ask him why the helmet of horror is called that? I asked you to, remember?",
    "[Ariadne] I remember. It was the last question I managed to ask.",
    "[Organizm(-:] Well then?",
    "[Ariadne] The dwarf asked me to excuse him. He said he'd run out of official paper. But he promised to answer shortly."
  ],
  [
    "[Nutscracker] It's certainly a frightening metaphor. There's nothing new about succubuses and incubuses, of course, but in this appalling dimension we have the spectral manifestation of a certain Julietristan who manages to take the place of not just one partner, but both at once.",
    "[UGLI 666] And not only in this dimension. Why is fornication such a detestable sin? The Church teaches us it's because the fornicator blinded by lust is really copulating with the laughing devil.",
    "[Organizm(-:] Romeo, did you hear any laughter from behind the wall?",
    "[Nutscracker] How very instructive. The Helmholtz doesn't even know who he's xxx. Or who's xxx him. A drawing on the wall, a few flickers in the eyepieces of the helmet, but the true recipient of his passion remains profoundly anonymous.",
    "[Organizm(-:] I don't quite get it. How does the Minotaur manage to take the place of both partners at once? Are you saying he xxx himself?",
    "[Nutscracker] No. With Romeo he's Isolde, and with Isolde he's Romeo. But what you said is an even more interesting idea. Well worth thinking about."
  ],
  [
    "[Nutscracker] I don't understand what you're getting so het up about. Did the knife slip when they were circumcising your cochiba ? It wasn't me, you half-wit, it was your Julistan.",
    "[Organizm(-:] Julistan - it sounds like the name of some small but highly malevolent state located at the very centre of the axis of evil.",
    "[Ariadne] By the way, I've seen that word - Julistan."
  ],
  [
    "[Romeo-y-Cohiba] It's not me. The same thing's happening here. Blows of terrifying power...",
    "[Organizm(-:] The door's giving way!",
    "[UGLI 666] The final hour has come! Repent!"
  ],
  [
    "[Organizm(-:] Ladies and gents, I don't get it - what was that?",
    "[Nutscracker] I think it's getting cooler. And the noise has stopped.",
    "[IsoldA] What, don't you understand? It's Theseus!"
  ],
  [
    "[Organizm(-:] Theseus, answer!",
    "[Nutscracker] Stop it. It's pointless.",
    "[Monstradamus] Has he really gone?"
  ],
  [
    "[Organizm(-:] Why don't we look for him? Maybe he still believes?",
    "[Monstradamus] In what?",
    "[Organizm(-:] Well, in the whole pile of xxx. That he has a body. And it's in a room.",
    "[Ariadne] He never did believe in that."
  ],
  [
    "[Ariadne] What I've heard is that if anyone knows then it's precisely because he is kind.",
    "[Nutscracker] And what I've heard is that if anyone's kind then it's precisely because he knows.",
    "[Organizm(-:] What difference does it make to us? How did we give ourselves away?"
  ],
  [
    "[Organizm(-:] What are we going to do here now?",
    "[Monstradamus] What are we going to do? Carry on with the discourse."
  ],
  [
    "[Organizm(-:] So what, now we'll be the Minosaur. The ancient serpent.",
    "[UGLI 666] We always were, heh-heh. That human stuff was nothing but a nuisance. And all that bovine stuff too.",
    "[Organizm(-:] We'll be a dragon. We'll fly up to the clouds and dive down to the bottom of the sea. Maybe now things really will be easier.",
    "[Monstradamus] Easier? But we've got Sartrik stuck right in the middle of us. Now we'll feel like puking all the time."
  ],
  [
    "[Nutscracker] Let's not have any gloom and doom. The helmet isn't coming off.",
    "[Organizm(-:] But Theseus took it off.",
    "[Nutscracker] Maybe he never even put it on. Otherwise where could he have got to? There's no way out of there."
  ]
]