[
  [
    "[Romeo-y-Cohiba] Let's introduce a bit of clarity here. I actually do have a tattoo on my arm, just above the wrist. It's a fountain of oil, gushing up through a dollar sign. From upside down it looks a bit like an anchor. That's all. I don't know what tattoo she saw. And my yacht club symbol is nothing like that.",
    "[Sartrik] xxx me, a xxx sailor.",
    "[Nutscracker] New members, once again, please introduce yourselves.",
    "[Sartrik] I'm absolutely xxx. My entire body aches.",
    "[Monstradamus] Have you been beaten up, or what?",
    "[Sartrik] I feel sick. Is there any beer to be had around here?",
    "[Monstradamus] I doubt it. Did you overdo it yesterday then?",
    "[Sartrik] Something of the sort.",
    "[Nutscracker] How did you end up in here?",
    "[Sartrik] I don't remember a thing.",
    "[Romeo-y-Cohiba] Leave the man alone, let him get his head together."
  ],
  [
    "[UGLI 666] What's 'Asterius'?",
    "[Monstradamus] 'Starry' in Latin. Asterius, the son of Minos and Parsiphae. The half-man, half-animal from Crete. Better known as the Minotaur.",
    "[Sartrik] That one on the 'Remy Martin' bottle?",
    "[Organizm(-:] No, the 'Remy Martin' beast is a Cyclops. The Minotaur is a freak with a bull's head.",
    "[Sartrik] God, I feel really sick."
  ],
  [
    "[UGLI 666] Semi-darkness. Benches, a lot of benches.",
    "[Romeo-y-Cohiba] Fresh air at last.",
    "[Sartrik] Two fridges full of booze. Minotaur just a great guy after all!"
  ],
  [
    "[IsoldA] I don't know. I went through a few forks in the path and at every one there was a small... I don't know what to call it - an oasis, I suppose. Trees and a fountain with bronze figures of animals. First a hare and a tortoise. They were sitting facing each other, with their faces lifted up to the sky. Their mouths were open and there were long thin streams of water spurting out. To be quite honest, it looked a bit ridiculous, as though they were spitting at an invisible ceiling that was too high, so that everything just fell back down on their own heads. At another fork there was a fountain with a fox and a crow. The crow was high up in the tree, and so big it looked more like an eagle. There was a water pipe leading up to it, hidden among the leaves. The fox was squatting on his haunches gazing up at the crow as though it was trying to hit it with the stream of water spurting out of its throat, but it couldn't reach high enough. The crow had its wings pulled back and up and its beak was open, and there was another stream of water spurting out of that, as though the sight of the fox made it feel sick.",
    "[Sartrik] Now that's something I can understand.",
    "[IsoldA] What do you understand?",
    "[Romeo-y-Cohiba] Take no notice. You're a wonderful storyteller, Isolde. It was like seeing it all with my own eyes."
  ],
  [
    "[Organizm(-:] I was convinced Monstradamus was the Minotaur.",
    "[Monstradamus] I already told you, it all depends on which part of the separator labyrinth the bubble of hope was in when it burst.",
    "[Sartrik] Didn't you ever think I was Theseus?",
    "[Nutscracker] Well hello, Sartrik! You know, not even once...",
    "[Organizm(-:] Somehow the idea never entered my head.",
    "[Sartrik] Organism, it's clear from your userpic that you're queer. Just look at that guilty smile and that gaping xxx.",
    "[Organizm(-:] That's it, I'm going. You can talk to him.",
    "[Nutscracker] Sartrik, that isn't a userpic. Perhaps we can call it a dialogue header. And that isn't a gaping xxx, it's a capital 'O'.",
    "[Sartrik] Monstradamus just said - right? - that everything is determined by what you see. I take that to mean that if someone can see the answer to the most important question of all, then he is Theseus. Am I right, Monstradamus?",
    "[Monstradamus] Possibly. But exactly what is the most important question of all?",
    "[Sartrik] Let me explain. Have you noticed that we never exist simultaneously, only by turns?",
    "[Monstradamus] An interesting observation. You mean the writing on the screen?",
    "[Sartrik] I mean in general. Since you didn't understand the question, I'll ask it a different way. The helmet of horror is a machine. What does it run on? What does it have instead of petrol?",
    "[Nutscracker] He's lost it, Monster. Delirium tremens. He needs a drip installed.",
    "[Monstradamus] Wait, Nutcracker. So what does it have instead of petrol?",
    "[Nutscracker] Vodka?",
    "[Sartrik] Why vodka? Do you think I'm a drunken xxx and I don't understand a thing? Instead of petrol it has Theseus.",
    "[Monstradamus] Explain that, please.",
    "[Sartrik] You remember Ariadne looking into the mirror and seeing that hat with a veil, and afterwards she realised it was the helmet of horror? The petrol that the whole deal was running on was her, get it? Everything's made out of the person who sees it. Because it can't possibly be made out of anything else. Without the person there won't be any hat or any veil, or any lilies-of-the-valley. Nothing. Get it? Theseus is the one who looks into the mirror, and the Minotaur is the one he sees, because he's wearing a helmet of horror.",
    "[Monstradamus] You mean to say the Minotaur is just an illusion?",
    "[Sartrik] If you listened to what I'm saying, then you'd know what I'm trying to say. He sees this bronze phizog with horns on it because he sees himself in the mirror through the holes. Without Theseus there is no xxx Minotaur.",
    "[Nutscracker] Did you get that, Monster?",
    "[Monstradamus] Naturally. If you put on a Batman mask and look in the mirror, you'll see Batman. But the mask will never see itself.",
    "[Sartrik] That's it. The helmet of horror is simply the reflection that Theseus sees, and that's all. But if he decides there really is a Minotaur and starts swearing blind at him and discussing the meaning of life with him, well that's when the Minotaur appears. And how! And then there's no way to get the helmet of horror off again. Get it now, you vermin? I know everything.",
    "[Nutscracker] I bet you he can see little pink Minotaurs running round the room. Now that's the kind of labyrinth I understand! And no need to bother going anywhere.",
    "[Monstradamus] And why are we vermin?",
    "[Sartrik] Because you're all nothing but bits and pieces of the helmet of horror. I figured that out ages ago. And that's the real xxx killer, when you realise that absolutely everybody - all your friends and all your enemies - are just little bits and pieces! I'm not talking about you. Meaning you're not my friends. And not my enemies. But you're bits and pieces, all right. You, Monstradamus, and you, Nutcracker - you're the horns. You'll stick out a bit too far some day. Ariadne's the labyrinth, but she's not such a bad girl, she's okay. Ugly's the past that makes me want to puke. And Organism's the future, that makes me want to puke five times worse. Who's left? Romeo and that Isolde of his? They're the double xxx that's cooking up the whole xxx mess.",
    "[Nutscracker] And so you're Theseus?",
    "[Sartrik] Yes. Because I never talk to you.",
    "[Nutscracker] What's your proof?",
    "[Sartrik] That you're all nothing but shadows, I'm the only one here that's alive. You're nothing but shackles on the convolutions of my brain. All your Rolls-Royces and Lolitas, Ferraris and Berlusconis, all your shaved and scented glamour, your magic wonderland TV quizzes, where you get shafted up the xxx every day underneath the money tree - you made it all out of my head! You do all that out of my head, and I'm nothing to you, but you're the entire deal for me, eh? In my xxx head! But I'll dump you all.",
    "[Nutscracker] Monster, maybe you understood some of that?",
    "[Monstradamus] I might have. But I'm not a hundred per cent certain.",
    "[Nutscracker] Translate from the Latin, will you?"
  ],
  [
    "[Monstradamus] What d'you mean, where? In the mind. Where else?",
    "[Nutscracker] This climb's a bit too high without a bottle. For me at least.",
    "[Sartrik] Listen, Monstradamus, you're some guy! The way you put that! I even understood it myself. Some mess, eh? If you think that thought through all the way to the end, all those English astrophysicists and the entire xxx Academy of Sciences should be thrown in the slammer!",
    "[Monstradamus] Why bother putting them away? Who cares about those buffoons.",
    "[Sartrik] Oho! You're a hard case, aren't you? Theseus, you're Theseus, no two ways about it.",
    "[Nutscracker] You're a real Theseus too, Sartrik. Maybe you've even found the way out?",
    "[Sartrik] A long time ago. Only there are these snakes crawling around in front of it. But when they crawl away I'll leave.",
    "[Monstradamus] Ariadne! Good morning?",
    "[Ariadne] Good morning.",
    "[Monstradamus] Did you see the dwarf?"
  ],
  [
    "[UGLI 666] Do not waste your final moments in blasphemy!",
    "[Sartrik] What the hell's going on out there? Stop it!"
  ],
  [
    "[UGLI 666] Nutcracker, you're talking about what she ought to do. I'm talking about what she's already done. And anyway, I beg your pardon, but what has skill got to do with it? The labyrinth is any route the Helmholz has been led along.",
    "[Monstradamus] That's right, any route. But it seems like a very long time since anyone walked round your route, Ugly.",
    "[Sartrik] What... What route is that?",
    "[Monstradamus] Back with us again, hero? Ladies and gents, a joke. Imagine Sartrik wakes up with a massive hangover. He can't remember anything about the previous day. There's a pool of blood beside him. He's surrounded by a labyrinth. But there's no Minotaur anywhere. Sartrik raises his eyes to the ceiling and whispers in horror: 'I killed him... Killed him and ate him...'",
    "[IsoldA] What's funny about that? That's exactly how it happened.",
    "[UGLI 666] Your joke's older than the labyrinth, Monstradamus. Let's discuss the serious situation we're in. Some day Ariadne will be the death of us.",
    "[IsoldA] Stop stirring things up, Ugly. It's not Ariadne's fault at all. Sartrik blurted it all out in a drunken stupor.",
    "[Sartrik] You always blame everything on Sartrik.",
    "[IsoldA] You should be xxx to xxx. Why did you butt in? What for? Lousy drunk."
  ],
  [
    "[Sartrik] Listen, Monstradamus. There's one thing I still don't get. Where did all this happen?",
    "[Monstradamus] Are you really that stupid or can you just not sober up? In the helmet of horror.",
    "[Sartrik] Oh. And who to?",
    "[Monstradamus] You."
  ]
]