[
  [
    "[Nutscracker] So does anyone have any ideas?",
    "[Organizm(-:] I don't get it, are we seriously discussing someone's dream?",
    "[UGLI 666] I think...",
    "[Nutscracker] New members, please introduce yourselves to the group straightaway. What do you think?",
    "[UGLI 666] The Lord sent her that vision to make us repent.",
    "[Romeo-y-Cohiba] That's just great! We've been locked up in here, and we have to repent? Repent for what?",
    "[UGLI 666] What we were locked up for.",
    "[Romeo-y-Cohiba] And what were we locked up for?",
    "[UGLI 666] Each of us for his own reason. For it is said: 'There is no man that shall live without sin, though his life be but a single day.'",
    "[Organizm(-:] Ugly, what sex are you?",
    "[UGLI 666] That's of no relevance.",
    "[Organizm(-:] Is he/she really serious?",
    "[Monstradamus] I think he/she means what he/she says.",
    "[UGLI 666] I'm female, since it interests you so very much. My name's xxx, I'm a xxx by profession and a xxx by education, but by vocation I've always been a xxx. I've read everything already. And I have nothing interesting to add. As for whether I'm being serious or not, you can be quite sure I always mean what I say.",
    "[Organizm(-:] Tell me, Ugly, did you invent your views to match your name or was your name invented to match your views?",
    "[UGLI 666] My name's for my sins. And so is yours.",
    "[Organizm(-:] But do you know what 'UGLI' really means? It's not from the word 'ugly' as you probably thought. It's 'Universal Gate for Logic Implementation'. A universal logic element, I remember that from school. So if you chose your views to match your name you were looking in the wrong place altogether.",
    "[Monstradamus] We were talking about Ariadne's dream. It has been suggested that she was shown it specially and it contains information for everyone.",
    "[Romeo-y-Cohiba] What does that mean - shown it specially? This isn't a cinema. And if the information's for everyone, then why was it shown to Ariadne?"
  ],
  [
    "[Organizm(-:] You'll get a showing too, don't be in such a hurry.",
    "[Romeo-y-Cohiba] You think that monster in the bronze helmet really is walking about outside our doors?",
    "[UGLI 666] You don't have to take everything so literally. In the dream the door was made of wood, with a bull's head. But in here it's made of bronze, with an infernal symbol. Dreams are metaphorical.",
    "[IsoldA] Ariadne saw Romeo in her dream and when she described him he recognised himself. What kind of metaphor is that?",
    "[Romeo-y-Cohiba] Who says I recognised myself? It was just a couple of details that matched.",
    "[IsoldA] But what kind of details? There can't be many tattoos like that. An anchor with a dollar sign."
  ],
  [
    "[Nutscracker] Cool it, Romeo. Sometimes a cochiba's just a cigar.",
    "[IsoldA] Could you talk about that separately somehow?",
    "[UGLI 666] I second that motion.",
    "[Organizm(-:] Unfortunately we can't just go out into the corridor.",
    "[Romeo-y-Cohiba] You didn't answer the question, Monstradamus. Can the dream be analysed?",
    "[Monstradamus] If you're thinking of penis symbolism, then I've got nothing to add to what Nutcracker said. But I do have a few observations along an entirely different line. I can share them if you're interested."
  ],
  [
    "[Nutscracker] Of course we're interested.",
    "[Monstradamus] In the first place, the names. Has anyone any guesses on that score?",
    "[UGLI 666] Names of demons from hell.",
    "[Monstradamus] The soap, the toilet paper and other items in the bathroom are all marked with something that looks like the symbol for indicating a footnote - a little star. It's called an asterisk, which is also the name of the character Ariadne dreamed about. It sounds a lot like 'Asterius.'",
    "[UGLI 666] What's 'Asterius'?",
    "[Monstradamus] 'Starry' in Latin. Asterius, the son of Minos and Parsiphae. The half-man, half-animal from Crete. Better known as the Minotaur.",
    "[Sartrik] That one on the 'Remy Martin' bottle?",
    "[Organizm(-:] No, the 'Remy Martin' beast is a Cyclops. The Minotaur is a freak with a bull's head."
  ],
  [
    "[IsoldA] But what has an axe got to do with a labyrinth?",
    "[Monstradamus] They find them in Crete. Where the labyrinth was. That's all I know.",
    "[UGLI 666] Maybe the Minotaur was killed with an axe like that?",
    "[Monstradamus] Let me go on with the names. As well as Asterius and Asterisk, it's hard not to notice another coincidence. It was Ariadne who dreamed about him. That was the name of the Minotaur's sister. And it was also Ariadne who started this thread with the question about the labyrinth.",
    "[IsoldA] It's a very common name. I had a lotion for dry skin called 'Ariadne's Milk'.",
    "[Romeo-y-Cohiba] Names and coincidences are all very well. But what I don't understand is - what are we going to do?"
  ],
  [
    "[Monstradamus] Well, what can we do? Wait for Theseus, who will lead us out of the labyrinth. And hope the joke doesn't go too far.",
    "[UGLI 666] Does it seem like a joke to you?",
    "[Monstradamus] Well, I'd say our hosts certainly seem to have a sense of humour.",
    "[Romeo-y-Cohiba] I haven't laughed even once yet.",
    "[Nutscracker] Monster's right. There's definitely humour in all of this, only it's infernal humour. Forcing serious people like us to call each other by idiotic names. Dressing us in ancient Greek chitons and making us sit at these screens. And then the Internet we end up in has about as much to do with the real one as we do with Ancient Greece."
  ],
  [
    "[Monstradamus] Me kneether. It's the mooderattors.",
    "[Romeo-y-Cohiba] Step mucking us, you ratten scam!",
    "[UGLI 666] There's no point in getting upset, Romeo. It won't help matters.",
    "[IsoldA] Have they really stopped?",
    "[Organizm(-:] Good for you, Romeo! They did what you told them to. Why not try telling our moderators to do something else?",
    "[Romeo-y-Cohiba] Stick your xxx up your xxx and give it a double right twist."
  ],
  [
    "[IsoldA] At least tell us if you're here or not! Theseus!",
    "[Monstradamus] By the way. If the moderators can fulfil our wishes, why don't we ask them to open the door?",
    "[UGLI 666] But what's outside the door?",
    "[Organizm(-:] We can find out.",
    "[Romeo-y-Cohiba] You be careful, or the door might really go ahead and open.",
    "[Ariadne] I've composed a little poem. Dedicated to Monstradamus."
  ],
  [
    "[Monstradamus] A bit on the dark side. But maybe I deserve it for being so suspicious.",
    "[Organizm(-:] An experiment. Doors, open!",
    "[UGLI 666] Lord have mercy!",
    "[Romeo-y-Cohiba] I warned you!",
    "[Ariadne] Did it happen in all the rooms?",
    "[Monstradamus] It did in mine."
  ],
  [
    "[UGLI 666] Do you mean the music or the door?",
    "[Ariadne] The whole thing at once.",
    "[IsoldA] I've got sky outside. Grey. Looks a bit like a park. Everything seems quiet. I'm going out to explore.",
    "[Romeo-y-Cohiba] Hey, Isolde, wait! It could be dangerous out there!"
  ],
  [
    "[UGLI 666] It's dark out there.",
    "[Romeo-y-Cohiba] Isolde!",
    "[Nutscracker] Did everyone hear the trumpets?",
    "[Ariadne] Do you think they were trumpets?"
  ],
  [
    "[Monstradamus] Let's just keep calm and get our bearings.",
    "[Organizm(-:] Okay, I think I've got it. When the door opens, a lever shaped like a leg with a hoof moves out and down.",
    "[UGLI 666] Lord save us and keep us!",
    "[Nutscracker] To make the door close, you push the lever. To make it open, you press on the axe in the middle. So everyone can open their own door when they want to.",
    "[Romeo-y-Cohiba] It works.",
    "[Monstradamus] What can you see outside the door?"
  ],
  [
    "[Ariadne] There's another room outside mine.",
    "[UGLI 666] Semi-darkness. Benches, a lot of benches.",
    "[Romeo-y-Cohiba] Fresh air at last.",
    "[Sartrik] Two fridges full of booze. Minotaur just a great guy after all!",
    "[Organizm(-:] Plywood walls painted to look like bricks. It all looks pretty naff."
  ],
  [
    "[Nutscracker] Organism, we're all asking you.",
    "[Organizm(-:] I'm busy.",
    "[UGLI 666] I never understood before why gluttony is a sin. Then a spiritual friend of mine explained. Gluttony is not so very terrible in itself. But it's a sign of a base soul. The same thing applies to debauchery. The soul doesn't become debased through committing these acts. A base soul manifests itself through them.",
    "[Romeo-y-Cohiba] No, you won't get under his skin that easily.",
    "[Monstradamus] Moderators! Give us all something to eat!",
    "[Ariadne] I heard some kind of noise. But where's the food?"
  ],
  [
    "[Monstradamus] That's for sure. And even when it does make us miserable, we should feel happy in our misery.",
    "[Nutscracker] That's right! So there never is any genuine interactivity, only the appearance of it. Or rather, it is permitted, but only within a narrow range where no choice you make can change the fundamental situation. The main problem is to eliminate freedom of choice so that the subject is led unerringly to make the decision required, while at the same time maintaining his firm belief that his choice is free. In scientific terms it's known as coercive orientation.",
    "[UGLI 666] What's that?",
    "[Nutscracker] That's a long story.",
    "[Organizm(-:] We don't have much else to occupy ourselves with.",
    "[Monstradamus] That's right. Tell us about it, Nutcracker. Let's give our brains a break."
  ],
  [
    "[Nutscracker] The next technology up is 'Pavlov's Bitch'. That's an intermediate conditioned reflex editor.",
    "[Organizm(-:] So it's named after that Russian scientist who noticed his stomach juices started flowing when the phone rang?",
    "[UGLI 666] No he didn't. He just studied conditioned reflexes in dogs.",
    "[Nutscracker] I didn't invent the name. When you look at the vases that we want to exclude from your list, your vision starts blurring and rippling and you get a horrible buzzing in your ears, or even an electric shock. So you won't look at them again.",
    "[UGLI 666] But you'd notice that straightaway.",
    "[Nutscracker] We want you to notice it straightaway, draw the right conclusion and look in the right direction in future. It's a cheap technology for third-world countries. But if the budget's big enough, then for instance we can use infrasonics. The Helmholtz won't notice anything, but he'll experience a dark, mysterious horror when he turns towards any vase except the one we want. The obverse method is stimulation of the pleasure centre when the correct choice is made. They used to insert an electrode, but now it's done by pharmacological means or by entraining the brain to delta rhythms.",
    "[Organizm(-:] You don't say. Are you telling me they'll be doing all that stuff to us if we watch interactive movies?",
    "[Nutscracker] I don't think so. These techniques weren't developed for the movies, not even for virtual spaces. They were just modelled there. The topic is not in the public domain. But since you and I aren't in the public domain either, I suppose it's okay for me to tell you about it."
  ],
  [
    "[Organizm(-:] So what are the internal editing programs like?",
    "[Nutscracker] Well, for instance, take 'Sunny Kiss'. The vase we have to choose is endowed with positive emotional coloration by employing universally accepted aesthetic codes, given a positive inner content, if you like.",
    "[UGLI 666] Inner content. Would that be inside the vase or inside the viewer?",
    "[Nutscracker] That's a difficult question. You could say, it's inside the helmet. But all that's just words. It's easier for me to explain how it's done. Say a ray of sunlight falls on our vase, or you hear a soulful melody in the air when it enters your field of view. The reverse technique is 'Doom and Gloom'. For instance, when you look at a vase we don't like, the sun is covered by dark clouds, a grey fog comes down and you hear unpleasant noises.",
    "[Organizm(-:] Fair enough. What else?",
    "[Nutscracker] There's another technology called 'The Seventh Seal'. The vase that has to be chosen is marked out using secret signs that attract interest or stimulate the imagination. It can be absolutely anything - a hand print on its surface, arrows pointing to it on the ground, a dove sitting on its edge, mysterious graffiti, and so on and so forth. The obverse method is 'The Le Pen Club'. That's when the vases we wish to exclude are covered in the crudest obscenities you can imagine, preferably not even in paint, but xxx. Virtual, of course."
  ],
  [
    "[Ariadne] Beyond the window-pane on Doom and Gloom\nOld Pavlov's Bitch's Sticky Glance is glued.\nMy Minotaur! Creep silently into my room\nBeckon me with a glance, brazenly nude.",
    "[Nutscracker] Powerful as ever. And he's already partly fulfilled your wish by removing his helmet, even though he has no head underneath it. I'd say it's impossible to expose yourself any more brazenly than that.",
    "[UGLI 666] Nutcracker, there's one thing about what you say I can't understand. How can you change what's in front of a person's eyes without him noticing? If he's looking at the same place but sees something different, how can he fail to notice?",
    "[Nutscracker] I couldn't understand that at first either. But for the Helmholtz the word 'change' has no meaning. In real life what you see depends on where you look. But when you're wearing a helmet, it's the other way round - where you're looking depends on what you see. Is that clear?",
    "[UGLI 666] Not entirely.",
    "[Nutscracker] In the real world you see what's in front of your eyes. No matter which way you point your rump. But in this world you see what's in front of your eyes, no matter which way you point your head. As we used to say in the xxx, it's chalk and cheese, even though it sounds pretty much the same. You don't have any independent system of coordinates, and we decide everything you see. So you can't even suspect anything. For you even the world isn't what it really is, but what's shown to you. You feel like you're looking around in a natural manner, but in fact all the time your eyes keep stumbling over our candidate - sorry, I mean our vase - and it gives you this light and happy feeling. But you never think to ask why, the same way no one ever asks why it's a sunny day.",
    "[Organizm(-:] An interesting slip of the tongue.",
    "[Nutscracker] And if the mark turns his head too rapidly, so that 'Sticky Eye' and 'Sunny Kiss' stop working, then 'Doom and Gloom' and 'The Weight' kick in immediately."
  ],
  [
    "[Organizm(-:] Well, Nutcracker, so now I understand what you do for a living. Tell me, as a professional, do you reckon they could be influencing us in some similar kind of way in here?",
    "[Nutscracker] I'd have to think about that.",
    "[UGLI 666] I noticed a long time ago that conspiracy theory has taken the place of religion for atheists. They always think there's someone manipulating them, hypnotising them, zombifying them, bugging them, trailing them. But that someone is simply the devil, and that's all. The fact is, it's only a short step from atheism to schizophrenia, and in most cases it's already been taken. What about you, Organism? Do you feel like someone's manipulating you?",
    "[Organizm(-:] To be honest, I do.",
    "[UGLI 666] What kind of manipulation is it?",
    "[Organizm(-:] Being locked in here, for instance. Or being fed pancakes for the second day running.",
    "[UGLI 666] Ah, in that sense. But that's not manipulation, that's God's punishment.",
    "[Organizm(-:] Ugly, let me explain to you how we're manipulated in here. Let's assume that headgear on Asterisk's head is a virtual reality helmet after all.",
    "[UGLI 666] And then what?",
    "[Organizm(-:] Perhaps everything we see here is something like that flat area Nutcracker was talking about - with the three identical vases, except one of them is more identical than the others.",
    "[Nutscracker] For us to be manipulated like that, we'd have to be wearing helmets.",
    "[Organizm(-:] Maybe we are."
  ],
  [
    "[Nutscracker] How could he make them do that?",
    "[Organizm(-:] Hypnosis.",
    "[UGLI 666] There you are. I was just waiting for that word.",
    "[Nutscracker] I don't know much about hypnosis. But if a hypnotist was powerful enough to make others see what he sees, why would he need a helmet?",
    "[Organizm(-:] In order to know what the others have to see.",
    "[Monstradamus] You could take it even further. Not just seeing, but actually being there. Asterisk wears a helmet in which he sees a labyrinth. And we're all inside this labyrinth. And he manipulates us."
  ],
  [
    "[IsoldA] Does it open?",
    "[Romeo-y-Cohiba] To be honest I didn't try it. I stood beside it for a while and suddenly I felt terrified, I even got a pounding in my temples. I'm not the timid type at all, but suddenly there it was. For no reason at all. I thought - who knows what's inside there? What if it's the... Minotaur?",
    "[UGLI 666] Nutcracker, do you know any Latin?",
    "[Nutscracker] The Senate and People of Rome. P-Q-R-S. No, I'm confusing it with the alphabet. What the Romans had was S-P-Q-R.",
    "[Monstradamus] Why are you interested in Latin, Ugly?",
    "[UGLI 666] To translate a few words.",
    "[Monstradamus] I'll give it a try.",
    "[UGLI 666] What's 'aiselceclesia'?",
    "[Monstradamus] I don't know.",
    "[UGLI 666] And 'ieselceaeclesi'?",
    "[Monstradamus] I don't know that either. Are you sure it's Latin?",
    "[UGLI 666] What else could it be?",
    "[Monstradamus] I can't tell yet. Can you give us the whole phrase?",
    "[UGLI 666] It's very long.",
    "[Monstradamus] Then a couple of words at least.",
    "[UGLI 666] It starts: 'aiselceclesia ieselceaeclesi selceataecles elceatctaecle'.",
    "[Monstradamus] Stop, that's enough for now.",
    "[UGLI 666] What is it?",
    "[Monstradamus] Not so fast. Let me have a think.",
    "[Nutscracker] Where's it from, Ugly?",
    "[UGLI 666] From a labyrinth.",
    "[Nutscracker] Have you got a labyrinth outside your door?",
    "[UGLI 666] What else am I supposed to have?",
    "[Nutscracker] Catacombs.",
    "[Monstradamus] Don't mock, Nutcracker.",
    "[UGLI 666] The catacombs were the cradle of the faith. It would have been great reassurance from the Lord.",
    "[Nutscracker] She said before she had a hall full of benches. Now all of a sudden there's a labyrinth.",
    "[UGLI 666] I wish you'd go back to your bitches, Nutcracker, I really do.",
    "[UGLI 666] Can you make anything of it, Monstradamus?",
    "[Monstradamus] Were the words written in a column, one under the other?",
    "[UGLI 666] Yes.",
    "[Monstradamus] Can you type the one that was in the middle?",
    "[UGLI 666] What do you mean? Which one's that?",
    "[Monstradamus] The seventh from the top, if that makes it easier.",
    "[UGLI 666] Eatcnasanctae.",
    "[Nutscracker] Eat NASA. I can't make out any other references there.",
    "[Monstradamus] Where did you find it?",
    "[UGLI 666] I don't really want to talk about that.",
    "[Monstradamus] What if I reproduce the entire inscription, then will you tell me?",
    "[UGLI 666] In that case, yes.",
    "[Monstradamus] The inscription was this:\nA I S E L C E C L E S I A I S E L C E A E C L\nE S I S E L C E A T A E C L E S E L C E A T\nC T A E C L E L C E A T C N C T A E C L C\nE A T C E A N C T A E C E A T C N A S A\nN C T A E C E A T C N A N C T A E C L C\nE A T C N C T A E C L E L C E A T C T A E\nC L E S E L C E A T A E C L E S I S E L C E\nA E C L E S I A I S E L C E C L E S I A",
    "[UGLI 666] That's right. How did you do that?",
    "[Monstradamus] Dominus illuminatio mea.",
    "[UGLI 666] But what does it mean?",
    "[Monstradamus] The Lord is my light.",
    "[UGLI 666] I mean what does my inscription mean?",
    "[Monstradamus] Well, what do you think?",
    "[UGLI 666] I can't make any sense of it at all. What sense is there?",
    "[Monstradamus] The sense can be very different, depending on where you found it. So you'll have to be honest about everything.",
    "[UGLI 666] All right. Outside my door there really is a hall with benches. I didn't really look at it properly at first. But then when I did... I'm not even sure whether you'll believe me or not, Monstradamus.",
    "[Monstradamus] I'll give it a try.",
    "[UGLI 666] There's a cathedral there. A Gothic cathedral.",
    "[Nutscracker] You just said there was a labyrinth.",
    "[UGLI 666] That's there too, only inside the cathedral. And in front of the entrance to the labyrinth there's another Latin inscription laid out on the floor:\nHVNC MVNDVM TIPICE LABERINTHVS\nDENOTAT ISTE:\nINTRANTI LARGVS, REDEVNTI SED\nNIMIS ARTVS SIC MVNDO CAPTVS,\nVICIORVM MOLLE GRAVATVS VIX VALET\nAD VITE DOCTRINAM QVISQVE REDIRE.",
    "[Monstradamus] The meaning of that is more or less as follows - 'the labyrinth represents the world in which we live, wide at the entrance, but narrow at the exit. He who is ensnared by the joys of this world and is burdened with its sins, may only rediscover the doctrine of life through effort.' Only don't ask me what the doctrine of life is. Was there really a wide entrance and a narrow exit?",
    "[UGLI 666] There wasn't any entrance or exit at all in the usual sense. The entire labyrinth was laid out on the floor of the cathedral in light-blue marble. It's just a mosaic.",
    "[Nutscracker] Is there such a thing as light-blue marble?",
    "[UGLI 666] Yes, there is.",
    "[Nutscracker] But what's a labyrinth doing in a cathedral?",
    "[UGLI 666] The first canon told me a labyrinth is a part of that church and many others, because it illustrates the full complexity of the Christian path.",
    "[Nutscracker] The first canon?",
    "[UGLI 666] Yes. But the second canon objected that the Christian path is as simple and straight as an arrow. And the twists and turns and dead-ends of the labyrinth symbolise sin, in which fallen souls wander, hopelessly lost. And then the first canon replied that he had essentially meant the same thing, since sin is a distortion arising in the straight line of the Christian path. But no matter how tortuous the path of life might be, if the person walking it remains within the bosom of the Church, the simple arithmetic of good and evil ceases to apply, and the higher mathematics of the spirit comes into play.",
    "[Nutscracker] Now we've got a second canon as well.",
    "[Monstradamus] And what higher mathematics is that?",
    "[UGLI 666] However crooked and tortuous a life may be overall, a communicant of the Sacred Gifts may regard each infinitesimally small sector of his path as straight. And if any sector of his path is straight, then it is straight at any moment, and if it is straight at any moment, then it is always straight, and the Lord will not reject his soul. It is as though we grow mathematical wings that lift us up out of the depths of our degradation.",
    "[Nutscracker] But who are these canons? You mean you met someone?",
    "[UGLI 666] There were two of them. They were praying on bended knees near the altar. I made a noise, they noticed me and came over to help me with explanations and instructions.",
    "[Nutscracker] Tell us about them.",
    "[UGLI 666] They said that a long time ago, when faith was strong in people's souls, a priest could send a repentant sinner on a pilgrimage to the Holy Land. In later times, when faith began to fail...",
    "[Nutscracker] Not about the instructions, tell us about the canons themselves. Don't you understand, or what? No one else here has met anybody.",
    "[Monstradamus] What about Ariadne?",
    "[Nutscracker] She only dreamed about them. Surely I don't have to explain the difference?"
  ],
  [
    "[Nutscracker] Not again. You've worn me out.",
    "[Nutscracker] Ugly, are you there?",
    "[UGLI 666] Yes.",
    "[Nutscracker] These canons, what did they look like?",
    "[UGLI 666] Medium height. In threadbare cassocks, with old-fashioned, wide-brimmed cardinal's hats on their heads. The canons explained that the hats once belonged to holy prelates and they helped to calm the passions. The second canon had the brim of his hat bent upwards at one side, like a duellist. It reminded me of Aramis from 'The Three Musketeers', the one who was an ordinary sinner at first, and then became a general of the order of Jesuits.",
    "[Monstradamus] Sounds like the two dwarves that Ariadne saw at the very beginning.",
    "[Nutscracker] That's what I thought too. But those were dwarves, and these two are medium height.",
    "[Monstradamus] Ugly, what height are you?"
  ],
  [
    "[UGLI 666] That has nothing to do with anything.",
    "[Nutscracker] Forget it. Let's move on. Ugly, did you see their faces?",
    "[UGLI 666] No. They stood with their heads bowed, as befits monks and spiritual people, and the brims of their hats hid their features completely.",
    "[Nutscracker] And what were their voices like?",
    "[UGLI 666] Humble and sincere.",
    "[Nutscracker] What did they say?",
    "[UGLI 666] I started telling you that, but you interrupted. They said that in the glorious times of the Holy Crusades, especially after the victory of Gottfried of Bouillon, pilgrims journeyed on foot to the grave of our Lord to repent. Later, when faith grew weaker and the human spirit no longer possessed the strength for such great effort, the site of pilgrimage was relocated to monasteries and abbeys, where people went to pay homage to the local saint. When people's piety became too weak even for that, they were instructed to walk The League to do penance.",
    "[Nutscracker] The League?",
    "[UGLI 666] Yes. It's the old name for the church labyrinth. That's approximately how long it was. Although the one I was facing was a lot shorter. You were supposed to walk through these labyrinths on your knees. And for the time of ultimate decline that will come just before the end of the world, labyrinths on walls were prepared, really small ones that people go through by tracing the way with their finger. They are for those who are only willing to spend a very small amount of time on their souls. But there are labyrinths that are quite the opposite, endlessly long ones in which you can repent eternally. For instance in the Church of Sta. Maria-di-Trastavera in Rome. The first canon showed me a plan of it.",
    "[Monstradamus] He prepared well for the conversation.",
    "[UGLI 666] He didn't prepare for it. The plans of the labyrinths were on the columns and walls of the cathedral. In fact, everything there was covered with them. The one that's in Sta. Maria-di-Trastavera consists of a large number of circles set inside each other. It looks like a target for shooting practice. It's the most mystical of all the labyrinths.",
    "[Monstradamus] The most mystical one is mine; please enter that in the minutes.",
    "[UGLI 666] The second canon explained that the meaning of these circles is that it's no more possible for the soul to approach the Lord through its own desire than for the moon suddenly to decide to fly closer to the earth. The soul will remain eternally on the plane to which the Lord has sent it, and it will only be able to approach Him through His mercy, and not of its own will. And His mercy is expressed in the existence of the Church. It's the Church that lends us those mathematical wings we were talking about. Without them we can only circle around Him like the planets. Sin is the centrifugal force that pulls us away from Him. But God's love is like the force of gravity, because it draws us to Him. The soul dwells in this world below because these forces balance each other.",
    "[Nutscracker] So the Lord loves sinners more then?",
    "[UGLI 666] Why?",
    "[Nutscracker] They have more sins, so their centrifugal force is stronger. For them to stay in orbit, the force of God's love has to increase to balance it.",
    "[UGLI 666] But it happens in families too, that the best-loved children are the naughtiest.",
    "[Nutscracker] Then that means, if you want the Lord to love you more, pull as many dirty tricks as you can?",
    "[UGLI 666] Yes it does, according to logic. But I'm not really sure that's what the Lord is actually guided by.",
    "[Nutscracker] Okay, we'll check that one out. What happened next?",
    "[UGLI 666] Next? The second canon folded his arms and fell silent and withdrew humbly into the shadow. I began walking around the cathedral arm-in-arm with the first one, examining the plans of the various spiritual labyrinths, while the canon quietly explained their function and symbolic meaning to me. I thought the labyrinth from Poitiers Cathedral was particularly beautiful. It's shaped like a tree with a spreading crown and arranged so that the same threshold serves as its entrance and its exit. It works out like that because the path only divides in two once, at the very centre, and its two halves twist and turn to form the right and left parts of the tree's crown. The canon said it was the Tree of Life, and the meaning of the labyrinth was that we enter life and leave it through the same door, naked and taking nothing with us.",
    "[Nutscracker] And where's that inscription with the secret message from, the one you asked us to translate?",
    "[UGLI 666] From an ancient basilica in Algeria.",
    "[Monstradamus] Does it have a labyrinth too?",
    "[UGLI 666] Yes. It surrounds a central square containing the holy inscription. The canon told me to copy it out and assured me there was a secret in the inscription. He said I would only be able to read it when I had the key. In exactly the same way, he said, I would not be able to understand the predestined purpose of people and things in this world until the moment when the wisdom that comes with true faith opened my eyes to the transcendental meaning of creation. And the key to that wisdom was the same as the key to the inscription. He also told me not to be seduced by the empty talk about Theseus, which he knows all about. In time, he said, I would see for myself that the true Theseus is the One whom he serves. And that's all. Is Monstradamus still there?",
    "[Nutscracker] Later. Go on with your story.",
    "[UGLI 666] I'm not going to tell you any more until he translates for me.",
    "[Nutscracker] Monster, are you there? Translate for her, please.",
    "[Monstradamus] The whole point is in the way the letters are arranged. In French it's called a jeu-de-lettres .",
    "[UGLI 666] But do you have the key to the inscription the canon was talking about?",
    "[Monstradamus] Of course.",
    "[UGLI 666] What is it?",
    "[Monstradamus] It's a cross.",
    "[UGLI 666] My Lord! Thy will be done!",
    "[Monstradamus] Yes. You have to start from the very centre. Find the letter S there and trace a cross through it. If you read the text in any direction of the cross and then along any line from it at right angles, you get SANCTA ECLESIA, which means 'the holy church', with one mistake.",
    "[UGLI 666] Are you saying the inscription was made with a spelling mistake? Or does the inscription refer to a mistake made by the holy church?",
    "[Monstradamus] What I'm saying is there should be two C's in the word for church - ecclesia. But in olden times they might have thought that was excessive.",
    "[Nutscracker] Then what happened, Ugly?",
    "[UGLI 666] Wait a moment. Let me see if it works with the letters. It really does. How profound! Now I understand what the canon was trying to say, Monstradamus. This world will remain a meaningless conglomeration of absurdities and riddles, where we continue to wander aimlessly about in the dark, until we accept the teachings of the Holy Church. But as soon as that happens, the holy cross will shine out at the centre of life's labyrinth, and the fullness of the purpose concealed in all things will instantly be revealed! The world will be miraculously transformed, the harmonious scheme of things will emerge from the chaos and insanity, and whichever way we direct our gaze, we shall see Hosannah to the Lord on every side! Is that right, Monstradamus?",
    "[Monstradamus] But of course. And we shall hear the radiance of his glory.",
    "[Nutscracker] Amen. So what happened next?",
    "[UGLI 666] The canon led me over to the labyrinth laid out on the floor and said 'My daughter, the One whom I serve wishes you to walk The League and repent.' I went down on my knees and set off. The canon said that while walking through a labyrinth like that the correct thing to do is to meditate intensely on everything that you have done in your life. I didn't have to try very hard. I only had to glance at the grid by the altar for pictures of my childhood to start floating past my inner eye like coloured balloons, magically transforming what I saw around me. With every new second I was immersed deeper and deeper into the past. The majestic columns soaring upwards to meet the distant vaults took on the appearance of the lime trees in the park in xxx where I spent the first few years of my life. It's not surprising - in those distant days the trees were every bit as huge in relation to me as those columns are now. The images of the saints watching me from niches in the walls had the faces of grown-ups from my childhood. I sensed that some of them were strict and others were indulgent, but they all loved me equally, even though they knew absolutely everything about me. Then the path turned a corner and I began walking, or rather crawling, in a different direction; now I remembered the time of my youth. The stone boatman decorating the preacher's pulpit came to life and sailed across the waters of my memory, transformed into the only friend of my life's brief springtime. He looked exactly as he did on the lake in xxx, where we swore to love each other forever. A new turn, and sin had swept him into oblivion - I no longer knew him and did not wish to know him. Yet another turn and the time of maturity had arrived. My stockings were worn into holes, my knees were scratched, but I didn't feel any pain - tears of repentance and hope were flowing down my cheeks. And the Lord sent me word, yes He did! A little miracle occurred - I don't know how it happened that in my blindness I only realised it afterwards, when I came back to my cell. I mean my room. As I circled through the labyrinth, no matter which way I turned within it, I could always see the crucifixion with a ray of sunlight falling on it through a stained-glass window, suffusing it with ruby, emerald and sapphire light! And that unearthly radiance made my heart feel so happy, so bright and calm that I wanted to cry and sing, cry and sing...",
    "[Nutscracker] And?",
    "[UGLI 666] Cry and sing.",
    "[Nutscracker] And is that it?",
    "[UGLI 666] Yes, that's more or less everything. When I'd crawled all the way through the labyrinth, the canons were no longer anywhere to be seen. I walked out of the cathedral and found myself in my room.",
    "[Nutscracker] And can you go back into the cathedral now?",
    "[UGLI 666] Its door is locked now.",
    "[Nutscracker] When did they find time to lock it?",
    "[UGLI 666] I don't know.",
    "[Nutscracker] And are you sure you didn't just dream it all, like Ariadne?",
    "[UGLI 666] Yes, I'm sure. The canon gave me a rosary and I'm holding it in my hand. I'm going to take a rest now.",
    "[Monstradamus] Yes, Ugly, take a rest. After all you've been through it will do you good.",
    "[Nutscracker] An interesting crossword puzzle. But from a mystical point of view, how do you explain that at the very centre of the labyrinth of life there lies the letter 'S'?",
    "[Monstradamus] That ought to be clear enough to you of all people, Nutscracker."
  ],
  [
    "[Romeo-y-Cohiba] Isolde, are you there? Isolde!",
    "[Nutscracker] And, to complete the picture, you could say the bubbles of the past were bursting in a helmet that was running 'Sticky Eye' and 'Sunny Kiss' simultaneously.",
    "[UGLI 666] What?",
    "[Monstradamus] Are you still here, Ugly? Take no notice, he's joking.",
    "[UGLI 666] I should never have told you.",
    "[Monstradamus] Don't be offended, Ugly.",
    "[UGLI 666] I'm never going to tell you anything again.",
    "[Monstradamus] Say you're sorry, Nutcracker.",
    "[Nutscracker] For what?",
    "[Monstradamus] Please, say you're sorry."
  ],
  [
    "[Nutscracker] All right. I'm sorry, Ugly.",
    "[UGLI 666] God will forgive you.",
    "[IsoldA] Romeo, where are you? I'm back.",
    "[Romeo-y-Cohiba] I was starting to get worried. Tell me what happened.",
    "[IsoldA] You first."
  ],
  [
    "[Monstradamus] Then why's it called a screen-saviour? What kind of salvation is that?",
    "[Nutscracker] Ugly can ask her canons about that. They know all about saviours and salvation.",
    "[UGLI 666] If that is a blasphemous insult to the Saviour, He'll forgive you for it, you sinful simpleton. But I advise you to leave the Holy Spirit alone.",
    "[Nutscracker] Ah, you're back. Am I correct in suspecting your saviour also doubles up as the creator?",
    "[UGLI 666] That's right.",
    "[Nutscracker] Do you know who he reminds me of? A spiteful little sorcerer who gets the urge to torture a kitten. So he goes down into a deep, dark cellar, moulds a kitten out of clay, brings it to life and then - whack! - he smashes its head against the corner of the wall. And he does that every weekend, a hundred times or more. And to make sure no miaowing is ever heard from the cellar, our sorcerer teaches the kittens to think stoically - I came from the dust and to the dust I return. And he forces them to pray to him for the few seconds of their existence.",
    "[Monstradamus] God only knows what goes on inside that head of yours, Nutcracker.",
    "[UGLI 666] Not God, the devil. That's already a blasphemy against the Holy Ghost, take care Nutcracker. The Lord does not force us to pray to him. We choose our own path, because he created us with free will.",
    "[Nutscracker] Don't make me laugh, Ugly. Free will. Life's like falling off a roof. Can you stop on the way? No. Can you turn back? No. Can you fly off sideways? Only in an advertisement for underpants specially made for jumping off roofs. All free will means is you can choose whether to fart in mid-flight or wait till you hit the ground. And that's what all the philosophers argue about.",
    "[UGLI 666] Nutcracker, you're always trying to turn any conversation into a farting match. I must say sometimes you manage it.",
    "[Monstradamus] Stop it will you, you're like little children. Let's just drop it. Why don't you tell us about this screen-saver, Organism?",
    "[Organizm(-:] It's a standard program. If you don't touch the keyboard for a few minutes, a labyrinth with red-brick walls appears on the screen, with a camera moving through it. It has all sorts of bells and whistles, like stones that turn everything upside down when you bump into them. The ceiling becomes the floor, the floor becomes the ceiling, and the camera starts turning in the opposite direction at the forks in the path. There's a big rat in the labyrinth too. I've actually got two screen-savers like that. The first one appears on the screen when I forget about you lot for a long time. And the second is right outside my door, constructed fairly accurately out of plywood and planks. It even has a rat in it - a kind of little mat with a plush face and paws sewn on to it. Sometimes the rat is lying in the passage. Sometimes it's glued to the ceiling. There are tumble-stones too, blocks of grey plastic. Only they don't turn anything upside down. If you touch one of them, the maze freezes.",
    "[Nutscracker] What do you mean, it freezes?"
  ],
  [
    "[Romeo-y-Cohiba] Listen, you xxx linguist, shut your mouth!",
    "[Nutscracker] It's certainly a frightening metaphor. There's nothing new about succubuses and incubuses, of course, but in this appalling dimension we have the spectral manifestation of a certain Julietristan who manages to take the place of not just one partner, but both at once.",
    "[UGLI 666] And not only in this dimension. Why is fornication such a detestable sin? The Church teaches us it's because the fornicator blinded by lust is really copulating with the laughing devil.",
    "[Organizm(-:] Romeo, did you hear any laughter from behind the wall?",
    "[Nutscracker] How very instructive. The Helmholtz doesn't even know who he's xxx. Or who's xxx him. A drawing on the wall, a few flickers in the eyepieces of the helmet, but the true recipient of his passion remains profoundly anonymous.",
    "[Organizm(-:] I don't quite get it. How does the Minotaur manage to take the place of both partners at once? Are you saying he xxx himself?"
  ],
  [
    "[Monstradamus] Begin what?",
    "[Ariadne] You seem to be worrying about it already. Wait, that's not the right page. Here's the beginning: 'Asterius is everything that is before us and within us, especially \"before\" and \"within\". Irrupting into the mind he simulates this world and our own reason with all its voices, which dispute so convincingly with each other. To understand this means to see Asterius. One may begin with whatever one likes, without worrying about it at all...'",
    "[UGLI 666] Instead of listening to this drivel, shouldn't we perhaps be thinking about what to do in real reality? I didn't like the sound of those words about blood that is about be spilled.",
    "[Ariadne] 'The true hidden name of Asterius, which gives power over him, is Asterius, which is We. For many years the magicians of ancient times cut away the final letters of all the inscriptions so that no one would understand...'",
    "[UGLI 666] We're wasting precious time.",
    "[Ariadne] The next sheet: 'Man is like unto a tree. The thoughts in his head are like the songs of birds in the crown of the tree. How many birds must sing in unison for that which we consider ourselves to appear? And does the tree truly possess a song of its own? Asterius is also created after this fashion...'",
    "[UGLI 666] Someone shut that crazy woman up.",
    "[Ariadne] 'Asterius' greatest secret is that he is entirely unnecessary. He is an incorruptible guard, guarding that which he himself has created against that which he himself has created. For all the severity of his visage and magnificence of his station, all that is created by him, yea and his own self, is pure superfluity, the empty play of mind, a counterfeit golden flourish on the border of the void. And therefore, when within this nothingness set in a richly ornamented frame the menace of necessity suddenly raises its head or implacable battle is joined for the triumph of true values, there arises a spectacle fit to induce laughter unto tears, because in truth all of this from the beginning to the end is entirely pointless...'",
    "[Monstradamus] What's that sound? Can anyone else hear it?",
    "[Ariadne] 'But one must laugh quietly or Asterius will take offence. He does not know that in reality he does not exist, but sometimes he begins to suspect it and this scares and angers him greatly. The means by which for many millennia he has attempted to make himself real are terrible and foolish, like all the mysteries of his world. Although he does not exist, he ends up drenched in sweat and blood, which also do not exist. Though this does not make him any more real, it does mean there is no one left to tell him so - no one is left at his side but servant dwarves, drenching him in blood and screaming that vengeance will follow for the blood that has been spilled...'"
  ],
  [
    "[IsoldA] I can hear it too. It's terrifying.",
    "[Ariadne] 'Asterius should not be feared. If you fear him, it means that you are wearing the helmet of horror and he is master of your world. But once you have removed the helmet, then Asterius disappears, and nothing remains at which to laugh. It is a grave error either to wear the helmet or to remove it. One should do absolutely nothing with it, if only because in reality it does not exist...'",
    "[UGLI 666] Closer and closer, and still this stupid cow just won't...",
    "[Ariadne] 'You are free, and your freedom lies in the fact that the mind has no body, no matter what dwarves in strange hats may tell you. Even the body has no body, and therefore there is nothing on which to set the helmet of horror. But until you have understood this, Asterius is all that you see, feel, think and know. And the crude mechanical farce which the parts of the helmet play out for each other in the transparent void of the mind becomes your entire life. If you are wearing the helmet of horror, it seems that this is for all eternity. But no eternity lasts longer than a fleeting moment. And it is known beforehand what will be when that moment is past - you will recall who you truly are and see that the helmet of horror is merely a toy of your own devising...'",
    "[Nutscracker] What's happening? Help! I think that idiot Romeo...",
    "[Monstradamus] What's going on? What's that rumbling sound?"
  ],
  [
    "[Romeo-y-Cohiba] It's not me. The same thing's happening here. Blows of terrifying power...",
    "[Organizm(-:] The door's giving way.",
    "[UGLI 666] The final hour has come! Repent! I adjure you in the sign of the cross!",
    "[Nutscracker] Would that be the one at the centre of the separator labyrinth?",
    "[UGLI 666] Do not waste your final moments in blasphemy!",
    "[Sartrik] What the hell's going on out there? Stop it!",
    "[IsoldA] Romeo! Goodbye, you bastard!",
    "[Ariadne] My door's getting hot. Are yours?"
  ],
  [
    "[Theseus] Ah?",
    "[Ariadne] Ah?",
    "[UGLI 666] Ah?",
    "[Romeo-y-Cohiba] Ah?",
    "[Theseus] Fuck U",
    "[Monstradamus] MOOOOOO!"
  ],
  [
    "[Theseus] MOOOOOO!",
    "[Ariadne] MOOOOOO!",
    "[UGLI 666] MOOOOOO!",
    "[Romeo-y-Cohiba] MOOOOOO!",
    "[Organizm(-:] Ladies and gents, I don't get it - what was that?",
    "[Nutscracker] I think it's getting cooler. And the noise has stopped."
  ],
  [
    "[Romeo-y-Cohiba] Theseus! How we've longed for you to come!",
    "[Monstradamus] Theseus. At last. Where are you? What do you see around you?",
    "[UGLI 666] Hmmm.",
    "[Organizm(-:] Theseus, answer!",
    "[Nutscracker] Stop it. It's pointless.",
    "[UGLI 666] He's given us the slip.",
    "[Monstradamus] Has he really gone?",
    "[Nutscracker] Yes.",
    "[IsoldA] But of course..."
  ],
  [
    "[UGLI 666] There is no more Minotaur.",
    "[Ariadne] Hang on, papa.",
    "[Monstradamus] My son!",
    "[IsoldA] My son!"
  ],
  [
    "[Nutscracker] And what I've heard is that if anyone's kind then it's precisely because he knows.",
    "[Organizm(-:] What difference does it make to us? How did we give ourselves away?",
    "[UGLI 666] We get distracted. Make too much fuss. Talk off the point, all this stuff about Versailles and Mona Lisa.",
    "[IsoldA] Ugly, you don't mind us living here, do you?",
    "[UGLI 666] This time it was Ariadne who blurted everything out. That's why he gave us the slip.",
    "[Monstradamus] What do you suggest?",
    "[UGLI 666] Not to tell him anything.",
    "[Nutscracker] That's going too far. Then how will he find out he's wearing a helmet? We can't put something that doesn't exist on his head just like that. We have to explain. And it's best to start from childhood. Not so he understands everything, though, just enough for him to do it all to himself. Ariadne's our best guide round the labyrinth. She's very skilful at it.",
    "[UGLI 666] Nutcracker, you're talking about what she ought to do. I'm talking about what she's already done. And anyway, I beg your pardon, but what has skill got to do with it? The labyrinth is any route the Helmholz has been led along.",
    "[Monstradamus] That's right, any route. But it seems like a very long time since anyone walked round your route, Ugly.",
    "[Sartrik] What... What route is that?",
    "[Monstradamus] Back with us again, hero? Ladies and gents, a joke. Imagine Sartrik wakes up with a massive hangover. He can't remember anything about the previous day. There's a pool of blood beside him. He's surrounded by a labyrinth. But there's no Minotaur anywhere. Sartrik raises his eyes to the ceiling and whispers in horror: 'I killed him... Killed him and ate him...'"
  ],
  [
    "[IsoldA] What's funny about that? That's exactly how it happened.",
    "[UGLI 666] Your joke's older than the labyrinth, Monstradamus. Let's discuss the serious situation we're in. Some day Ariadne will be the death of us.",
    "[IsoldA] Stop stirring things up, Ugly. It's not Ariadne's fault at all. Sartrik blurted it all out in a drunken stupor.",
    "[Sartrik] You always blame everything on Sartrik.",
    "[IsoldA] You should be xxx to xxx. Why did you butt in? What for? Lousy drunk."
  ],
  [
    "[Monstradamus] But how did he actually find out the Name?",
    "[UGLI 666] Ariadne gave away the whole thing to him in so many words.",
    "[Nutscracker] Then why hasn't he dissolved the lot of us if he knows the Name?",
    "[Monstradamus] He has. It just seems to us in here that he's dissolved himself.",
    "[UGLI 666] Ariadne, maybe you can explain what made you like him more than us?",
    "[Ariadne] Oh, go to hell. You can lead him round the labyrinth instead of me.",
    "[UGLI 666] I'll come back to you about this. I'll show you up for what you are.",
    "[Romeo-y-Cohiba] I don't understand - who's responsible? Ariadne or Sartrik?",
    "[UGLI 666] Ariadne's to blame. She was beside Theseus in the MINOTAUR and they got too cosy.",
    "[Ariadne] You be careful who you go yapping at. Or you'll wind up lost forever in that cathedral of yours, get it? You're here on my thread. And there isn't any other.",
    "[UGLI 666] Did you all hear that? Did you hear it? Papa, have you thought where we'll all end up when she goes running off to that snake?",
    "[Nutscracker] Don't be such a Cassandra.",
    "[Organizm(-:] What are we going to do here now?",
    "[Monstradamus] What are we going to do? Carry on with the discourse."
  ],
  [
    "[Monstradamus] No, anything but that! No!",
    "[Nutscracker] What? What? No I don't want that either. Nobody does. But why? Why?",
    "[UGLI 666] Stay calm.",
    "[Romeo-y-Cohiba] Don't panic.",
    "[Organizm(-:] Stay calm...",
    "[Monstradamus] Please, no!"
  ],
  [
    "[UGLI 666] Just relax. You're our head, and that goes through first.",
    "[Monstradamus] Wha-a-a! Wha-a-a! Wha-a-a!",
    "[IsoldA] Wha-a-a! Wha-a-a! Wha-a-a!",
    "[Nutscracker] Wha-a-a! Wha-a-a! Wha-a-a!"
  ],
  [
    "[Sartrik] Wha-a-a! Wha-a-a! Wha-a-a!",
    "[Ariadne] Wha-a-a! Wha-a-a! Wha-a-a!",
    "[UGLI 666] Wha-a-a! Wha-a-a! Wha-a-a!",
    "[Romeo-y-Cohiba] Wha-a-a! Wha-a-a! Wha-a-a!",
    "[Ariadne] Hi, little brother. My, but you're ugly.",
    "[Organizm(-:] So what, now we'll be the Minosaur. The ancient serpent."
  ],
  [
    "[UGLI 666] We always were, heh-heh. That human stuff was nothing but a nuisance. And all that bovine stuff too.",
    "[Organizm(-:] We'll be a dragon. We'll fly up to the clouds and dive down to the bottom of the sea. Maybe now things really will be easier.",
    "[Monstradamus] Easier? But we've got Sartrik stuck right in the middle of us. Now we'll feel like puking all the time. Constantly. No matter how deep we dive, no matter who we pretend to be. Even Lolita, even a Rolls-Royce.",
    "[Romeo-y-Cohiba] But what if Sartrik hits the drink so hard that he slips the hook too?"
  ],
  [
    "[Sartrik] I feel sick, xxx.",
    "[Ariadne] I feel sick, xxx. It's time to get out of here...",
    "[UGLI 666] I feel sick, xxx.",
    "[Romeo-y-Cohiba] I feel sick, xxx.",
    "[Sartrik] And my stomach's rumbling, xxx. Listen, Monstradamus. There's one thing I still don't get. Where did all this happen?",
    "[Monstradamus] Are you really that stupid or can you just not sober up? In the helmet of horror."
  ]
]