[
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Ariadne! Good morning?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Good morning."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Did you see the dwarf?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Tell me about it."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "I was in the building on the square in front of the fountain. You remember, I told you about it. It looked dark and oppressive, as though there was a fire there a long time ago and afterwards they tried several times to fix it up, but they hadn't been able to. It was the same inside. It felt like a camouflaged smouldering ruin. I can't even say what it was that gave me the feeling. Everything was new, expensive and chic  -  like in those glass palaces they rent out for offices. The air was cool and clean, there wasn't the slightest smell of burning in it at all. But somehow I felt if you took the oak panels off the walls you'd see all the stonework was blackened with smoke."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "How did you know it was the same building?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "I went across to the window and looked out. Down below me was the fountain with the snakes where I saw Asterisk for the first time. There was a wide street with palms standing in tubs leading away from the fountain. The street ran out to the very edge of the city and ended at a huge triumphal arch strewn with yellow leaves. Standing on the ground in front of the arch was a bronze head that must have been the size of a truck. There was a stepladder leaning against its ear, and it had a gold star on its forehead with an inscription: 'The Tomb of the Unknown Helmholtz'."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "skeptical",
    "text": "How could you see all that through the window?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "I just looked in that direction."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "skeptical",
    "text": "And you could read the words at that distance?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "What distances are there in a dream? There aren't any except the ones you dream about. I dreamed there was that inscription on the monument's forehead. I didn't dream about any distances."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "That's clear enough. What else did you see?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "The further away from the main street, the fewer houses there were. The city boundary was a circular wall, and outside that there was a desert in various tones of beige. Further away still there were dark-blue mountains, or perhaps they were clouds in the sunset. I didn't have time to look at anything else, because then one of the dwarves appeared in the corridor. He was in a hurry to get somewhere and looking quite aggressive  -  his loose robe was caught in with a belt that had a little sabre dangling on it. He didn't stop, just gestured for me to follow him. We began climbing the stairs. I asked him a question, but he told me to keep quiet. He said his master was under threat  -  they wanted to kill him. And so all questions and answers were now being strictly documented. I asked who wanted to kill his master, but he muttered that the reply to that question had to be documented as well. We came to a large open area with identical shelves of files on all the walls  -  it looked like some kind of archive. There was a kind of double round table in the centre  -  about fifty centimetres above the table-top there was a smaller disc of wood that could rotate. They used to have something of the sort in old canteens so that people could move any dish within reach by turning the upper disc. The dwarf sat down at the table and pointed to the place opposite him. I sat down. On the table in front of me there was an inkwell with a genuine goose-quill pen and a file containing sheets of paper. The dwarf had an identical inkwell and file. He told me to write down my question and put the sheet of paper on the wooden disc. I wrote: 'Who wants to kill the Minotaur?' The quill actually wrote very easily, with a fine line. Meanwhile the dwarf took a sheet of paper out of his file and wrote something himself. We put the sheets of paper on the rotating wooden disc, the dwarf turned it through a hundred and eighty degrees, then he had my question in front of him and I had his answer. It was brief: 'You already know'. And it was written on paper headed with a crest. Apparently he didn't even need to read my question, he already knew it."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "skeptical",
    "text": "Paper headed with a crest? What was the crest like?"
  },
  {
    "character": "Ariadne",
    "to": [
      "Nutscracker",
      "Monstradamus"
    ],
    "mood": "calm",
    "text": "A little star framed in laurel leaves. It looked very impressive, you could even feel it with your fingers. Embossing. There was a motto under the crest: 'per aspera ad asterisk'. And there were watermarks in the paper. And as well as all that, there was a three-figure number in the upper right corner of the page  -  the blank sheets were numbered. Monstradamus, I wanted to ask you, what do those words mean?"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "calm",
    "text": "There is an expression 'per aspera ad astra', meaning 'through difficulties to the stars'. And so this version means ..."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "Through xxx to the xxx."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Organizm(-:",
      "Ariadne"
    ],
    "mood": "calm",
    "text": "Well, that's not exactly a poetic translation. What came next, Ariadne?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Next I wrote a question and he wrote an answer. Why don't I type them all out together from the sheets of paper?"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "What do you mean, 'type them out'? Have you got the sheets there?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "How did you get hold of them?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "I don't know. When I woke up they were lying beside the bed. Perhaps the people who tidy up the room brought them."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "And you didn't notice anything?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "Monster, you're like a man who's turned into a bull and is amazed to find he has a bell on his tail."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "skeptical",
    "text": "Is that bit about the bull some kind of a hint?"
  },
  {
    "character": "Ariadne",
    "to": [
      "Monstradamus",
      "Nutscracker"
    ],
    "mood": "resigned",
    "text": "Let me answer your questions and get something to eat, okay? Then you can talk among yourselves."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "calm",
    "text": "Of course, Ariadne."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "contemplative",
    "text": "I've already told you about the first question. Let's move on\nQuestion:\n'How can everything else be manufactured out of nothing?'\nAnswer:\n'See the answer to the next question.'\nNext question:\n'How can the helmet of horror be located inside one of its own parts?'\nAnswer:\n'The helmet of horror fractionates the one thing that is, into the multitude of things that are not. But since the helmet of horror is in no way the one thing that is, it is also one of the multitude of things that are not. And the things that are not may enter into every possible conceivable and inconceivable kind of relationship, since these relationships do not in any case exist anywhere except in the helmet of horror, which does not actually exist itself.'\nQuestion:\n'Does this mean that inside the helmet there is another helmet and in the other helmet there is a third one and so on to infinity in both directions?'\nAnswer:\n'An individual by the name of A may be a part of the helmet of horror worn by B, and an individual by the name of B may at the same time be a part of the helmet of horror worn by A. This is the final infinity in both directions, and often both of them are quite nice people.'\nQuestion:\n'Can you please say something about the occipital braid.'\nAnswer:\n'Longer and thicker suits the girl better.'"
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "sarcastic",
    "text": "All very logical."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "contemplative",
    "text": "Question:\n'How does the separator labyrinth work?'\nJust look what happened then! The dwarf had his answer scribbled out even before I had finished writing my question. He waited for me, then tossed his page on to the upper table-top and began turning it. But halfway round he suddenly stopped it and asked in a considerate voice: 'Are you enjoying your stay as our guest? Be honest.' I told him: 'Not much. In fact, to be quite honest, I'm not enjoying it at all.' Then he let the wooden disc carry on turning and I received a sheet of paper with the answer: 'That's the way it works'."
  },
  {
    "character": "Organizm(-:",
    "to": "Ariadne",
    "mood": "playful",
    "text": "I get it. Good, bad and UGLI. But did you ask him why the helmet of horror is called that? I asked you to, remember?"
  },
  {
    "character": "Ariadne",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "I remember. It was the last question I managed to ask."
  },
  {
    "character": "Organizm(-:",
    "to": "Ariadne",
    "mood": "impatient",
    "text": "Well then?"
  },
  {
    "character": "Ariadne",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "The dwarf asked me to excuse him. He said he'd run out of official paper. But he promised to answer shortly."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "What happened then?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "fearful",
    "text": "We heard some kind of horn or trumpet sounding a low, sinister note. Or it could have been some animal bellowing. The dwarf was so startled he dropped his inkwell on the floor and it broke, making a blue puddle beside the table. He said his master was summoning him to help and he ran off. And as he left he shouted it was possible that blood would soon be spilled, but it would be avenged."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "anxious",
    "text": "Blood?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": [
      "Ariadne",
      "Monstradamus",
      "Nutscracker",
      "Organizm(-:"
    ],
    "mood": "impatient",
    "text": "Are you lot finished yet? When do you think the rest of us could have a chat?"
  },
  {
    "character": "Nutscracker",
    "to": "Romeo-y-Cohiba",
    "mood": "indifferent",
    "text": "Nobody's stopping you, Romeo."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "hopeful",
    "text": "Isolde, are you there?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "Yes. How did you get home yesterday, you beast?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "confused",
    "text": "Why beast?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "What am I supposed to call you after that?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "confused",
    "text": "After what?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "After the way you behaved."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "angry",
    "text": "Me? Me? And just how did I behave?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "Don't pretend to be stupid."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "anxious",
    "text": "Maybe we shouldn't carry on in front of everyone?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "So you're embarrassed of them, but not of me! And you have the cheek to ask me how you behaved? All right, I'll tell you. Like a coarse brute, that's how. Worse than that, like an absolutely shameless and depraved brute who thinks he can get away with anything."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "angry",
    "text": "Well, well. How do you like that! Then let me tell you something. That sickening stunt you pulled yesterday left me feeling like I'd been defiled. It's like I've had some foul substance sprayed into my soul and it fogs up my mind and takes away the desire to go on living."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "On the subject of sprays of filth that take away the desire to go on living, you've hit the nail on the head there. My fingers would have refused to type that. Even though it's exactly what I feel. I never even suspected that such a small opening ..."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "defensive",
    "text": "But what did I do? You did absolutely everything yourself. The only thing I have to reproach myself with is not offering any resistance. Though that was what I really wanted to do, even before it really began to hurt."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "How can you lie so brazenly? But then, what else can I expect from you?"
  },
  {
    "character": "Monstradamus",
    "to": [
      "Romeo-y-Cohiba",
      "IsoldA"
    ],
    "mood": "calm",
    "text": "Pardon me for butting in, I know you can't stand it. But perhaps I could set you thinking in a new direction. On the map that Isolde saw in the park it said 'Plan of the labyrinth at Versailles'. But the telephone booth that Romeo was calling her from is located, if we can believe the plaque, in a suburb of London. Do you see what I'm driving at?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "skeptical",
    "text": "I wouldn't take those signs seriously. The Versailles outside Isolde's door is about as real as Romeo's London. Ugly would say the devil has us all exactly where he wants us. And she'd be absolutely right."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "I wouldn't argue with that. But every dimension has its own intrinsic laws. And even if we are somewhere in the suburbs of Hell, when one person sees 'Versailles' and another sees 'London', there's good reason to assume the devil's holding them in different places."
  },
  {
    "character": "IsoldA",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "What gibberish."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Monstradamus",
    "mood": "skeptical",
    "text": "That's way over the top."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Romeo-y-Cohiba",
      "IsoldA"
    ],
    "mood": "curious",
    "text": "But really, Romeo and Isolde, what made you think you were close to each other?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Monstradamus",
    "mood": "resigned",
    "text": "Everything around us is the same."
  },
  {
    "character": "Nutscracker",
    "to": "Romeo-y-Cohiba",
    "mood": "skeptical",
    "text": "What exactly? Bushes? Bushes are the same everywhere."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Romeo-y-Cohiba",
      "Nutscracker"
    ],
    "mood": "sarcastic",
    "text": "Especially the word 'bushes' on two different screens."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Monstradamus",
    "mood": "defensive",
    "text": "Even the soil under our feet is the same colour. Beige."
  },
  {
    "character": "Monstradamus",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "Beige  -  what colour is that?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "How do you mean, what colour?"
  },
  {
    "character": "Monstradamus",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "Can you describe it some other way?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Monstradamus",
    "mood": "indifferent",
    "text": "Dark-brown."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "angry",
    "text": "What's that  -  dark-brown? Beige is light yellow-grey!"
  },
  {
    "character": "Nutscracker",
    "to": [
      "Romeo-y-Cohiba",
      "IsoldA"
    ],
    "mood": "sarcastic",
    "text": "Right. So now we know. Romeo set off to meet Isolde and bumped into Juliet. Isolde set out to meet Romeo and ended up in Tristan's clutches. If we imagine that Juliet and Tristan are the same person ... Although in this case we can hardly call it a real 'person'. More like an empty mask. Or maybe a 'helmet'?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "Listen, you xxx linguist, shut your mouth!"
  },
  {
    "character": "Nutscracker",
    "to": "Romeo-y-Cohiba",
    "mood": "contemplative",
    "text": "It's certainly a frightening metaphor. There's nothing new about succubuses and incubuses, of course, but in this appalling dimension we have the spectral manifestation of a certain Julietristan who manages to take the place of not just one partner, but both at once."
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "calm",
    "text": "And not only in this dimension. Why is fornication such a detestable sin? The Church teaches us it's because the fornicator blinded by lust is really copulating with the laughing devil."
  },
  {
    "character": "Organizm(-:",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "Romeo, did you hear any laughter from behind the wall?"
  },
  {
    "character": "Nutscracker",
    "to": "Romeo-y-Cohiba",
    "mood": "sarcastic",
    "text": "How very instructive. The Helmholtz doesn't even know who he's xxx. Or who's xxx him. A drawing on the wall, a few flickers in the eyepieces of the helmet, but the true recipient of his passion remains profoundly anonymous."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "I don't quite get it. How does the Minotaur manage to take the place of both partners at once? Are you saying he xxx himself?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "contemplative",
    "text": "No. With Romeo he's Isolde, and with Isolde he's Romeo. But what you said is an even more interesting idea. Well worth thinking about."
  },
  {
    "character": "Nutscracker",
    "to": [
      "Romeo-y-Cohiba",
      "IsoldA"
    ],
    "mood": "playful",
    "text": "Well, lady and gent, pardon my lack of modesty, but what exactly did happen in the pavilion? My imagination blushes and fails me. Nothing that comes to mind is worthy of the emotions that we have observed. 'Oh, it's very hard to come with your finger up your bum' or the last tango in Paris. I'm thinking in banal terms, of course. Romeo, can you elaborate?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "Yes, I can. If you stick your nose into our lives once more, I'll find you and xxx you so hard your brains will be thinking their filthy thoughts across the wall, understand?"
  },
  {
    "character": "Nutscracker",
    "to": "Romeo-y-Cohiba",
    "mood": "sarcastic",
    "text": "I wonder exactly how you plan to find me? I'm not Isolde  -  there's no trapdoor between us. There wasn't even one between you two, as it happened ..."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "Just remember that if I look hard enough I might just find one."
  },
  {
    "character": "Nutscracker",
    "to": "Romeo-y-Cohiba",
    "mood": "sarcastic",
    "text": "I don't understand what you're getting so het up about. Did the knife slip when they were circumcising your cochiba ? It wasn't me, you half-wit, it was your Julistan."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "That's it. Nutcracker, I'm on my way to kill you."
  },
  {
    "character": "Nutscracker",
    "to": "Romeo-y-Cohiba",
    "mood": "indifferent",
    "text": "I couldn't give a xxx. I'm wearing a helmet of horror."
  },
  {
    "character": "Ariadne",
    "to": [
      "Romeo-y-Cohiba",
      "Nutscracker"
    ],
    "mood": "caring",
    "text": "There's no need to be like that."
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "sarcastic",
    "text": "Julistan  -  it sounds like the name of some small but highly malevolent state located at the very centre of the axis of evil."
  },
  {
    "character": "Ariadne",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "By the way, I've seen that word  -  Julistan."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Where?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "In that place where I was asking the dwarf questions. The archive."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "skeptical",
    "text": "You didn't say anything about that."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "When the dwarf ran off, I was left in the archive alone. At first I went on sitting at the table, waiting for him to come back. But he was gone for ages and ages. Then I got up and went over to look at the shelves of files along the walls. There were all sorts of different things on them. Depositions from the Minotaur's defeated enemies. Interrogations of Minotaurs by other Minotaurs. An entire shelf full of records of cross-examinations of Minotaurs by themselves  -  they were called 'Alone Together'. They must have been thinking of the horns, right? But the biggest number of files was filled with answers to the so-called eternal questions like the ones you and I were asking. They were all old and yellow with age and covered in dust. Do you know what paper covered with writing smells like when the people who wrote on it are already dead?"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Do you remember anything?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "I have a whole pile of pages here from various files. When I woke up they were lying beside the dwarf 's answers. There's not much new in them. The eternal questions haven't got any cleverer  -  that's why they're eternal."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Read us something."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "Question:\n'Why does the existent exist?'\nAnswer:\n'To pass the time more pleasantly.'\nQuestion:\n'Why heap up so many events and beings to pass the time if in any case nowhere exists except in the helmet of horror?'\nAnswer:\n'Events and beings also cannot be accumulated anywhere except in the helmet of horror, so Mesdames et Messieurs are requested not to be concerned.' What's next ... About the separator labyrinth ... 'But who ...' Right, that's it: 'Who else is produced there?' A couple of pages from some review of historical chronicles. An analysis of contradictions. One text says the Minotaur himself is the builder of the labyrinth. Another claims the labyrinth was built by eighteen thousand Minotaurs divided into two columns. A third claims these columns should be understood metaphorically and the labyrinth is created by the two mental nodules or hemispheres, which are symbolised by the two horns. And so on. And here at the end there are a few pages about this Julistan. They look quite different, really ancient and faded. Many of them are so old I can hardly make anything out. Covered with strange, beautiful handwriting. They're translations of inscriptions from the Julistan caves. The actual inscriptions were destroyed long ago, together with the caves themselves, and all that's left are copies of copies. Fragmentary translations. Some are short and incoherent, some are a bit longer. Shall I read some?"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "calm",
    "text": "Certainly."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "'One may begin with whatever one likes, without worrying about it at all ...'"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "Begin what?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "You seem to be worrying about it already. Wait, that's not the right page. Here's the beginning: 'Asterius is everything that is before us and within us, especially \"before\" and \"within\". Irrupting into the mind he simulates this world and our own reason with all its voices, which dispute so convincingly with each other. To understand this means to see Asterius. One may begin with whatever one likes, without worrying about it at all ...'"
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "anxious",
    "text": "Instead of listening to this drivel, shouldn't we perhaps be thinking about what to do in real reality? I didn't like the sound of those words about blood that is about be spilled."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "'The true hidden name of Asterius, which gives power over him, is Asterius, which is We. For many years the magicians of ancient times cut away the final letters of all the inscriptions so that no one would understand ...'"
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "anxious",
    "text": "We're wasting precious time."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "The next sheet: 'Man is like unto a tree. The thoughts in his head are like the songs of birds in the crown of the tree. How many birds must sing in unison for that which we consider ourselves to appear? And does the tree truly possess a song of its own? Asterius is also created after this fashion ...'"
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "angry",
    "text": "Someone shut that crazy woman up."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "'Asterius' greatest secret is that he is entirely unnecessary. He is an incorruptible guard, guarding that which he himself has created against that which he himself has created. For all the severity of his visage and magnificence of his station, all that is created by him, yea and his own self, is pure superfluity, the empty play of mind, a counterfeit golden flourish on the border of the void. And therefore, when within this nothingness set in a richly ornamented frame the menace of necessity suddenly raises its head or implacable battle is joined for the triumph of true values, there arises a spectacle fit to induce laughter unto tears, because in truth all of this from the beginning to the end is entirely pointless ...'"
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "anxious",
    "text": "What's that sound? Can anyone else hear it?"
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "'But one must laugh quietly or Asterius will take offence. He does not know that in reality he does not exist, but sometimes he begins to suspect it and this scares and angers him greatly. The means by which for many millennia he has attempted to make himself real are terrible and foolish, like all the mysteries of his world. Although he does not exist, he ends up drenched in sweat and blood, which also do not exist. Though this does not make him any more real, it does mean there is no one left to tell him so  -  no one is left at his side but servant dwarves, drenching him in blood and screaming that vengeance will follow for the blood that has been spilled ...'"
  },
  {
    "character": "IsoldA",
    "to": "",
    "mood": "fearful",
    "text": "I can hear it too. It's terrifying."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "'Asterius should not be feared. If you fear him, it means that you are wearing the helmet of horror and he is master of your world. But once you have removed the helmet, then Asterius disappears, and nothing remains at which to laugh. It is a grave error either to wear the helmet or to remove it. One should do absolutely nothing with it, if only because in reality it does not exist...'"
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "anxious",
    "text": "Closer and closer, and still this stupid cow just won't ..."
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "'You are free, and your freedom lies in the fact that the mind has no body, no matter what dwarves in strange hats may tell you. Even the body has no body, and therefore there is nothing on which to set the helmet of horror. But until you have understood this, Asterius is all that you see, feel, think and know. And the crude mechanical farce which the parts of the helmet play out for each other in the transparent void of the mind becomes your entire life. If you are wearing the helmet of horror, it seems that this is for all eternity. But no eternity lasts longer than a fleeting moment. And it is known beforehand what will be when that moment is past  -  you will recall who you truly are and see that the helmet of horror is merely a toy of your own devising ...'"
  },
  {
    "character": "Nutscracker",
    "to": "",
    "mood": "anxious",
    "text": "What's happening? Help! I think that idiot Romeo ..."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "anxious",
    "text": "What's going on? What's that rumbling sound?"
  },
  {
    "character": "Nutscracker",
    "to": "",
    "mood": "fearful",
    "text": "I think he really has found me. If it's him. Someone's hammering like hell on the door from the outside. Or it ..."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "",
    "mood": "fearful",
    "text": "It's not me. The same thing's happening here. Blows of terrifying power ..."
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "fearful",
    "text": "The door's giving way."
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "desperate",
    "text": "The final hour has come! Repent! I adjure you in the sign of the cross!"
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "sarcastic",
    "text": "Would that be the one at the centre of the separator labyrinth?"
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "Do not waste your final moments in blasphemy!"
  },
  {
    "character": "Sartrik",
    "to": "",
    "mood": "angry",
    "text": "What the hell's going on out there? Stop it!"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "sad",
    "text": "Romeo! Goodbye, you bastard!"
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "anxious",
    "text": "My door's getting hot. Are yours?"
  },
  {
    "character": "Nutscracker",
    "to": "",
    "mood": "anxious",
    "text": "I'm stifling. Something ..."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "fearful",
    "text": "It's him!"
  },
  {
    "character": "Theseus",
    "to": "",
    "mood": "angry",
    "text": "MINOTAURUS!"
  },
  {
    "character": "Monstradamus",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?"
  },
  {
    "character": "IsoldA",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?"
  },
  {
    "character": "Nutscracker",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?"
  },
  {
    "character": "Organizm(-:",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?",
    "alias": "Organizm(-"
  },
  {
    "character": "Theseus",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?"
  },
  {
    "character": "Ariadne",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?"
  },
  {
    "character": "UGLI 666",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Theseus",
    "mood": "surprised",
    "text": "Ah?"
  },
  {
    "character": "Theseus",
    "to": "",
    "mood": "angry",
    "text": "Fuck U",
    "alias": "TheZeus"
  },
  {
    "character": "Monstradamus",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!"
  },
  {
    "character": "IsoldA",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!"
  },
  {
    "character": "Nutscracker",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!"
  },
  {
    "character": "Organizm(-:",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!",
    "alias": "Organizm)-"
  },
  {
    "character": "Theseus",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!"
  },
  {
    "character": "Ariadne",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!"
  },
  {
    "character": "UGLI 666",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Theseus",
    "mood": "fearful",
    "text": "MOOOOOO!"
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "confused",
    "text": "Ladies and gents, I don't get it  -  what was that?"
  },
  {
    "character": "Nutscracker",
    "to": "",
    "mood": "calm",
    "text": "I think it's getting cooler. And the noise has stopped."
  },
  {
    "character": "IsoldA",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "What, don't you understand? It's Theseus!"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "Theseus",
    "mood": "joyful",
    "text": "Theseus! How we've longed for you to come!"
  },
  {
    "character": "Monstradamus",
    "to": "Theseus",
    "mood": "curious",
    "text": "Theseus. At last. Where are you? What do you see around you?"
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "contemplative",
    "text": "Hmmm."
  },
  {
    "character": "Organizm(-:",
    "to": "Theseus",
    "mood": "impatient",
    "text": "Theseus, answer!"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "skeptical",
    "text": "Stop it. It's pointless."
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "resigned",
    "text": "He's given us the slip."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "anxious",
    "text": "Has he really gone?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "IsoldA",
    "to": "",
    "mood": "sarcastic",
    "text": "But of course ..."
  },
  {
    "character": "UGLI 666",
    "to": "",
    "mood": "calm",
    "text": "There is no more Minotaur."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "caring",
    "text": "Hang on, papa."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "loving",
    "text": "My son!"
  },
  {
    "character": "IsoldA",
    "to": "",
    "mood": "loving",
    "text": "My son!"
  },
  {
    "character": "Nutscracker",
    "to": "",
    "mood": "loving",
    "text": "My son!"
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "loving",
    "text": "My son!",
    "alias": "Organizm(-"
  },
  {
    "character": "Sartrik",
    "to": "",
    "mood": "loving",
    "text": "My son(-:"
  }
]