[
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Ariadne, are you awake already?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "Where are all the others?"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "I don't know. Sleeping, I suppose. Well then? Did you dream about anything?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Tell me about it."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "It was like a lecture. I was sitting in a lecture hall in some educational institution - a technical college to judge from all the pieces of equipment standing along the walls. I can't say what kind of equipment it was, some pieces had screens like televisions, others looked like scales with a lot of springs and counterweights. The lecture hall looked like an amphitheatre - it sloped down to a board and standing there beside it was the same dwarf who spoke to me by the fountain. Apart from us two, there was no one there. The entire board was covered by a complicated diagram of some kind of device."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Can you remember what came before that? How you got there?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "No. The dwarf waved to me as if I was an old friend and told me they had heard about our wish to discover what was on their master's mind. He said that would be the subject of the lecture. Everything that happened seemed to be perfectly natural, and I didn't feel like I needed to ask any questions. Although there were lots of strange things. For instance, the diagram wasn't drawn on the board with chalk. It was carved into it, like an engraving. I realised that because when the dwarf wanted to correct something in the drawing he took a chisel and began stripping long shavings of plastic off the board and leaving bright lines on it."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "What was it a diagram of?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "It was Asterisk's mind."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "His mind?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "Yes. The diagram was called 'the helmet of horror' - it was written in big letters above the drawing. But the dwarf repeated very insistently several times that it wasn't any kind of hat or apparatus, but precisely a mind, although everything about it looked like a drawing of some machine. The main body of the machine was shaped like a helmet. And there was an identical helmet standing on the demonstration table - an ancient bronze headpiece, and underneath it a visor with holes in it curving back inside."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "What do you mean by 'curving back inside'?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "Its lower section ran back inside the helmet through a slit in the middle of the face. And there were some kind of side plates too - everything was very old, green with age. It looked like a Roman gladiator's helmet - like a bronze hat with a visor. Only this one had horns as well. They came out of the upper section of the helmet and curved backwards. I'd already seen that on the square by the fountain, when Asterisk walked by, only his helmet was bigger and more complicated, with lots of different wires and tubes. The dwarf said this one was a simplified model. What he told me sounded really peculiar."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Can you tell me about it?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "I remember that the helmet of horror consisted of several major parts and a lot of secondary ones. The parts had strange names: the frontal net, the now grid, the separator labyrinth, the horns of plenty, Tarkovsky's mirror and so forth. The largest element consisted of the now grid and the frontal net. It had two parts that were sometimes fused into a single unit. Its external part, the net, looked like a visor with holes in it, and its internal part, the grid, divided the helmet into an upper section and a lower one, so there was no way you could squeeze even the smallest head into it. The dwarf said the now grid separates the past from the present, because it is the only place where what we call 'now' exists. Hence the name. The past is located in the upper section of the helmet, and the future in the lower section."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "That doesn't seem logical somehow. Maybe it's the other way round?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "No, I definitely remember that. After that the dwarf began explaining how the helmet works. He said you had to grasp the essence of the matter first before going into the details. The helmet's operating cycle has no beginning, so it can be explained starting from any phase. And so, he said, start by imagining the gentle glow of a summer day caressing your face. That's precisely how the frontal net, heated by the action of the stream of impressions falling on it, transmits heat to the now grid. The grid sublimates the past contained in the upper section of the helmet, transforming it into vapour, which is driven up into the horns of plenty by the force of circumstances. The horns of plenty emerge from the forehead, curve round the sides of the helmet and intertwine to form the occipital braid, which descends into the base of the helmet. There, below the now grid, the bubbles of hope that arise in the occipital braid are ejected into the region of the future. As they rise, these bubbles burst against the now grid, generating the force of circumstances, which induces the stream of impressions in the separator labyrinth. And the stream of impressions, in turn, is shattered against the frontal net, heating the now grid and renewing the energy of the cycle. The heat he was speaking about when he used the verb 'to heat' is different from the kind of heat you get from fire, more like the kind you get from love. He said he was simply using an analogy with something I knew about, so I would be able to imagine what happens. And in the same way the stream of impressions doesn't actually flow anywhere, the bubbles of hope aren't really bubbles at all, and so on."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "I couldn't really say I understood all of that."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "I didn't understand anything at first either, and the dwarf told me to ask questions. I didn't know where to begin, because everything was equally hard to understand. The last thing he'd mentioned was the bubbles of hope, so I asked why they were called that. The dwarf was a bit embarrassed and said it was the official name, like a formal title. In actual fact it's not always hope at all, he said, it's more likely to be fear and apprehension, suspicion and hate, all sorts of nonsense, in fact any of the cud that is chewed on with such habitual stupidity by ... But then he broke off, glanced round furtively and muttered something about that not being the right way to put it. And then he went on in the formal lecturer's voice he'd been using before and said that technically speaking it was correct to call them bubbles of the past. And they were called bubbles because their constant tendency is to expand and occupy the entire volume of the helmet, preventing anything else from appearing in it and leaving no space or opportunity for the recognition of what is actually happening. The dwarf jabbed his pointer at the part of the diagram that showed the kind of vertical coil the horns formed where they came together at the back of the helmet and said that bubbles of hope arise in the occipital braid following the enrichment of past in the horns of plenty. But since past is enriched exclusively with more past, the bubbles of hope consist entirely of past, they are simply past in a different state. Which means that when Asterisk peers into the future, he sees nothing but the past. The lower section of the helmet is required primarily in order to cool the bubbles of hope, a process which endows them with vernal freshness and the elastic resilience of novelty. As they break against the now grid, they generate the force of circumstances, which lifts the past out of the upper section of the helmet into the entry chamber of the horns of plenty and forces it through the separator labyrinth, where the stream of impressions arises."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "What is the separator labyrinth?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "It's a kind of plate with wavy slits in it located in the region of the forehead, in front of the entry chamber of the horns of plenty. The separator labyrinth is the most important part of the helmet of horror. It's the place where everything else is produced out of nothing, that is, the place where the stream of impressions arises. And it's also the place where the past, the present and the future are separated. The past moves upwards, the future moves downwards, and the present, in the form of the stream of impressions, falls on to the outer surface of the frontal net, generating the cycle's passionate desire to recur, so that it becomes a kind of perpetuum mobile ."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "Hang on a moment. The bubbles of hope are just another state of past, right?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes, that's the way I understood it."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "But after they break, you get past, present and future?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "That's right."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "That means it's past that decomposes into past, present and future?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "In actual fact the whole cycle is simply the circulation of now in various states of mind, in the same way that water can be ice, or the sea, or thirst."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "But how does the stream of impressions arise in the separator labyrinth?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Under the force of circumstances."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "I see. But no, hang on. The separator labyrinth is inside the helmet?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "You said the stream of impressions falls on to the outer surface of the helmet. But how can that happen, if it arises inside?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "I asked about that too. The dwarf laughed and said that was merely an apparent contradiction. The point is, he explained, the 'inside' and 'outside' I was talking about have no existence in themselves. They are generated in the separator labyrinth by the force of circumstances and from there they enter the horns of plenty, where they enrich the past, transforming it into the state of bubbles of hope. But since there is no 'inside' and 'outside' anywhere except in the horns of plenty, the stream of impressions can quite easily arise inside the helmet and fall on to it from the outside. And the same applies to everything else as well. But the dwarf warned me that I should never under any circumstances regard anything as real. The entire phenomenon is induced, like the electromagnetic field in a transformer."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Aha. Then what is Tarkovsky's mirror?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "It's a small, fogged-up mirror set at an angle of forty degrees between the region of the future and the now grid. When the bubbles of hope entering from below are reflected in it they appear to be further along the line of their course than they are, which gives rise to the feeling that the line actually exists."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "I see. And why is the separator labyrinth the most important section of the structure?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "Firstly, it's where the stream of impressions arises. Secondly, it's where 'I' and 'you', good and bad, right and left, black and white, so on and so forth and everything else arises. The dwarf said this part of the helmet of horror is the most important and it hasn't changed for thousands and thousands of years. Then just at that moment a ray of sunlight lit up a poster hanging beside the board. It showed a Cretan coin with a diagram of a labyrinth stamped into it. Most opportune, said the dwarf, that is the separator labyrinth. Its appearance is very distinctive. It has a cross section at the centre, which is reached immediately after entry, and numerous parallel paths running around the cross which seem at first to lead you off into the unknown but then come full circle. This is the most widespread image of the labyrinth, the one that is repeated on almost all the antique coins and drawings. The scanned projection of this labyrinth is a straight line, which means that once you've entered it there's no way you can get lost or find your way out. And that means we can regard the horns of plenty, the now grid, the separator labyrinth, the past and future as different sections of one and the same continuous route, which no one is actually following."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Why are the horns of plenty called that?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "Because they contain all sorts of everything - tender feelings, sidelong glances, exalted words, final thoughts and everything else. A genuine treasure house or rubbish tip. But all this infinite variety actually consists entirely of past. As far as I could understand it, the horns of plenty operate like enrichment units in a chemical plant. When it's driven through them by the force of circumstances, past gets mixed up with everything else, becoming richer and acquiring value, with the result that bubbles of hope are produced in the occipital braid, go gurgling through the region of the future, are reflected in Tarkovsky's mirror and perceived as the novel freshness of a brand new day."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "For a while now I've been getting the feeling something's not right here, but I just can't quite put my finger on it. Right, now I think I've got it! Who are they perceived by?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Who? By Asterisk, of course."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "That's it! But where is he, this Asterisk? The way I understand it, this helmet is arranged so you can't even squeeze your fist inside it, never mind your head. I don't suppose you asked about that?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "No, I didn't, the dwarf told me himself. Asterisk comes into being in the same place as everything else. In the separator labyrinth."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "And then what?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "And then the force of circumstances induces him to enter the horns of plenty, he gets mixed up with everything else, is enriched and returns to the now grid in the form of bubbles of hope."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "confused",
    "text": "You don't understand. I want to know about the subject of perception of all this xxx. Its ultimate subject. Can't you understand that? Where is he?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "I really don't understand what an ultimate subject of perception is. But there can't be any doubt that he must be in the horns of plenty, because there just isn't anywhere else."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Then where does he come from?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "From the separator labyrinth. Like everything else."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "resigned",
    "text": "Then what's the point of the whole business?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "resigned",
    "text": "I don't know."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "All right. Let's try it a step at a time. Where does perception arise?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "It's produced in the separator labyrinth."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "From what?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "From the past. It was there in the past, wasn't it?"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "calm",
    "text": "It was."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "Then why should it suddenly disappear from the present and the future?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "Where's Nutcracker got to? I can't make sense of all this on my own."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "I'm following your discussion with intense interest."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Ariadne",
      "Nutscracker"
    ],
    "mood": "confused",
    "text": "My helmet of horror's about to overheat. Let me put the question a different way. If Asterisk, perception and everything else are produced in the separator labyrinth, then why do we say that it's Asterisk who perceives them?"
  },
  {
    "character": "Ariadne",
    "to": [
      "Monstradamus",
      "Nutscracker"
    ],
    "mood": "calm",
    "text": "The dwarf said that is simply his specific quality as a product. In other words, the idea that he perceives everything is produced in the separator labyrinth together with everything else."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Produced from what?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "From nothing. You haven't been listening properly."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "All right. Then I have a question as well. You say Asterisk appears in the separator labyrinth."
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "That's right."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "And instead of a head he has the helmet of horror?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "confused",
    "text": "But then that means the helmet of horror appears in the separator labyrinth, which is located inside the helmet itself?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Yes, it does."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "confused",
    "text": "But the helmet has to be bigger than one of its parts. How can it be located inside one of its own components?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "The dwarf said 'inside' and 'outside' only exist in the horns of plenty. The same thing applies to 'bigger' and 'smaller'. The horns contain absolutely everything you could possibly imagine and everything else as well."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "confused",
    "text": "But in that case even the helmet only exists in these horns of plenty?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Yes, I think so."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "confused",
    "text": "Whichever way you look at it, that means the helmet of horror arises inside one of its own component parts. But it exists inside a different one. Where's the sense in that?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Where? In the horns of plenty, of course."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "confused",
    "text": "Ariadne, are you serious?"
  },
  {
    "character": "Ariadne",
    "to": [
      "Nutscracker",
      "Monstradamus"
    ],
    "mood": "resigned",
    "text": "Yes, probably. Or perhaps not. To be quite honest, I'm tired. If I meet the dwarf, I'll make sure I ask him about everything. You think up some questions."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Hang on a moment. How did the dream end?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "After the lecture I went out into the corridor. There was no one there, just a big mirror in a semicircular frame on the wall. I went over and looked into it and woke up."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "What did you see in it?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Myself."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "And nothing unusual?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "anxious",
    "text": "I was wearing a straw hat with a round crown and two little bunches of lilies-of-the-valley pinned to the brim at the back. The hat had a veil of thick lace with round holes, so I couldn't see my face behind it at all. It all looked very beautiful, but something made me feel nervous. I couldn't work out what was wrong until suddenly I recognised that bronze mask in my reflection and that frightened me, and then the dream suddenly ended. That's all. I'm going."
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "proud",
    "text": "I thought from the very beginning that goon must be wearing a virtual reality helmet. Honest I did."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "sarcastic",
    "text": "That's not any kind of virtual reality helmet; it's some kind of fancy pressure cooker. Games for children. I ought to know how a virtual reality helmet works when grown-ups put one together, and this is nothing like it."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "And how does it work?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "Maybe I don't understand too well which way the current flows and what it's transformed into and all, but I do know perfectly well what someone in one of those helmets sees and thinks, because I've dealt with it as a professional, by studying the problem of choice in an interactive environment. We worked with those helmets all the time."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "I've never heard of that problem. What is it?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "contemplative",
    "text": "Well, imagine you decide for yourself who's going to shoot who when you're watching an action movie. If you decide the main hero gets killed in the first shootout, then what happens to the rest of the plot? If you had genuinely free choice, the results could be pretty miserable. But art is supposed to make us happy, not miserable."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "That's for sure. And even when it does make us miserable, we should feel happy in our misery."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "That's right! So there never is any genuine interactivity, only the appearance of it. Or rather, it is permitted, but only within a narrow range where no choice you make can change the fundamental situation. The main problem is to eliminate freedom of choice so that the subject is led unerringly to make the decision required, while at the same time maintaining his firm belief that his choice is free. In scientific terms it's known as coercive orientation."
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "What's that?"
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "calm",
    "text": "That's a long story."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "We don't have much else to occupy ourselves with."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "hopeful",
    "text": "That's right. Tell us about it, Nutcracker. Let's give our brains a break."
  },
  {
    "character": "Nutscracker",
    "to": "",
    "mood": "curious",
    "text": "I suppose there's no need to explain what the Helmholtz sees?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "Who?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "In professional jargon that's what they call the guy in the helmet. A Helmholtz is someone who's located in an artificial dimension that totally isolates him from the real world and moves around in it, or rather, thinks he moves around in it. Let's assume this dimension takes the form of a flat area with three identical marble vases standing on it. And what we have to do to keep the action moving in the right direction is to lead the Helmholtz to the middle vase."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "Three identical marble vases. Hardly makes it worth bothering to put the helmet on."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "Instead of vases they could be doors, turns at a road junction, any kind of choice at all in fact. It's not important. Everything you see in the helmet is computed by a special program and the program can be set up so that, every time, the Helmholtz makes the same choice we made for him earlier."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "skeptical",
    "text": "Sure, you can fix the program, but not the experimental subject. He's got his own programming."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "That's the whole point. When the helmet and the Helmholtz fuse into a single whole, you can edit the reader as well as the book, if you get my meaning. That's why we say editing technology can be external or internal. Although there's no clear boundary between them, of course."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "Come again?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "External technologies affect what we see, internal technologies affect what we think."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "How about an example?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "The simplest external editing program is 'Sticky Eye'. That's when, as you turn your head, one of the vases gets stuck in the field of vision and lingers there longer than it should."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "But what about the two other vases? They're standing next to it. According to the laws of perspective ..."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "How perspective operates inside the helmet is decided by us and our client."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "joyful",
    "text": "A mathematical weight. That's beautiful."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "The next technology up is 'Pavlov's Bitch'. That's an intermediate conditioned reflex editor."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "So it's named after that Russian scientist who noticed his stomach juices started flowing when the phone rang?"
  },
  {
    "character": "UGLI 666",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "No he didn't, he just studied conditioned reflexes in dogs."
  },
  {
    "character": "Nutscracker",
    "to": [
      "UGLI 666",
      "Organizm(-:"
    ],
    "mood": "calm",
    "text": "I didn't invent the name. When you look at the vases that we want to exclude from your list, your vision starts blurring and rippling and you get a horrible buzzing in your ears, or even an electric shock. So you won't look at them again."
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "skeptical",
    "text": "But you'd notice that straightaway."
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "calm",
    "text": "We want you to notice it straightaway, draw the right conclusion and look in the right direction in future. It's a cheap technology for third-world countries. But if the budget's big enough, then for instance we can use infrasonics. The Helmholtz won't notice anything, but he'll experience a dark, mysterious horror when he turns towards any vase except the one we want. The obverse method is stimulation of the pleasure centre when the correct choice is made. They used to insert an electrode, but now it's done by pharmacological means or by entraining the brain to delta rhythms."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "anxious",
    "text": "You don't say. Are you telling me they'll be doing all that stuff to us if we watch interactive movies?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "I don't think so. These techniques weren't developed for the movies, not even for virtual spaces. They were just modelled there. The topic is not in the public domain. But since you and I aren't in the public domain either, I suppose it's okay for me to tell you about it."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "So what are the internal editing programs like?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "Well, for instance, take 'Sunny Kiss'. The vase we have to choose is endowed with positive emotional coloration by employing universally accepted aesthetic codes, given a positive inner content, if you like."
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "Inner content. Would that be inside the vase or inside the viewer?"
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "calm",
    "text": "That's a difficult question. You could say it's inside the helmet. But all that's just words. It's easier for me to explain how it's done. Say a ray of sunlight falls on our vase, or you hear a soulful melody in the air when it enters your field of view. The reverse technique is 'Doom and Gloom'. For instance, when you look at a vase we don't like, the sun is covered by dark clouds, a grey fog comes down and you hear unpleasant noises."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "Fair enough. What else?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "There's another technology called 'The Seventh Seal'. The vase that has to be chosen is marked out using secret signs that attract interest or stimulate the imagination. It can be absolutely anything - a hand print on its surface, arrows pointing to it on the ground, a dove sitting on its edge, mysterious graffiti, and so on and so forth. The obverse method is 'The Le Pen Club'. That's when the vases we wish to exclude are covered in the crudest obscenities you can imagine, preferably not even in paint, but xxx. Virtual, of course."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "And you mean the Helmholtz won't notice anything?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "Used on its own, any one of the techniques used is easy enough to spot. But if the methods are combined together in a subtle fashion and always applied in rotation at a level of intensity just on the border line of perception, you get practically a hundred per cent precise manipulation combined with total imperceptibility."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "I get it. It's like what you see at the railway stations in Asia. When a passenger thinks it's the tumbler-gambler who's going to cheat him but actually everyone playing the game is in on the swindle even though they're arguing with each other all the time, maybe even fighting."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "Exactly. Only in our case absolutely everybody in the station is in on it, including the stone Atlantes by the main entrance."
  },
  {
    "character": "Ariadne",
    "to": [
      "Nutscracker",
      "Romeo-y-Cohiba",
      "IsoldA"
    ],
    "mood": "joyful",
    "text": "How clever you are, Nutcracker. After I listened to you I wrote a poem. It's dedicated to you, Romeo and Isolde. Shall I read it?"
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "calm",
    "text": "Go on."
  },
  {
    "character": "Ariadne",
    "to": [
      "Nutscracker",
      "Romeo-y-Cohiba",
      "IsoldA"
    ],
    "mood": "playful",
    "text": "Beyond the window-pane on Doom and Gloom\nOld Pavlov's Bitch's Sticky Glance is glued.\nMy Minotaur! Creep silently into my room\nBeckon me with a glance, brazenly nude."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "sarcastic",
    "text": "Powerful as ever. And he's already partly fulfilled your wish by removing his helmet, even though he has no head underneath it. I'd say it's impossible to expose yourself any more brazenly than that."
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "Nutcracker, there's one thing about what you say I can't understand. How can you change what's in front of a person's eyes without him noticing? If he's looking at the same place but sees something different, how can he fail to notice?"
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "calm",
    "text": "I couldn't understand that at first either. But for the Helmholtz the word 'change' has no meaning. In real life what you see depends on where you look. But when you're wearing a helmet, it's the other way round - where you're looking depends on what you see. Is that clear?"
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "Not entirely."
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "contemplative",
    "text": "In the real world you see what's in front of your eyes. No matter which way you point your rump. But in this world you see what's in front of your eyes, no matter which way you point your head. As we used to say in the xxx, it's chalk and cheese, even though it sounds pretty much the same. You don't have any independent system of coordinates, and we decide everything you see. So you can't even suspect anything. For you even the world isn't what it really is, but what's shown to you. You feel like you're looking around in a natural manner, but in fact all the time your eyes keep stumbling over our candidate - sorry, I mean our vase - and it gives you this light and happy feeling. But you never think to ask why, the same way no one ever asks why it's a sunny day."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "An interesting slip of the tongue."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "And if the mark turns his head too rapidly, so that 'Sticky Eye' and 'Sunny Kiss' stop working, then 'Doom and Gloom' and 'The Weight' kick in immediately."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "Well, Nutcracker, so now I understand what you do for a living. Tell me, as a professional, do you reckon they could be influencing us in some similar kind of way in here?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "contemplative",
    "text": "I'd have to think about that."
  },
  {
    "character": "UGLI 666",
    "to": "Organizm(-:",
    "mood": "sarcastic",
    "text": "I noticed a long time ago that conspiracy theory has taken the place of religion for atheists. They always think there's someone manipulating them, hypnotising them, zombifying them, bugging them, trailing them. But that someone is simply the devil, and that's all. The fact is, it's only a short step from atheism to schizophrenia, and in most cases it's already been taken. What about you, Organism? Do you feel like someone's manipulating you?"
  },
  {
    "character": "Organizm(-:",
    "to": "UGLI 666",
    "mood": "calm",
    "text": "To be honest, I do."
  },
  {
    "character": "UGLI 666",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "What kind of manipulation is it?"
  },
  {
    "character": "Organizm(-:",
    "to": "UGLI 666",
    "mood": "resigned",
    "text": "Being locked in here, for instance. Or being fed pancakes for the second day running."
  },
  {
    "character": "UGLI 666",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "Ah, in that sense. But that's not manipulation, that's God's punishment."
  },
  {
    "character": "Organizm(-:",
    "to": "UGLI 666",
    "mood": "calm",
    "text": "Ugly, let me explain to you how we're manipulated in here. Let's assume that headgear on Asterisk's head is a virtual reality helmet after all."
  },
  {
    "character": "UGLI 666",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "And then what?"
  },
  {
    "character": "Organizm(-:",
    "to": "UGLI 666",
    "mood": "contemplative",
    "text": "Perhaps everything we see here is something like that flat area Nutcracker was talking about - with the three identical vases, except one of them is more identical than the others."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "For us to be manipulated like that, we'd have to be wearing helmets."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "Maybe we are."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "Touch your face with your hands. Can you feel any helmet?\nOrganism(-:\nNo, but ..."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "I know what he's going to ask now. He's going to ask whether you can use a helmet to simulate what you feel with your hands."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Well that's right. It seems a natural enough question to me."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "contemplative",
    "text": "If everything is simulated by the helmet, then it's not a helmet or a simulation any more. It's life."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "Nutcracker, there's one thing you didn't explain. Who switches on all these 'Sticky Eyes' and 'Sunny Kisses'? Surely someone has to control it all?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "Certainly. There's an operator with a special monitor. He sees the Helmholtz as a dot on a radar screen. And the vases would be, say, red rhomboids. There's a manipulation menu on the same screen. The rest is all just like in Windows - click and drag."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "Click and drag. A great slogan for a double-edged axe."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "And how can you do it the other way round?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "confused",
    "text": "How do you mean?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "So the virtual reality helmet is on the operator who controls the manipulation. And this operator somehow makes the others see what he sees."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "How could he make them do that?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Hypnosis."
  },
  {
    "character": "UGLI 666",
    "to": "Organizm(-:",
    "mood": "sarcastic",
    "text": "There you are. I was just waiting for that word."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "I don't know much about hypnosis. But if a hypnotist was powerful enough to make others see what he sees, why would he need a helmet?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "In order to know what the others have to see."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "contemplative",
    "text": "You could take it even further. Not just seeing, but actually being there. Asterisk wears a helmet in which he sees a labyrinth. And we're all inside this labyrinth. And he manipulates us."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "You mean we're all inside the Minotaur's head?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "You could say we're in the space that he sees."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Then where's the Minotaur?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "We have to assume he's in the space that Ariadne sees in her dreams."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "resigned",
    "text": "End of the line. Remember, Nutcracker, at the very beginning you asked me 'Where is here exactly?' I didn't understand your question at first. In the helmet of horror, that's where."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "confused",
    "text": "That doesn't fit, though. On the one hand, the Minotaur's manipulating all of us, but on the other hand, he's got no head ... But then again, quite apart from this particular case, I can testify professionally that's what causes all the problems."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "Absolutely. This Asterisk has a cheap kettle with a solar battery in his helmet. How can he decide where to use 'Sunny Kiss' and where to use 'The Seventh Seal'?"
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "contemplative",
    "text": "Automatically. It might all depend on which section of the helmet of horror a bubble of hope happens to burst in."
  },
  {
    "character": "Organizm(-:",
    "to": [
      "Monstradamus",
      "Nutscracker"
    ],
    "mood": "confused",
    "text": "But I'm the one who sees the ray of sunlight or the dove, not Asterisk. I don't understand anything any more. Who's wearing the helmet of horror? Me or the Minotaur?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "The Helmholtz."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "resigned",
    "text": "We've been talking about that helmet too long already. It feels like we keep trying it on over and over again. It will attach itself permanently to our heads soon. Let's change the subject."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "Great idea, let's. I've just had a thought. Has anyone ever wondered why Star Wars has such a strange sequel - instead of filming what came after the third episode, they filmed what came before the first one?"
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "Why?"
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "At the end of the third episode Darth Vader dies, and that's the end of all the Star Wars. There can't be any more, because he's the Minotaur of that world, and that black heap of junk on his head is the helmet of horror. He thinks every one of them: Luke Skywalker, the robots, Chewbacca and all the rest of it. So after he's killed there can't be any continuation."
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "confused",
    "text": "But Darth Vader takes his helmet off before he dies. And underneath he has a normal head, only covered in scars."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes, but it's just a fantasy, after all."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "sarcastic",
    "text": "Yes, Organism. Very profound. And the Iron Mask was another Minotaur. When they handed him over to the Marquis de Sade to be corrupted, the revolution began, because the pain in his xxx made him stop thinking up royalist France."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "curious",
    "text": "Isolde, are you here?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "curious",
    "text": "I'm back. What's happening here?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "indifferent",
    "text": "Nothing very interesting. Nutcracker was telling everybody about politics. And I only got back from Versailles just recently."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "Nutcracker, on that business of royalist France. You know, the Marquis turned out not to be so terrible after all."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "resigned",
    "text": "It's all very monotonous where I am. Bushes, a bend, bushes, a fork, a bend, on and on for ever. The passage is about six feet wide."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "What's that in metres?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "anxious",
    "text": "Two. Makes you feel like a rat in a maze. At one point I decided I'd had enough and tried to climb through the hedge. Some chance. There's a barbed-wire mesh fence in the bushes - like the grid of bars in reinforced concrete. And I'd been wondering how they managed to keep the bushes so even!"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "contemplative",
    "text": "That labyrinth must lead out into my park. You just didn't go far enough. We have the same ground under our feet. Beige soil."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "contemplative",
    "text": "I kept turning to the right. It's funny. A flashback from my childhood. You know the way it is - a memory illuminated by a warm, long-forgotten light that seems to conceal the most important answer of all. Some book of adventure stories you read God only knows how many years ago. Where it said you can get through any labyrinth if you keep turning right all the time. So I decided to try it. Seems it was right - I did find something interesting after all. I saw one of your fountains. It was a long way off, though."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "Tell me about it, then."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "contemplative",
    "text": "At one point in the labyrinth there's a little bench. A perfectly ordinary bench, like they have in parks. I climbed up on it and stood on the back, and my eyes were level with the upper edge of the bushes. On one side I could see a jet of water rising into the air, and on the other, way off in the distance, some kind of dark roof that looked as though it was covered with soot. The roof was hard to make out because it was so far away, and the jet of water was very strange - one jet shooting up into the air, but several of them falling down. Maybe it was an optical illusion."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "joyful",
    "text": "No, that's right. I know that fountain. It has bronze figures too. There's a snake and a ... I've forgotten what it's called, like a pig with long spines."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "calm",
    "text": "A porcupine."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "Yes, that's it. A porcupine sitting on a bronze tree-stump with water flowing out from it in all directions, as though the beast had suffered bad fright. And the snake is coiled up creeping towards the stump and shooting out a tall jet of water that divides into three branches and falls like rain on the porcupine and everything all around. It's an incredibly beautiful fountain. The first time I saw it there was a little rainbow suspended in the spray of water beside it, and from that moment on I loved it best of all. There are actually three jets of water, but with different pressures. Their nozzles are set close beside each other in the snake's mouth, so it looks as though there's one jet rising into the air and three falling downwards. And I remembered the tattoo on your wrist, the oil and the yachtclub. Does the jet you can see above the bushes divide into three?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "calm",
    "text": "Yes, I think so."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "Aren't you absolutely sure?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "calm",
    "text": "I can see a jet of water and the roof of a house when I climb up on to a bench and stand on the back of it. But it's not possible to stand up there like that for very long, you sway backwards and forwards and then you lose your balance and you have to jump down. That makes it hard to make out the details. But if it is the same fountain you should see my labyrinth when you stand beside it."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "contemplative",
    "text": "There's a tall hedge beside the fountain with the snake and the porcupine and I can't tell what's behind it. It's very long - I walked a little way along it, the bushes fence off a large section of park. I think that must be your enclosure."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "hopeful",
    "text": "If you've walked along that hedge, at one moment we might only have been ten feet apart. I was beside it too, on my own side. I'm practically certain it was the outside hedge. In the first place, there were two rows of barbed fencing instead of just one in the bushes. And in the second place, there's a spot where you can clearly hear the sound of falling water. Oh and, by the way, beside the spot with the sound of water there's a long wall protruding from the bushes. It looks like the back of some building and it's painted with pink and gold Cupids blowing seashells like trumpets. Have you got anything like that?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "contemplative",
    "text": "There is a single-storey building to the right of the fountain. It looks like a pavilion for storing garden tools, except that it's very big. Its back section disappears into the high hedge. But I didn't see any Cupids on it."
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "curious",
    "text": "Can you get inside?"
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "The door's locked. Is there a door in your wall?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "calm",
    "text": "Yes."
  },
  {
    "character": "IsoldA",
    "to": "Romeo-y-Cohiba",
    "mood": "curious",
    "text": "Does it open?"
  },
  {
    "character": "Romeo-y-Cohiba",
    "to": "IsoldA",
    "mood": "fearful",
    "text": "To be honest I didn't try it. I stood beside it for a while and suddenly I felt terrified, I even got a pounding in my temples. I'm not the timid type at all, but suddenly there it was. For no reason at all. I thought - who knows what's inside there? What if it's the... Minotaur?"
  }
]