[
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "curious",
    "text": "Who wants to chat?"
  },
  {
    "character": "Ariadne",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "I do."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "And I do."
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "resigned",
    "text": "And I do I suppose."
  },
  {
    "character": "Organizm(-:",
    "to": [
      "Monstradamus",
      "Ariadne",
      "Nutscracker"
    ],
    "mood": "contemplative",
    "text": "An interesting team. Monstradamus, Ariadne, me and Nutcracker. Has anyone noticed that the four of us have something in common?"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "playful",
    "text": "It would be hard not to notice. We all use toilet paper with a little star on it."
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "hopeful",
    "text": "And we share a great passion for life."
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "calm",
    "text": "That's not all, though."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "sarcastic",
    "text": "We've all been fed garbage just recently as well. Did everyone get that putrid lasagne yesterday? And how did you like today's vegetarian beefsteak, rare and bloody?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "That's not it either."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "contemplative",
    "text": "I know what he means. None of us has said anything about our labyrinths."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Really? It's just that no one's asked me."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "And are you willing to tell us?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Of course."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "So what have you got outside your door?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "A bedroom."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "surprised",
    "text": "What, just an ordinary bedroom?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "No, not ordinary. If you ever leaf through those fashionable journals with all the chic interiors, you might have seen something of the kind. It's a large room, and the bed takes up at least half of it. The mattress is so wonderful I don't even know how to describe it. I should write more poems. When you lie down on it, it feels like you're parachuting through the air, soaring along the pillows, the blankets and the sheets - everything is absolutely the very best. And there's an air conditioner with heaps of different operating modes. You can set it so that a fresh breeze blows through the room as though it's coming straight off the sea. And there are thick curtains on the window that ..."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "You've got a window? What does it look out on?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "I don't know. There's some kind of garden, and the branches of trees. I can't see anything else."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "Have you tried opening it?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "resigned",
    "text": "The window doesn't open. What else now? There's a really elegant wall-lamp above the bed and a night-lamp in the corner. There's a mini-bar too, only there aren't any drinks in it, nothing but little boxes of sleeping pills. There are lots and lots of them, all beautiful kinds of colours, and inside each one there are instructions on how many pills you can take at once, which ones you can take with others, which ones you can't, and so on. Only I don't need any sleeping pills. I only have to lie down on the bed, and I'm gone. I just fly away."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "And is that all there is?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "When I leave the bedroom for a long time - say an hour or more - someone changes the sheets and makes the bed. But I haven't met anyone, not even once. And there aren't any other doors in the bedroom, there's only one way in."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "How do you explain that?"
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "fearful",
    "text": "I don't try. It's less scary that way."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "sarcastic",
    "text": "A labyrinth like that could give you bedsores, Ariadne."
  },
  {
    "character": "Ariadne",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "You weren't listening to what I said, Nutcracker. The mattress I have is so wonderful I can't even feel it. What bedsores? An angel could sleep on it without even creasing its wings."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "contemplative",
    "text": "That's an interesting subject. How angels sleep."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "Probably like bats, on a coral perch. And they have special gold hooks on their slippers."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "contemplative",
    "text": "Perhaps. Only they hang head-up, because they aren't attracted by the earth's gravity, only by the love of the Lord. Like Ugly said. Angels are non-material beings."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Then how did they manage to choose wives for themselves from among the daughters of man and beget children?"
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "playful",
    "text": "Ugly probably knows about that. Or she can check with some of her friends. Ugly, are you there?"
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "contemplative",
    "text": "By the way, on the subject of checking with your friends. Ariadne, you said we could ask you questions about the helmet of horror in case you have another dream about our management."
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Of course."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "curious",
    "text": "I have three. Firstly, I really would like to know how everything else can be manufactured out of nothing. And secondly, how the helmet of horror can be located inside one of its own parts, and does that mean that inside one helmet there is a second one, and inside the second a third one, and so on to infinity in both directions? And the final question is - exactly how does the separator labyrinth work?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "All right, I'll ask."
  },
  {
    "character": "Nutscracker",
    "to": "Ariadne",
    "mood": "curious",
    "text": "And at the same time ask them to say something about the occipital braid. So far we don't know a single thing about it."
  },
  {
    "character": "Organizm(-:",
    "to": "Ariadne",
    "mood": "curious",
    "text": "I have a question - why is the helmet of horror called that?"
  },
  {
    "character": "Ariadne",
    "to": "",
    "mood": "calm",
    "text": "All right. I'll be going then."
  },
  {
    "character": "Monstradamus",
    "to": "Ariadne",
    "mood": "surprised",
    "text": "Just like that?"
  },
  {
    "character": "Ariadne",
    "to": "Monstradamus",
    "mood": "resigned",
    "text": "I'll forget the questions later."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Go on then. And we'll carry on here. What was that you said about your labyrinth. Monster?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "When was that?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "When Ugly was telling us about the cathedral. They showed her something like a target and said it was the most mystical labyrinth there could possibly be. And you claimed the most mystical one was yours. I'm curious about what it is."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Sartrik"
    ],
    "mood": "contemplative",
    "text": "I think I really ought to take those words back. The most mystical one is probably Sartrik's. Sartrik, are you there?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "He must be busy with his booze now."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Sartrik",
      "Organizm(-:"
    ],
    "mood": "curious",
    "text": "Then tell me about your labyrinth. Or Organism can tell us about his."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "indifferent",
    "text": "I haven't got anything interesting. Just a screen-saver."
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "confused",
    "text": "What?"
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "In Windows there's a screen-saver called 'maze'. And I've got a model of it here. Built out of planks instead of pixels. It's the only time I can ever recall software being turned into hardware."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "confused",
    "text": "Did anyone understand that?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "I know what he's talking about. It's a kind of program."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "And it switches off the screen?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Just the opposite, it switches it on to full power."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "Then why's it called a screen-saviour? What kind of salvation is that?"
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "sarcastic",
    "text": "Ugly can ask her canons about that. They know all about saviours and salvation."
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "If that is a blasphemous insult to the Saviour, He'll forgive you for it, you sinful simpleton. But I advise you to leave the Holy Spirit alone."
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "skeptical",
    "text": "Ah, you're back. Am I correct in suspecting your saviour also doubles up as the creator?"
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "That's right."
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "sarcastic",
    "text": "Do you know who he reminds me of? A spiteful little sorcerer who gets the urge to torture a kitten. So he goes down into a deep, dark cellar, moulds a kitten out of clay, brings it to life and then - whack! - he smashes its head against the corner of the wall. And he does that every weekend, a hundred times or more. And to make sure no miaowing is ever heard from the cellar, our sorcerer teaches the kittens to think stoically - I came from the dust and to the dust I return. And he forces them to pray to him for the few seconds of their existence."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "surprised",
    "text": "God only knows what goes on inside that head of yours, Nutcracker."
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "Not God, the devil. That's already a blasphemy against the Holy Ghost, take care Nutcracker. The Lord does not force us to pray to him. We choose our own path, because he created us with free will."
  },
  {
    "character": "Nutscracker",
    "to": "UGLI 666",
    "mood": "sarcastic",
    "text": "Don't make me laugh, Ugly. Free will. Life's like falling off a roof. Can you stop on the way? No. Can you turn back? No. Can you fly off sideways? Only in an advertisement for underpants specially made for jumping off roofs. All free will means is you can choose whether to fart in mid-flight or wait till you hit the ground. And that's what all the philosophers argue about."
  },
  {
    "character": "UGLI 666",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "Nutcracker, you're always trying to turn any conversation into a farting match. I must say sometimes you manage it."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Nutscracker",
      "UGLI 666",
      "Organizm(-:"
    ],
    "mood": "resigned",
    "text": "Stop it will you, you're like little children. Let's just drop it. Why don't you tell us about this screen-saver, Organism?"
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "calm",
    "text": "It's a standard program. If you don't touch the keyboard for a few minutes, a labyrinth with red-brick walls appears on the screen, with a camera moving through it. It has all sorts of bells and whistles, like stones that turn everything upside down when you bump into them. The ceiling becomes the floor, the floor becomes the ceiling, and the camera starts turning in the opposite direction at the forks in the path. There's a big rat in the labyrinth too. I've actually got two screen-savers like that. The first one appears on the screen when I forget about you lot for a long time. And the second is right outside my door, constructed fairly accurately out of plywood and planks. It even has a rat in it - a kind of little mat with a plush face and paws sewn on to it. Sometimes the rat is lying in the passage. Sometimes it's glued to the ceiling. There are tumble-stones too, blocks of grey plastic. Only they don't turn anything upside down. If you touch one of them, the maze freezes."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "confused",
    "text": "What do you mean, it freezes?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "That's what I call it, like a computer program. What happens is, the light goes out and a panel lights up above the tumble-stone: 'This program has performed an illegal operation and will be shut down. If the problem persists, contact the program vendor.'"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "Then what happens?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "anxious",
    "text": "I have to go home in the dark. And that's a bit of a drag, because the voices start to get on my nerves."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "What voices?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "anxious",
    "text": "All kinds. Quiet and loud. Women, men, even children. Sometimes far away. Sometimes close up."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "So what do these voices say?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "fearful",
    "text": "Always the same thing: 'I am the vendor, I am the vendor. What will you do? What can you do?'"
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "sarcastic",
    "text": "Yes, you've been screwed all right. And doesn't Bull Gates ever get in touch?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "resigned",
    "text": "No, he doesn't."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "playful",
    "text": "Maybe he does, but you just don't understand. Maybe the Minotaur's actually the dead rat on the ceiling."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Maybe. Anyway, if you don't touch these stones, and avoid doing a couple of other things, you can walk right round the labyrinth without any bother. And then you realise fairly quickly it's not a real labyrinth at all, just a big concrete cellar with plywood partitions."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "Have you tried breaking down the partitions?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "anxious",
    "text": "If you shift them even slightly, the whole thing freezes instantly. Then you have to find your way out in the dark and listen to those voices. It's better not to touch anything."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "Have you reached the centre then?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Yes, I have."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "And what's in it?"
  },
  {
    "character": "Organizm(-:",
    "to": "",
    "mood": "confused",
    "text": "A little room with the words 'Open GL' on the wall. The real screen-saver has the same words, but they hang in the air there, and here they're daubed on the plywood in gloss paint. What does that mean, anyway?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Do you know, Monster?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "Open General License. Or maybe Open Great Labyrinth."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "So there's nothing but those words in the central room, Organism, is that right?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "There's a chair as well, with a mirror in front of it."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "playful",
    "text": "I can guess. Tarkovsky's Mirror."
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "resigned",
    "text": "I sat there for ages and ages. I had the feeling I was about to understand the most important thing of all at any moment. But I didn't understand a thing."
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "calm",
    "text": "That's always the way."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "What do you mean? Always the way when you sit looking into a mirror for a long time?"
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "contemplative",
    "text": "Always the way when you feel you're just about to understand something important. It's like the whistle of a bullet or the roar of an aeroplane. If you can hear them, it means they're already zooming past you."
  },
  {
    "character": "Nutscracker",
    "to": "Organizm(-:",
    "mood": "curious",
    "text": "Organism, why are you so sure the centre of the labyrinth is where the mirror and the chair are?"
  },
  {
    "character": "Organizm(-:",
    "to": "Nutscracker",
    "mood": "confused",
    "text": "Because of the mirror and the chair. What else would they be doing there?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "That seems pretty obvious."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "So what have you got, Monster? I'm dying of curiosity."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "You go first, we agreed."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Okay. I'll tell you what I've got. It's a bit like a TV editing room. Professional equipment - a Betacam VCR, a special monitor, all sorts of mixers for functions I don't really understand. The whole works. There's a weird-looking poster hanging on the wall, a picture of a dog in an empty white room. On the wall in front of the dog there's something like a distribution board with a few little lamps screwed into it. Two of them are lit up - a red one on the left and a blue one on the right. And below the lamps there's a bell, surrounded by drawings of sound waves - it's obviously ringing. There's an electrode inserted into the dog's head, with wires leading from it to the distribution board. And there's a cut on its belly stuck together with sticking plaster and a rubber tube leading down out of it into a glass flask standing on the floor. The dog's right paw is raised, its tongue is hanging out, its ears are pricked up and its eyes are full of love. The text underneath it reads: 'Put it there, bro!' The first time I saw it I just froze. I wondered how the moderators could have found out. It was only afterwards I remembered I told you all about 'Pavlov's Bitch'. Standing under the poster there's a safe full of Betacam tapes with episodes of 'The Hornists of Plenitude' - that's a kind of chic international TV programme, it has these interesting titles, with the globe flanked by two bugles. The tapes all contain pretty much the same thing: a television address by someone putting himself forward for the job of Theseus. In most cases the candidate is a middle-aged man with a pleasant face and good diction. He's sitting in front of some kind of symbol, with a dozen microphones standing on a table in front of him. He promises to deal with the Minotaur and lead everyone out of the labyrinth. Before that, naturally, he expounds his own vision of what the labyrinth is and who the Minotaur is."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "What kind of visions are they?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "indifferent",
    "text": "All sorts."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "How about an example?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Well, take the last one for instance. The candidate was a tall man with grey hair. A professor of history, very distinguished looking, stylishly dressed. And his symbol was beautiful, a bit like a knight's coat of arms: a bull's skull in a net against a hatched ground. The man said the labyrinth is a symbol of the brain. An exposed brain and a classical labyrinth even look very similar. The Minotaur is the animal part of the mind and Theseus is the human part. The animal part is stronger, of course, but the human part triumphs in the end, and this is the meaning of evolution in history. At the very centre of the labyrinth there is a cross that symbolises the intersection of the animal and human principles. That is the site of the initiatory passage, where Theseus meets and conquers his enemy. He said you can only conquer the Minotaur in yourself. We must strangle the beast without mercy, and then we will be morally justified in renaming the Helmet of Horror the Helmet of Civilisation and Progress."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "And what was his program like?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "In the labyrinth you have to turn twice to the right and once to the left, then twice to the right and once to the left again, and so on right to the end."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "Tell us about another one then."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "The last but one. A Frenchman. He was definitely the cleverest of the lot, and his appearance was very picturesque - a threadbare Chinese field jacket, with a pipe and a wild shock of hair. His symbol was a red and white chessboard with butterflies on the white squares and letters from various alphabets on the red ones. For the first few minutes he just stared into the camera, then he ruffled up his hair and announced that he would start with a truism. The major achievement of contemporary French philosophy, he said, was its success in establishing a non-contradictory unity of liberal values and revolutionary romanticism within the bounds of a unitary sexually aroused consciousness. After that he glared out of the screen for at least a minute without speaking, then he raised a finger and explained in a whisper that this declaration, despite its crystal clarity, is already a labyrinth, for a labyrinth comes into being in the course of any discussion with yourself or others, and for that period of time each of us becomes either the Minotaur or his victim. Although there is nothing we can do with this, he continued, there's nothing we can do without it either. Specifically, however, we can introduce a broader concept than the labyrinth - we can declare a discourse."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "Oh Mama! When I hear the word 'discourse', I reach for my simulacrum."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "According to the shaggy professor, a discourse is the place in which words and concepts, labyrinths and Minotaurs, Theseuses and Ariadnes all come into being. Even the discourse itself can only come into being within the discourse. But the paradox is that, although the entirety of nature arises within it, the discourse itself is not encountered anywhere in nature and was only developed quite recently. Another tragic dissonance is that, although everything comes into being within the discourse, without funding from the state or private individuals the discourse itself only lasts for three days at the most and is then extinguished forever. And so there can be no more urgent task for society than to fund the discourse."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "Okay, I understand about the discourse, but what did he say about the labyrinth?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "When he was talking about the labyrinth he spoke very quickly, so I don't remember it all. Basically, a labyrinth comes into being when you have to choose between several alternatives, and the alternatives are a set of our possible preferences, conditioned by the nature of language, the structure of the moment and the specific features of the sponsor. I didn't understand very much after that, I only remember that at some point he launched into the 'Internationale', and at first he sang really loudly and menacingly, but after a minute he shifted into 'Happy birthday to you'."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "That's called the plurality of discourses. I remember that from university. And what did he say about the Minotaur?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "The Minotaur is you."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "surprised",
    "text": "Me?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "I could almost feel you shudder. He didn't mean you in person. He looked into the eyes of his imaginary viewer, waved his arms about like an eagle flapping its wings and yelled: 'Minotaure! Minotaure, c'est toi!! Tu es Minotaure!!!' Then he calmed down. He said you simply have to understand that the Minotaur is a projection of your mind and therefore he is nobody else but you."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "Did he say what we ought to do?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "What else? As long as there's a sponsor, carry on with the discourse!"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "But what turns do we make in the labyrinth?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "We follow the turns the discourse takes."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "Interesting."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "To be honest, I didn't really understand what a discourse is, even after the hairy guy had just been talking about it."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "It's something like a glue that sticks the helmet of horror on really solidly. So you can't get it off again."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "anxious",
    "text": "Don't frighten me."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "You're the one who's been frightening me for the last hour. Were there any women candidates?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Yes. There was one very attractive little heifer who looked like a psychiatrist. Her symbol was right for that, too: a bull on a chain lying on a couch. I don't remember everything she said now, but the main idea was that the only way to defeat the Minotaur is to stop thinking of yourself as a victim. Then he'll simply disappear. Everyone has his own Minotaur, she said, but in reality it's not he who pursues us, we pursue him. And the labyrinth in which we seek him is the dopamine chains of pleasure linking up into rings in the human brain - they're different for everyone, as unique as fingerprints. And as for which turns to make in the labyrinth, it's all very simple. Suppose you're standing at an intersection with ten identical corridors leading in different directions. Then of course your choice of which corridor to follow should not be determined by fears and superstitions, but by the promptings of simple common sense."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "So did you make a choice?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "How do you mean? Between corridors?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Between candidates."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "I'm not really sure what position I'd be choosing the candidate for. Or what institution, or what term. Or how he'd be going to lead me out of the labyrinth, when the room has no doors or windows."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "playful",
    "text": "He'll lead you out through the television. How else? You of all people should understand that. Is there anything else you remember?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "I watched it all on fast forward, just listened to each one for about five minutes to get the general idea. As long as they're talking it all seems interesting and new. Then you wind on the cassette and you've forgotten it all. Some American or other said that the labyrinth is the Internet. That it's inhabited by a some being that hacks into the mind, and that's the Minotaur. It's not really a bull-man, it's a spider-man. He said if there's a worldwide web, then there must be a soul-sucking spider. He also explained why the Minotaur has two names. It seems that 'Minotaur' is the politically correct version of the name 'Asterisk'. So every time we want to say 'Asterisk', we should say 'Minotaur'. But then 'Asterisk' is the politically correct version of the name 'Minotaur', and every time we want to say 'Minotaur' we should say 'Asterisk'. And so in principle we can use both names, only not when we want to, but the other way round. There was an interesting German who said that the Minotaur is the spirit of the time, the Zeitgeist , which has manifested itself in the form of mad cow disease, hence its symbolic representation in the form of a man with a bull's head. Its counterpart in art is postmodernism, which is the mad cow disease of a culture forced to feed on its own powdered bones. And in politics it's all that stuff you see and feel when you switch on the television. Then there was an Italian, dressed in black, who announced that the Minotaur - he said 'Mondotaur' - is a being whose physical body is the gross dollar supply. It's stupid to believe that everything is controlled through money, he said - why through it and not by money itself? The Mondotaur is the evil spirit that reigns over the world, and compels every single one of us to wander aimlessly through the foul, stinking labyrinth of his intestines. And his two horns are ... I've forgotten."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "It doesn't matter, I can imagine."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "Then a priest with kind eyes spoke and explained that the creator of the labyrinth is also our saviour, who loves us greatly. In much the same way as we love little children, he said."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "curious",
    "text": "And what proposals did they all have?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "calm",
    "text": "It all came down to how many times to turn right and how many times to turn left, and in which order. Everyone wanted to do it his own way."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "Perhaps that's the whole point. Not to think about where the way out is, but to realise that life is the crossroads where you're standing at this precise moment. Then the labyrinth will disappear as well. After all it only exists as a complete whole in our minds, and in reality there is nothing but a simple choice - which way to go next."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "Uhuh. And the Minotaur won't do anything to us, because the present 'us' will no longer exist when he catches up with us. One of them said that as well."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "And now what's outside your door, Monstradamus? It's about time you told us, you're the only one left."
  },
  {
    "character": "Monstradamus",
    "to": "Organizm(-:",
    "mood": "resigned",
    "text": "You'll be disappointed, Organism."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "We'll see. So what have you got?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "resigned",
    "text": "A dead-end."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "I don't get it."
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "A corridor a few metres long ending in a blank concrete wall with a single depressing graffito . Or at least I find it depressing. The imprint of a gigantic seal drawn in fluorescent lilac paint, like something on an official document from Hell. In the centre is the Roman numeral 'VII' and running out from it in a spiral is an endless string of symbols like the ones that street-gangs leave on walls. Nothing but zigzags, intricate curls, arrows and brackets - impossible to make out a single word. But all very suggestive."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "surprised",
    "text": "Just a dead-end?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "That's all there is."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "confused",
    "text": "All there is?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Well, not quite. There's a table standing against the wall directly under the seal. And a stool by the table. And on the table there's a blank sheet of paper, a pencil and a pistol with a single bullet."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "What about the labyrinth?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "I think that starts afterwards."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "Truly magnificent simplicity and elegance."
  },
  {
    "character": "Monstradamus",
    "to": [
      "Organizm(-:",
      "Nutscracker"
    ],
    "mood": "contemplative",
    "text": "There's nothing for you to be envious of. You've got a dead-end too, only it's longer and it has plywood partitions. And Nutcracker's got a television instead of plywood. We've all got dead-ends. Only it's not obvious straightaway, it just takes a little while."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "Maybe that's the whole point - whether it's obvious straightaway or not. Don't you think the 'little while' it takes might just be life?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "Maybe so. But I'm fed up of these labyrinths you can't get lost in or escape from. And all these Minotaurs with horns on their xxx who promise to lead us out to the stars in just a moment. I wonder what Theseus will see instead of all this. I'd give a lot to find out."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "What do you care what he'll see?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "IMHO, Nutcracker, the possibility of escape is determined by whether you can see the way out or not."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "skeptical",
    "text": "I already told you, for the Helmholtz that's not exactly the way it is. The Helmholtz can see anything you like. Even the plan of his own helmet. For all the good it will do him."
  },
  {
    "character": "Monstradamus",
    "to": "Theseus",
    "mood": "curious",
    "text": "What I wonder is, has he got a head on his shoulders or a helmet of horror? Hey, Theseus! I know you can hear me!"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "To be honest, Monstradamus, I used to think you were Theseus."
  },
  {
    "character": "Organizm(-:",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "I was convinced Monstradamus was the Minotaur."
  },
  {
    "character": "Monstradamus",
    "to": "",
    "mood": "calm",
    "text": "I already told you, it all depends on which part of the separator labyrinth the bubble of hope was in when it burst."
  },
  {
    "character": "Sartrik",
    "to": "",
    "mood": "playful",
    "text": "Didn't you ever think I was Theseus?"
  },
  {
    "character": "Nutscracker",
    "to": "Sartrik",
    "mood": "playful",
    "text": "Well hello, Sartrik! You know, not even once ..."
  },
  {
    "character": "Organizm(-:",
    "to": "Sartrik",
    "mood": "calm",
    "text": "Somehow the idea never entered my head."
  },
  {
    "character": "Sartrik",
    "to": "Organizm(-:",
    "mood": "sarcastic",
    "text": "Organism, it's clear from your userpic that you're queer. Just look at that guilty smile and that gaping xxx."
  },
  {
    "character": "Organizm(-:",
    "to": "Sartrik",
    "mood": "angry",
    "text": "That's it, I'm going. You can talk to him.",
    "alias": "Organizm)-:"
  },
  {
    "character": "Nutscracker",
    "to": "Sartrik",
    "mood": "skeptical",
    "text": "Sartrik, that isn't a userpic. Perhaps we can call it a dialogue header. And that isn't a gaping xxx, it's a capital 'O'."
  },
  {
    "character": "Sartrik",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Monstradamus just said - right? - that everything is determined by what you see. I take that to mean that if someone can see the answer to the most important question of all, then he is Theseus. Am I right, Monstradamus?"
  },
  {
    "character": "Monstradamus",
    "to": "Sartrik",
    "mood": "curious",
    "text": "Possibly. But exactly what is the most important question of all?"
  },
  {
    "character": "Sartrik",
    "to": "Monstradamus",
    "mood": "contemplative",
    "text": "Let me explain. Have you noticed that we never exist simultaneously, only by turns?"
  },
  {
    "character": "Monstradamus",
    "to": "Sartrik",
    "mood": "curious",
    "text": "An interesting observation. You mean the writing on the screen?"
  },
  {
    "character": "Sartrik",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "I mean in general. Since you didn't understand the question, I'll ask it a different way. The helmet of horror is a machine. What does it run on? What does it have instead of petrol?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "He's lost it, Monster. Delirium tremens . He needs a drip installed."
  },
  {
    "character": "Monstradamus",
    "to": "Sartrik",
    "mood": "curious",
    "text": "Wait, Nutcracker. So what does it have instead of petrol?"
  },
  {
    "character": "Nutscracker",
    "to": "Sartrik",
    "mood": "playful",
    "text": "Vodka?"
  },
  {
    "character": "Sartrik",
    "to": "Nutscracker",
    "mood": "angry",
    "text": "Why vodka? Do you think I'm a drunken xxx and I don't understand a thing? Instead of petrol it has Theseus."
  },
  {
    "character": "Monstradamus",
    "to": "Sartrik",
    "mood": "curious",
    "text": "Explain that, please."
  },
  {
    "character": "Sartrik",
    "to": [
      "Monstradamus",
      "Nutscracker"
    ],
    "mood": "contemplative",
    "text": "You remember Ariadne looking into the mirror and seeing that hat with a veil, and afterwards she realised it was the helmet of horror? The petrol that the whole deal was running on was her, get it? Everything's made out of the person who sees it. Because it can't possibly be made out of anything else. Without the person there won't be any hat or any veil, or any lilies-of-the-valley. Nothing. Get it? Theseus is the one who looks into the mirror, and the Minotaur is the one he sees, because he's wearing a helmet of horror."
  },
  {
    "character": "Monstradamus",
    "to": "Sartrik",
    "mood": "curious",
    "text": "You mean to say the Minotaur is just an illusion?"
  },
  {
    "character": "Sartrik",
    "to": "Monstradamus",
    "mood": "angry",
    "text": "If you listened to what I'm saying, then you'd know what I'm trying to say. He sees this bronze phizog with horns on it because he sees himself in the mirror through the holes. Without Theseus there is no xxx Minotaur."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Did you get that, Monster?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Naturally. If you put on a Batman mask and look in the mirror, you'll see Batman. But the mask will never see itself."
  },
  {
    "character": "Sartrik",
    "to": [
      "Monstradamus",
      "Nutscracker"
    ],
    "mood": "angry",
    "text": "That's it. The helmet of horror is simply the reflection that Theseus sees, and that's all. But if he decides there really is a Minotaur and starts swearing blind at him and discussing the meaning of life with him, well that's when the Minotaur appears. And how! And then there's no way to get the helmet of horror off again. Get it now, you vermin? I know everything."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "sarcastic",
    "text": "I bet you he can see little pink Minotaurs running round the room. Now that's the kind of labyrinth I understand! And no need to bother going anywhere."
  },
  {
    "character": "Monstradamus",
    "to": "Sartrik",
    "mood": "curious",
    "text": "And why are we vermin?"
  },
  {
    "character": "Sartrik",
    "to": "",
    "mood": "angry",
    "text": "Because you're all nothing but bits and pieces of the helmet of horror. I figured that out ages ago. And that's the real xxx killer, when you realise that absolutely everybody - all your friends and all your enemies - are just little bits and pieces! I'm not talking about you. Meaning you're not my friends. And not my enemies. But you're bits and pieces, all right. You, Monstradamus, and you, Nutcracker - you're the horns. You'll stick out a bit too far some day. Ariadne's the labyrinth, but she's not such a bad girl, she's okay. Ugly's the past that makes me want to puke. And Organism's the future, that makes me want to puke five times worse. Who's left? Romeo and that Isolde of his? They're the double xxx that's cooking up the whole xxx mess."
  },
  {
    "character": "Nutscracker",
    "to": "Sartrik",
    "mood": "skeptical",
    "text": "And so you're Theseus?"
  },
  {
    "character": "Sartrik",
    "to": "Nutscracker",
    "mood": "sarcastic",
    "text": "Yes. Because I never talk to you."
  },
  {
    "character": "Nutscracker",
    "to": "Sartrik",
    "mood": "curious",
    "text": "What's your proof?"
  },
  {
    "character": "Sartrik",
    "to": "",
    "mood": "angry",
    "text": "That you're all nothing but shadows, I'm the only one here that's alive. You're nothing but shackles on the convolutions of my brain. All your Rolls-Royces and Lolitas, Ferraris and Berlusconis, all your shaved and scented glamour, your magic wonderland TV quizzes, where you get shafted up the xxx every day underneath the money tree - you made it all out of my head! You do all that out of my head, and I'm nothing to you, but you're the entire deal for me, eh? In my xxx head! But I'll dump you all."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Monster, maybe you understood some of that?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "resigned",
    "text": "I might have. But I'm not a hundred per cent certain."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "Translate from the Latin, will you?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "contemplative",
    "text": "There's quite a profound thought here. He's trying to say the helmet of horror is the contents of the mind, which attempt to supplant the mind by proving that they - the contents - exist, and the mind in which they arise doesn't. Or that the mind is no more than its function."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "Who are they trying to prove it to?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "Themselves. Certainly not the mind. The mind, as Sartrik puts it, couldn't give a xxx."
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "curious",
    "text": "And where are they trying to prove it?"
  },
  {
    "character": "Monstradamus",
    "to": "Nutscracker",
    "mood": "calm",
    "text": "What d'you mean, where? In the mind. Where else?"
  },
  {
    "character": "Nutscracker",
    "to": "Monstradamus",
    "mood": "resigned",
    "text": "This climb's a bit too high without a bottle. For me at least."
  },
  {
    "character": "Sartrik",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "Listen, Monstradamus, you're some guy! The way you put that! I even understood it myself. Some mess, eh? If you think that thought through all the way to the end, all those English astrophysicists and the entire xxx Academy of Sciences should be thrown in the slammer!"
  },
  {
    "character": "Monstradamus",
    "to": "Sartrik",
    "mood": "indifferent",
    "text": "Why bother putting them away? Who cares about those buffoons."
  },
  {
    "character": "Sartrik",
    "to": "Monstradamus",
    "mood": "playful",
    "text": "Oho! You're a hard case, aren't you? Theseus, you're Theseus, no two ways about it."
  },
  {
    "character": "Nutscracker",
    "to": "Sartrik",
    "mood": "sarcastic",
    "text": "You're a real Theseus too, Sartrik. Maybe you've even found the way out?"
  },
  {
    "character": "Sartrik",
    "to": "Nutscracker",
    "mood": "hopeful",
    "text": "A long time ago. Only there are these snakes crawling around in front of it. But when they crawl away I'll leave."
  }
]